{"calisphere-id": "27414--002bb10f-c05d-44be-8fd0-4d6d8658cc0e", "analyzed_filename": "curivsc_ms272_001_004.pdf", "word_bucket": "GENER.L ORDERS) HQ FIFTH AIR FORCE IN 3 `ctaber 190 C) /ward of \"edrl -- By direction of the Secretary of the Air Force, Exccutive Order 9158, 11 May 1942 (Sec III, Bul 25, WD, 1942) as amended by Executive Order 9242-h, 11 September 1942 (Sec II, Bul 49, WD, 1942), and National Security Act of 1947, the Air Medal for meritorious achievement while participating in aerial flight during the perind indicated is awarded to the following-named officers and airmen: Captain David V Severen, A0743107, United States Air Force 1 September 1950 t o 7 September 1950 Second Lieutenant NGil R Bartimus, A02073010, United States hir Farce i.8 Autust 1950 to 20 August 1950 Second Lieutenant Virgil E Plunkett Jr, A01909381, United States Air Force 4 August 1950 t o 15 August 1950 Licutenant Coloncl Harald L Frice, A0437222, United States Air Force 25 July 1950 to 4 August 1950 Second Licutenant Neil R Bartimus, A02073010, United States hir Force 21 August 1950 in 26 August 1950 (FIFTH OAK LeAF CLUSTER) Major James H Buckey, 9105A, United States Air Farce 1 August 1950 to 10 August 1950 Second Lieutenant Neil R Bartimus, A02073010, United States Air Force 27 August 1950 to -+ September 1950 Staff Serguant Austin G Roberson, AF34154255, United States Air Force 18 August 1950 to 30 August 1950 Lieutenant Colonel Gilton F Glessner, Jr, 3375A, United States Air Force 1 August 1950 t  10 August 1950 Licutenant Colonel Abraham L Shook, 14821A, United States Air Force & August 1950 t 10 Sentember 1950 Major James H Buckley, 9105A, United States hir Force 1] August 1950 to 23 August 1950. Major Frank T Ellis, 9823A, United States Air Force 26-July 1950 to 2 gugust 1950 Cippain John P Flynn, 15760A, United tes Air Force 26 August 1950 to 5 Sept-mbor 1950 General Orders No. 60, Hoadouarters Fifth Air Force in Korea APU 970, 3 October 1950, Cont'd Captain Bert J Coulait, Jr, A0349111, United Staties hir Force 6 Aurust 1950 to 17 August 1250 Captcin Nclvin T Jackson, 9570A, United States Air Force 10 August 1950 th 19 iugust 1950 Captain JUSSE I Jnry, 86596, United States Air Foree 26 August 3950 to G September 1950 Captain fletcher E Meadoiss A0825480, United States Air Force 3 August 1950 to 8 August 1950 Capthin Charls E McGec, A0807103, United States Hir Force 3 August 1950 to 14 August 1950 Captain James C Peck, A0668628, United States Air Force 1 August 1950 to 22. August 1950 Captrin Joseph H Stoin, A0790052, United Dtate e tes Air Force & July 1950 to 24 July 1950 Captain Robe rt E 17397A, United States. Air Force 7 August 1950 to 13 August 1950 First Allen C Durgin, A0763531, United States Air Force 17 July 1950 is 28 July 1950 First Licutenant Noah J Henson, A0708079, United tres hir Force 15 Aucust 1950 th 9 September 1950 First Lieutenant William C Miller, Jr, A0822331, United States Air Force 1 August 1950 to 13 August 1950 First Licutcnant Frank G Mitshell, 15177A, United States Air Force 10 July 1950 t o 14 July 1950 First Lieutentnt Edvard C: Falm, A0827718, United States Air Force 16 July 1950 to 23 July 1950 First Lieutenant Karl R Renz, 14348A, United States Air Force 11 July 1950 to 1 August 1950 First Lieutenont Robe.rt E A02059680, United States Air Force 16 July 1950 to 28 August 1950 Lieutenant Colonel Ben I Mayn, Jr, 40386, United States hir Force 11 August 1950 ts 18 August 1950 Major Frank T Fllis, 9823A, United States Hir Force 3 August 1950 to 15 August 1250 Captain Francis B Clark A0735747, United States Air Force 14 August 1950 to 26 Aurust 1950 Captain Melvin T Jack3on, 95706, United States Air Force 20 August 1950 to 10 September 1950 Captain Fletcher E Meadors, A0825480, United States Air Force 1? August 1950 to 24 August 1950 Cantain Joseph H Stein, A0790052, United States Air Farce 25 July 1950 t o 14 August 1950 Captain Robert E Wayn`, 17397A, United States Air Force 15 August 1950 to 22 Aulgust 1950 2 General Orders No. 60, Huadourrto Fifth Air Force in Koree, AP 970 3 Octobur 1950, Cont d . First Licutenent Glunn A Stover, A0681237, !nit d States hir Force 23 .Tuly 1950 to 15 sugust 1250 DISTRIBUTION \"!Bu PLUS: 5 CVS - The Air Adjutert Ha US.F, LTTN: Publications Division, shington 25, D. C. CVS GHC, APO 300, ATTN: G-3 Tranp Contral FELF, ATTN: Deputy fore rations Air Force Jiaison KansAs City Records Contir By direction of the Secretary of the Air Force, Captain Charles Edward McGee, AO 807 103, has been awarded the Sixth Oak: Leaf Cluster in Lieu of an Additional Air Medal. C CITATION I T A T I 0 N Captain Charles E AO 807 103, did distinguish himself between 3 August 1950 and 14 August 1950 by meritorious achievement while part- icipating in aerial flights against invaders from North Korea. By succ- essfully completing ten (10) combat missions in F-51 type aircraft, he greatly furthered the efforts of his squadron and fightin forces of the United Nations. Captain McGee, flying at extremely low altitudes, did strafe, rocket, and bomb enemy troops, artiller- armament, and other war materiel: during these flights he was in constant danger from enemy air- craft, ground fire, and artil]ery. By display of aerona skill and intrepid aggressiveness, Captain McGee proved to be a credit to himself and to the United States Air Force. 24 Sept r 1950 ) 35 ) HEADQUARTERS 18TH FIGHTER BOMBER GROUP APO 75 SPECIAL ORDERS 30 August 1950 NUMBTR 58 ) The fol Ainn, USAF, Hq, 18th Ftr Bmr Go, APO 75, are placed on T DY for a period not to excead seven (7) days on or about 30 Aug 50 to Clark AFB, APO 74, for the purposs of visiting families residing thereat. Upon complation of TDY Amn will return to proper organization. TBMAA. TBGMVA. NPDA. Ex- tonuating circumstances axisting necessitates the issuance of these orders. AUTH: 5th AF Rad ADV-Per-B-500 and FEAF Rad MX 18197. M Sgt John King AP65434v4 M Sgt David F. Nichols AF14055712 2. UP of AF Manual 35-1, as amended, the primary SSN 405 (Clork-Typist) of Cpl Edward 0. Morphis, AF17230898, USAF. 67th Ftr Bmr Sq, APO 75, is changed to 275 (classification Spacialist) S Sk, eff this date. 3. UP of AF Manual 35-1, as amonded, the primary SSN ^55 (Clork Non-Ty- pist) of Sgt John E. Gifford, AF18276+59, USAF, 67th Ftr Bmr Sq, APO 75, is changed to 75' (Padio Mechanic) S Sk, eff this dats. 4. UP of AF Manual 35-1, as amended, the primary SSN 747 (Airplane & Engine Mechanic) of Sgt Samusl Stotson, AF12021093, USAF, 67th Ftr Bmr Sq, APO 75, is changed to 594 (Parsonal Equipment Technician) S Sk, eff this datc. 5. The primary duty of the fol Offs, 67th Ftr Binr Sq, APO 75, USAF, is redosignatod as indicated, eff this date: NEW NAME RANK AFSN PDY ASGMT PDY ASGMT CHAPLES T: Mc GEE CAPT (2161) Opns off 54) Sg Exec off C. HOAGLAND JR. CAPT 11355A (2161) Asst Opns (2161) Opns off off BY ORDER OF LIEUTENANT COLONEL ?INTERMUTE: JACK A. CARTWRIGHT Major, USAF Adjutant OFFICIAL: JACK A. Ma.jor, USAF Adjutant \"C\" PLUS 3 - A-1 Div, 6002nd Ftr WE, (SE), APO 75 3 - AG Sec, 6002nd Ftr Wg, (SE), APO 75 3 - Ea off and Amn concerned HEADQUARTERS 18TH FIGHTER BOMBER GROUP APO 75 SPECIAL ORDERS ) 24 August 1950 NUMBER 56 ) 1. 1 ST LT BILLIE R. COTHERN, A0829654, USAF, 67th Ftr Bmr Sq, APO 75, is placed on seven (7) days T DY on or about 23 Aug 50 to Clark AFB, APO 74, for the purpose of aiding in the departure of dependents for the Z. I. Upon completion: of TDY off will return to proper organization. TBMA.A. TBGMVA. NPDA. AUTH: 5th AF Rad ADV-Per-B-500 and FEAF Rad MX 18107. 2. 1 ST LT (1059) KENNETH H. BARBER, 17845A, USAF, is reld fr asgmt to the 67th Ftr Bmr Sq, APO 75, and reasgd to Hq, 18th Ftr Bmr Gp, APO 75, and assigned primary duty SSN 2161 (Asst Opns off), NTI. EDCSA: 24 Aug 50. 3. 1 ST LT KENNETH H. BARBER, 17845A, USAF, Hq, 18th Ftr Bmr Gp, APO 75, is atchd to the 67th Ftr Bmr Sq, APO 75, as Combat Crew Member for flying purposes only. 4. SMOP 6, SO 55, this Hqs, cs, as reads: \"Sgt Arthur D. Craig Jr., AF12229559\", is amended to read: \"Sgt Arthur D. Craig Jr., AF12295559\" 5. SMO.P 7, SO 55, this Hqs, cs, pertaining to assignment of primary duty of the fol Offs, 67th Ftr Bmr Sq, APO 75, is hereby revoked, CAPT EDWARD C. HOAGLAND JR. 11355A CAPT CHARLES E. McGEE AO 8071 03 1 ST LT DANIEL LEAKE JR. A0712020 5 The fol Offs, 67th Ftr Bmr Sq, APO 75, are assigned primary duty as indicated, eff 6 Aug 50. AUTH: VO CO , 18th Ftr Bmr Gp, APO 75, NAME RANK AF SN PDY ASSIGNEMENT EDWARD C. HOAGLAND JR. CAPT 11355A (2161) Asst Operations officer CHARLES E. Mc GEE A0807103 2161) Operations officer DANIEL LEAKE JR. 1 ST LT A0712020 (4823) Engineering officer 6. VO CO , this Hqs, 10 Aug 50, the fol Offs, Hq & Hq Sq, 6002nd Ftr Wg, (SE), APO 75, having been placed on DS with this Hqs, APO 75, are further placed on DS with organisations indicated, APO 75, C&MR: CAPT DONALD E. EBERHARDT 18182A 12th Ftr Bmr Sq CAPT JAMES C. PEEK AO 668628 12th Ftr Bmr Sq CAPT ROBERT E. GOTCHEY 6812A 12th Ftr Bmr Sq 1 ST LT RAMON R. DAVIS A0767164 12th Ftr Bmr Sq 1ST LT JAN E. BARMORE A0780829 12th Ftr Bmr Sq 1 ST LT BERNARD L. PEARSON A02078873 67th Ftr Bmr Sq 1 ST LT JACK A. LIGHTNER A0 20101906 67th Ftr Bm Sq 1 ST LT DANIEL E. FARR III 17036A 12th Ftr Bmr Sq 1ST LT WILLIAM E. HYDORN JR. 14829A 67th Ftr Binr Sq 1 ST LT PARKS M. REA A0782360 12th Ftr Bmr Sq 1 ST LT VERNON L. GOMES A0776490 12th Ftr Bmr Sq 2ND LT THEO DORE BAADER A01908490 12th Ftr Bmr Sq SO 56, Hq, 18th Ftr Bmr Gp, APO 75, dtd 24 50 BY ORDER OF LIEUTENANT COLONEL WINTERNUTE: JACK. A. CARWRIGHT Major, USAF Adjutant JACK A. CARTWRIGHT Major, USAF Adjutant DISTRIBUTION \"C\" PLUS 3 - A-1 Div, 5th AF 3 - AG Sec, 5th AF 3 - A-1 Div, 6002nd Ftr Bmr Wg, APO 75 3 - AG Sec, 6002nd Ftr Bmr Wg, APO 75 3 - Ea off and Amn concerned HEADQUARTERS 18TH FIGHTER BOMBER APC 75 SPECIAL ORDERS ) 21 August 1950 The fol Amn, USAF, are reld fr asgmt to the 67th Ftr Bmr Sq, APO 75. and reased to the 12th Ftr Bmr Sq, APO 75, NTI. EDCSA: 22 Aug 50, Sgt (754) Raymond M. Staehnke AF192466 58 Sgt (754) Merle L. Wade AF37710254 2. UP of AF Manual 35-1, as amended, the primary SSN 835 (Supply of Sgt Alistair H. Cowe, AF17245014, USAF, 67th Ftr Bmr Sq, APO 75, is changed to 821 (QM Supply Technician) S Sk, eff this date. 3 MAJOR MELVIN W. FAULK, 6767A, USAF, Hq & Hq Sq, 6002nd Ftr Wg (SE), APO 75. having been atchd this Hqs as Combat Crew Member per par 9, SO 14, Hq. 6002nd Ftr Wg (SE), APO 75, is further atchd to the 67th Ftr Bmr Sq, APU 75, as Combat Crew Member for flying purposes only, eff this date. 4. Sgt Armond T. Perron, (405), AF11163587, USAF, is reld fr asgmt to the 12th Ftr Bmr Sq, APO 75, and reasgd to Hq, 18th Ftr Bmr Gp, APO 75, NTI. EDCSA: 22 Aug 50. .5. Sgt Harry L. Jacobson, (405), AF17181100, USAF, is reld fr asgmt to Hq, 18th Ftr Bmr Gp, APO 75, and reasgd to the 12th Ftr Bmr Sq, APO 75, NTI. EDCSA: 22 Aug 50. 6. Sgt Arthur D). Craig Jr., (405), AF12229559, USAF, Hq, 18th Ftr Bmr Gp, APO 75, is assigned primary duty SSN 070 (draftsman), eff this date. 7. The fol Offs, 67th Ftr Bmr Sq, APO 75, are assigned primary duty as indicated, eff 6 August 1950. AUTH: VO CO , Hq, 18th Ftr Bmr Gp, APO 75, AFSN PDY 1SSI GNMENT ARNOLD MULLINS CAPT 14681A (1054) Commanding Officer EDWARD C. HOAGLAND JR. CAPT 11355A (2161) Operations Officer E. Mc GEE CAPT AO 807103 (4823) Engineering Officer HARRY C. MOORE 1 ST LT 40:711850 (2110) Adjutant ROBERT L. EMBERY 1ST LT 17175A (4902) Supply Officer HAROLD P. EDWARDS AO 568000 (9301) Intelligence Officer MARTIN H. JOHNSON CAPT AO 678874 (1054) Flight Commander EDWARD F. HODGES CAPT AO 740424 (1054) Flight Commander RO BE RT B. HINCK CAPT 12364A (1054) Flight Commander JOE LANE AO 790749 (1054) Flight Commander WILLIAM R. BEALS 1 ST LT AO 701044 (0200) Communications Officer HOWARD I. PRICE CAPT 14418A (1054) Pilot KENNETH H. BARBER 1 ST LT 17845A (1054) Pilot OWEN T. BREWER JR. 1ST LT AO 914716 (1054) Pilot ROBERT BLANK 1ST LT AO 802978 (1054) Pilot RAY I. CARTER 1 ST LT AO 81 5280 (1054) Pilot PHILIP J. CONSERVA 1ST LT AO 831379 (1054) Pilot COTHERN 1 ST LT AO 829 654 (1054) Pilot PONALD P. CREE 1ST LT AO 834963 (1054) Pilot WILLIAM G. FOSTER 1ST LT AO 838532 (1054) Pilot SO 55, Hq, 18th Ftr Bmr Gp, APO 75, dtd 21 Aug 50, par 7 cont'd RANK AFSN PDY TANDOL PH Je HEARD 1ST LT 1 69 55A (1054) Pilot DANIEL LEAKE 1 ST LT 712020 (1054) Pilot DAVT.D C. MARTIN 1ST LT AO 839380 (1054) Pilot 1ST LT AO 758836 (1054) Pilot HENE` REYNOLDS LT AO 2080061 (1054) Pilot 1 ST LT AO 1803253 (1054) Pilot C. UPSHAN AO 805142 (1054) Pilot B.ROLD AUSMAN 2ND LT AO 1909550 (1054) Pilot R. HENLEY 2ND LT AO 1909598 (1054) Pilot GEORGE OL SEN 2ND LT 1909630 (1054) Pilot WILLIAM L. PATTERSON 2ND LT AO 1909631 (1054) Pilot BY ORDER OF LIEUTENANT COLONEL WINTETMUTE: JACK A. CARTWRIGHT / Major, USAF Adjutant OFFICIAL. JACK A. CARTWRIGHT Major, USAF Adjutant DISTRIBUTION \"C\" PLUS 3 - A-1 Div, 5th AF 3 - AG Sec, 5th AF 3 - A-1 Div, 6002nd Ftr Bmr Wg, APO 75 3 - AG Sec, 6002nd Ftr Bmr Wg, APO 75 3 - Ea off and Amn concerned HEADQUARTERS CLARK AIR FORCE BASE AND 18TH FIGHTER LOMBER NING APO 74 SPECIAL ORDERS) 19 July 1950 NUMBER 136) Folg Offs, USAF, are reld asumt & dy orgns indicated, APO 74, & as gd 67th Bmr Sq, APO 74, NLT 19 Jul 50. NTI. AUTH: AFR 35-59. EDCSA: 50. 1ST LT KENNETH L BYFD Hq & Hq Sc, 18th AB Gp CA:T MARTIN H JOHN SON JR Hq & Hq Sq, 18th Ftr Bmr Wg CAFT I PRICE 144.18A Hq, 18th Ftr Bmr Gp CAFT ROBERT B HINCK 12364A 12th Ftr Bmr Sq, 18th Ftr Bmr Gp CAPT DONALD J FLEN*TKE 11507A do 1ST LT CLAUDE R TAYL DR A0708348 do 1ST LT %ILLIAM G FOSTER A0838532 do 1ST LT RANDOLPH C HEARD 16955A do 2ND LT EDWIN R HENLEY A01909598 do 2ND. LT GEORGE N OLGEN A01909630 do 2ND LT WILLIAM H CH. !,ERLIN A01909561 do 2ND LT EUGENE G A01908360 1ST LT KENNETH H BARBER listh Ftr Bmr Sq, 18th Ftr Emr Gp 1ST LT RAY I CARTER A0615250 dc 1ST LT ROBERT L EMEERY 171751. do 1ST LT DAVID E MARTIN A0839 380 do MAJ ROBERT DOW A0424255 do 1ST LT RICHARD D RUSH A01803253 Hq, 18th Ftr Bmr Gp CAFT CHARLES E McGEE do 15. Folg Offs, USAF, are reld asgmt &: dy orins indicated, AFO 74, & asgd Hq, 18th Ftr Bmr Gp, APO 74, rpt NLT 19 Jul 50. :TT. AUTH: AFR 35-59. EDCSA: 24 50. MAJ STANLEY E CHATFIELD 9539A 12th-Ftr Enr Sq, 13th Ftr Birr Gp CAPT CHARLES E ?RUMBO, .JR 14104A do CAFT EDWARD C HOAGLAND TR 11355A 44th Ftr Borr Sc, 18th Ftr Bmr Gp 16. CAPT CARROL J '/ICTOR, A0566884, USAF, is reld assmt & dy Hq & Hq Sq, 6295th AP Gp, APO 74. as gd 16th AP Sc, 6215th AP Gp, APO 74, for dy w/Scp AP Sq, Elm, (67th Ftr Bmr rpts NLT 19 Jul 50. NTI. AUTH AFR 35-59. EDCSA: Jul 50. 17. Folg Ann, USAF, are reld as gmt & dy orens indicated, AFO 74 & trfd in gr orgns indicated, APC 74 for dv w/Sep Sg Elns specified, rpts to CO NLT 19 Jul 50. NTI. AUTH: AR 615-200. 24 Jul 50. ASGD 1STH `EE SEP MID S& ELM Pfc Eugene Harris AF15263056 18th Mtr Veh Sq, 18th AB Gp Pvt George Kasko AF13253119 24th Mtr Veh Sq, 18th A2 Gp Pfc Norman W Turner AF11184751 do Par 17 SO 136, Hq, CAFB & 18th Ftr Bmr Wg, APO 74, 19 Jul 50, contd. Ftr Cpl Rosario J Venuto AF12306529 Hq & Hq Sc, 18th AB Gp Set James A Poindexter AF18185214 Hc & Hq Sq, 6205th AP Gp Cpl Robert E Greeley AF19329099 do Cpl Ramon D Southard AF14310743 6206th AP Sq, 6205th AP Gp ASGD 18TH FTR GP Sgt Harry L Jacobson Af17181100 12th Ftr Bmr Sq, 18th Ftr Gp James Cascolan AF39836280 do Forrest E Howard AF17206360 do Set James Harris AF14271466 44th Ftr Bmr 18th Ftr Gp S Set John Trigg AF18217218 18th Gp SQ, CEP UTH SQ (67th-Ftr Bmr Cpl Edward R Rael Af19336924 24th Mtr Veh Sq, 18th AB Gp Cpl James R. Ort AF15262886 do Pfc William J Gettings Ap11179229 do Cpl Richard D Spivey, Jr AF18150541 do Set Christian D Poot AF17185401 do Cpl Lawrence Rebinson AF14304473 do Cpl Raymond E Draper AF39907881 do Cpl George Humbins AF12255738 do Cp]. John Little, Jr AF15271115 do Cpl. M. C. Mack AF361.60956 do Fvt Carle E Frankild AF12292456 do Cpl William R Isom AF43000002 do Cpl Faul E Ragland AF13215830 do Pfc Eeorge H Tong do Pfc Raymond 0 McGe AF19367660 do Pvt Mack Wagner AF36795624 do S Set Grady C Jackson AF6283020 do S Set Sam W Lewis AF18232551 do Pfc David N Forter Af14051474 do M Set Alvin G Johnson AF6963793 do Cpl James D Turner AF14314379 6201st Shgr Const Sc. Set Charles B Kramer AF35713185 18th Instl Sc, 18th AP Gp Pfc Victor D Hines AF15232915 do M Sgt Ira H Hendricks AF6915588 do M Sgt Robert B Stevenson AF6570688 Hc & Hq Sq, 18th AD Gp Pvt Lewis E Peters AF16260177 24th Mtr Veh Sc, 18th AB Gp Lemon Taylor AF34079639 6201st Enrr Cons Sq, Pvt Richard C Voigt AF36800944 do Sgt Faul H Alexander AF38467720 do Sgt Walter E [thack AF1/:124956 6206th AP Sq, 6205th AP Gp Cpl Fred E Gehrke AF162C4542 Hq &: Hq Sc, 18th AB Gp Pfc Walter E Lewis AF13316620 18th Mtr Veh Sq, 18th AB Cp ASGD H. SEP th - T Set Jack Beer AF6295385 Hq & Hq Sq, 6205th AP Gp S Set Marlin Dees do S Set John M McCloud AF6892294 do S Set do Cpl AF14236445 do Sgt James Dannenberg AF46076297 do Par 17 SO 136, Hq, EB & 18th Ftr Bmr We, APO 74, Jul 50, contd. Cpl Alfred E Mills AF12270596 Hc & Hq Sq, 6205th AP Gp Pfc Dale C Leafstedt do Cpl Thomas P Meade AF17217969 do Pfc Homer G Pratt do M Set Eugene F AF39226870 do S Sgt Julian L Quigley AF20837571 do T Set Theodore R Williamson AF6256247 6206th AP Sc, 6205th AP Gp Cpl Elverson K Williams AF45000161 do Pvt Francis J Davis AF39617611 do Pvt Albert Daugherty AF16255441 do ASGD 67TH FTR So 18TH FTR BMR GP Cpl James A Birk AF16286990 44th Ftr Bmr Sc, 18th Ftr Bmr Gp S Sct Kenwood R York AF15212306 do Alex R Samu AF12314652 do T Set Audrey M Christiansen AF19024066 do Set Samuel Stetson AF12021093 do Set Donald H Hartman AF16259872 do Sct George TH Hinton AF14258245 do Sgt Gerard J Monte AF6149812 do Set Charles 0 Morgan AF15256331 do Cpl Lucus C Allen AF14302161 do Cpl Charles L Richards AF17227021 do Cpl Charles E Ponder AF14296188 do Cpl Robert W Calhoun AF18340177 do M Sgt Merle 0 Latimer AF32108371 do M Sgt Co smo R Mannino AF6946530 do T Sgt John J Casey AF11032167 do T Sgt Craig S Cossel AF6913854 do S Sct Clarence V Anderson AF11091695 do T Set Maynard A Bojnton AF11016834 do T Set Frank C Hammon AF12044868 do S Set Emond M Craig AF15088164 do Sgt Jack V Blough do T Sct Ernest S Eenson AF32582534 do Sct Alistair H Cowe AF12297291 do S Set Clyde B Skeens AF15114659 do S Set Donald L Seeds do Cpl Horace N Bolton AF18311358 do Cpl James R Ellis AF19332288 do Cpl Alvin E Thomas AF14290253 do S Set Elmer E Strausheim do S Sgt Jame s E Burke AF18132759 12th Ftr Bmr Sq, 18th Ftr Bnr Gp Cpl James F Tuttle AF15420869 do T Sgt Bernard 0 Finley AF39487780 do S Set Victor J Flizga AF33262443 do Set Leslia D Buchmann AF17237494 do Cpl Karl E Edelman AF17242643 do Cpl Joe C Hettema AF19333887 do Cpl Robert H Greene AF15257445 do Cpl James E Neuman, Jr AF16209348 do Pfc John A Key AF15419296 do Pfc Duane THE Grasvenor AF19326777 do T Set Carroll P Adams AF16014560 do T Sgt Jame s J Lemmon AF15013346 do 3 Par 17 SO 136, Hq, CAFB & 18th Ftr Bmr Wg, APO 74, 19 Jul 50, contd. T Set Henry TW Bethel AF34244340 12th Ftr Bmr Sq, 18th Ftr Bmr C T Sgt Emerig G Fogash AF6884971 do T Set John T Billig AF6994501 do S Set Charles TAJ Mathews AF16036563 do S William M Shook AF13019825 do S Set Fred M March AF6083571 do T Set Ernest Walker AF13048700 do S Set Wayne E Denniston AF394.94613 do Cpl Frank Fiedor AF13013007 do Sgt Joseph R Sytnik AF13253877 do John E Gifford AF18276459 do Sgt James H Smith AF13226125 do S Sgt Alvin L Gibson AF17030362 do Pfc I eo Duke AF13277622 do S Set James I Forter AF6375276 do Cpl Robert N Lundberg AF19310592 do Sgt Elmer F Erskin AF17230349 do Set Ollie R Dreadin AF14270755 do Cpl Daniel J Lehan AF12353366 do Pfc Robert L Stetler AF13164267 Hq, 18th Ftr Emr Gp Col Thomas F Nei AF15278067 18th !aint Sg, 18th AB Gp Cpl. William T Sanderson, Jr AF12313371 do Pfc Robert G Nadeau AF11149935 do Cpl Homer D Bozarth AF17167628 24th Acft Rep Sc Pfc Charles E Widger AF13259251 6203rd Fort Sq, AFO 928 18. Folg Offs & Ann, USAF, are reld asgnt & dy orgns indicated, APO 74 & as gd orens indicated, APO 74: for dy w/Sep Sq Elms specified, rptg CO NLT 19 Jul 50, w/concurrence of CG, 6200th Dep Wg, APO 74. NTI. AUTH: AR 615-200. 24 Jul 50. ASGD 18TH SUF SQ. C: EL (67th Ftr Bmr Sg) CAFT X. L. FINCH A04.77172 6203rd Port Sq, AFO 928 Pfc John C Pallino AF12302247 24th Ammo Sup Sq, 24th Sup Gp Pfc Paul D Naslund AF19347780 do Set Bennie R Galyon AF14297100 do Cp]. Everette S Reaver 24th Tech Sup Sq, 24th Sup Gp Cpl John E Harvey, Jr AF13300395 do T Sgt William Mauney AF6354983 do T Sgt Charlies H La:mert Jr AF36069782 do T Sgt George TAI Smith AF6964054 do S Sgt Herbert H Longreck AF16133117 do Sct Joe D Ruff AF34935234 24th Gen Sup Sc, 24th Sup Gp S SET Darell D Meek AF16033623 do Sgt Joseph Brown Jr AF32186942 do Sct Leighton E Foreman Jr AF17250343 do Cpl James L Kimbrough do Cpl William D Anderson do Cpl William P Barnes AF31446483 do Pfc Eusaw F Carroll AF14262691 do Pvt Rufus T Pate AF43012630 do Cpl Richard M McClay AF16311274 do Pfc Isracl Garcia AF13355943 24th Sup Sq, 24th Sup G6 Pfc John H Stinso AF43001913 Hc, on Dep Wg Par 18 SO 136, Hq, CAFB & lath Ftr Bmr We, AFO 74, 19 Jul 50, cont d ASGD SEF ;AAINT Sci (67th Ftr B.nr 1ST LT CHARLES R !OREHOUSE A0758836 24th Acft RED Sq, 24th Maint Gp Pfc Jack Fiarce AF19340114 do S Sgt Jame s Ras:ussen AP39452977 do Robert M Digney AF13275096 do Ffc Fatrick B Balrer AF13232450 do Cpl Felix B Romero do S Set Marion A Jones AF6931604 do S Set Virgil E Blurton AF6581986 do M Set Dwight N Smith AF6863589 do S Set Henry Tyroff AF44038600 do M Sgt Thomas D Adams Jr AF13632737 do Pfc Isidore A Arthur Jr AF19357144 do Sgt Dales L Hulse do T Set Harold Green AF32600326 do Cpl Jack R Goodrich AF13286174 24th Veh Rep Sc, 24th Maint Gp Cpl Alvin B Tinsley AF42252794 24th Equip Rep Sc, 24th aint Gr Cpl Janes R Robinson AF18273798 do Cpl Jerry D Dutton AF19295612 do Set Earl R Calhoon AF36834794 do Col Calvin D Rahn do T Set Claude Tracey AF6993878 Hq, 6208th Dep Set Clarance F Mantooth do 19. 2ND LT HENRY N THOMAS, 101849527, USAF, is reld asunt & dy 6202d Rcnt Ctr Cp John Hay, Baguio, F.I. & asgd lath itr Veh Sq, luth ... Gp, AFO 74, for dy w/Sep :tt Veh Sq, Elm, (67th Ftr Binr Sq.). WP o/a 19 Jul 5C by mil acft &/or govt mtr. TDN. TBMAA. TBGAA. NFDA. AUTH: AFR 39-59. EDCSA: 24 Jul 50. 20. 1ST LT DONALD G SHIRLEY, 16630A, USAF, is reld asemt &. dy Hq & Hc Sq, 18th Ftr Bmr Wg, AFC 74, & asgd 6201st Engr Const Sq, APC 74, rpte CO NLT 20 Jul 50. NTI. AUTH: AFR 35-59. EDCSA: 24 Jul 50. BY ORDER OF COLONEL DAVIES: OFFICIAI: JOHN L KOTTAL Captain USAF Adjutant Captain USAF Adjutant DISTRIDUTION: \"A\" HEADQUARTERS 18TH FIGHTER BOMBER GROUP APO 74 SPECIAL ORDERS ) 17 July 1950 NUMBER 44 ) 1. Having been asgd this Hq, per par 13, SO 130, Hq, CAFB & 18th Ftr Bmr Wg, APO 74, CAPT CHARLES E. Mc GEE, AO807103, USAF, (N), is further asgd to the 12th Ftr Bmr Sq, NTT. EDCSA: 17 Jul 50. 2. CAPT EDWIN G. JANE' JR, 13085A, USAF, (W), is reld fr asgmt to the 44th Ftr Bmr Sq, APO 74, and reasgd to the 12th Ftr Bmr Sq, APO 74, NTI. EDCSA: 18 Jul 50. 3. CAPT CHARLES R. CRONER, A0737011, USAF, (W), is reld fr asgmt to 12th Ftr Bmr Sq, APO 74, and reasgd to the 44th Ftr Bmr Sq, APO 74, NTI. EDCSA: 18 Jul 50. 4. Pvt Robert L. Stetler, AF13164287, USAF, Hq, 18th Ftr Bmr Gp, APO 74, is promoted to gr of Private First Class, eff this date. AUTH: AFR 39-30, dtd 24 Mar 50. 5. Having been atchd to this Hq for Cbt Crew Tng, per par 3, SO 130, Hq, CAFB & 18th Ftr Bmr Wg, APO 74, MAJOR WALTER S. KING, 10086A, USAF, Hq & Hq Sq, 18th Ftr Bmr APO 74, is further atchd to the 67th Ftr Bmr Sq, APO 74, for flying purposes only. 6. Having been atchd this Hq, for Cbt Crew Tng, per par 10, SO 115, Hq, CAFB & 18th Ftr Bmr Wg, APO 74, 1ST IT WILLIAM D. COLEMAN, A01903060, USAF, 1961st AACS Sq, APO 74, is further atchd to the 44th Ftr Bmr Sq, APO 74, for flying purposes only. BY ORDER OF LIEUTENANT COLONEL WINTERMUTE: JACK A. CARTWRIGHT Major, USAF Adjutant DISTRIBUTION \"C\" PLUS 3 - A-1 Div, 13th AF, APO 74 2 - AG 89c, 13th AF, APO 74 3 - A-1 Div, 18th FBW, APO 74 2 - AG Sec, 18th FBW, APO 74 3 - Ea Off and Amn concerned 7 - 13th AF Publications 5 - co, Hq & Hq 18th Ftr Bmr Wg, APO 74 5 - co, 1961st AACS Sq, APO 74 HEADQUARTERS AND E.DQUARTERS SQUADRON 18XXTH AIR BASE GROUP APO 74 1 1 0 Date SUBJECT: Orderly Room Clearance Outbound) going out of this organization The felluwing will be cleared by firmen coming in or going out of this organization before clearance forms are cleared and before report-- ing to assigned place of duty: LST SERGEAND RECORDS CLERK (Cutgoing dro Upon orm to the Squadron Personnel Officer. FOR 'PHE COTLIANDING OFFICER: MICHAEL LYGA 1st Lt., USA F Fersonnel Officer SYMBOLS: NTI involved NPDA No per diem nuth CLARK AIR FORCE BASE AND 18TH FIGHTER BO`/BER WING APO 74 SFECIAL ORDERS) 12 July 1950 NUP!BER 130) 1. Extracted. 2. VOCG this Hq, 11 Jul 50, are confr. 1ST LD .ALBERT HO!.ELL, A0719342, USAF, Hq & Hq Sq, 18th Ftr Bmr Wg, APO 74, is atch to Base flt for flying dys only. 3. VOCG this Hq, 11 Jul 50, are confr. MAJ WALTER S KING, 10086A, USAF, Hq & Hq Sc, 18th Ftr Bmr We, AFO 74, is atchd to 18th Ftr Bmr Gp, AFO 74, for Combat Crew Tng only. 4. T Sgt Adrian E Spears, AF38457991, having reenltd for USAF, unasgd 12 Jul 50, for an unspecified pd of time, UP AFR 39-9, is asgd 6204th Fhoto Mapping Flt, APO 74. 5. T Sgt Lowis D Belshaw, LF18297179, having reenltd for USAF, unasgd 12 Jul 50, for an unspecificd pd of time, UP AFR 39-9, is asgd 14th Comm Sq, AFO 74. 6. Sgt Dionicio Cudal, AF30103360, Hq & Hq Sq, 18th AB Gp, APO 74, presently on DS w/ Dallas Sq, (Prov), 18th Ftr Bmr Gp, APO 74, is reld fr DSLeffithis dt & w/rpt to propor orgn. NTI. 7. Pfc 594 Michael G Maurer, AF15264864, Hq & Hq 3q, 18th AB Gp, APO 74, is placed on DS w/Dallas Sq, (Frov), 18th Ftr B:rr Gp, AFO 74, for indef pn & w/rpt CO thereat NLT 12 Jul 50, for dy & adm. No C in crs & mess fac. NTI. AUTH: 13th AFR 11-11 & 18th FBW GO, #24, 5 Jul 50. 8. Pvt 060 Gordon E Smith, AF6547779, 18th Food Sv Sq, APO 74, is placed on DS w/Food Sv Sq, Sep Elcment, Dallas Sq, (Trov), 18th Ftr Bmr Gp, APO 74, for an indef pd & w/rpt CO therert NLT 12 Jul 50, for dy & adm. No C in grs & mess fac. NTI. AUTH: 13th AFR 11-11 & 18th FB\" GO, #25, 7 Jul 50. 9. 1ST LT CHARLES T McDEVITT, A02094719, USAF, 18th Food Sv Sq, APO 74, is aptd Custodian of CAFB Base Food Sv Consolidated Mess Fund, vice: 1ST LT ROBERT D CROOKS, A0667943, USAF, 18th Food Sv Sq, APO 74, reld. AUTH: ARR 210-60. 10. WOJG HOWA.RD S WILSON, JR., 951334E, USAF, Hq & Hq Sq, 18th AB Gp, AFO 74, is reld asgmt & dy thereto & reasgd 622nd Acft Contr & Harning Sq, APO 74. NTI. AUTH: AFR 35-59. EDCSA: 17 Jul 50. Rpt g NLT 13 Jul 50. 11. Cpl Donald E Waltman, AF15415488, USAF, 67th Ftr Bmr Sq, AFO 74, is reld fr asgmt & dy thereto & trf in gr to Det of Fnts, 18th Med Gp, AFO 74. Pers recs & individial clothing, including clothing rocs w/bo forwarded to CO Det of Pnts, 18th Med Gp, AFO 74. NTI. AUTH: AFR 35-58. EDCSA: 17 Jul 50. SO 130, Hq, CAFB & 18th Ftr Bmr Wg, APO 74, 12 Jul 50, cont d. 12. Folg Offs, USAF, orgns indicated, AFO 74, are placed on DS w/Dallas Sq, (Prov), APO 74, for an indef pd & w/rpt CO thereat NLT 0800 hrs, 13 Jul 50, for dy and adm. No C in ors & mess fac. NTI. AUTH: 13th AFR 11-11 & leth FBW GO #24, 5 Jul 50. 1ST LT DONALD D BOLT A083772 Hq, 18th Ftr Bmr Gp 1ST LT HARRY E DUGAN JR A0700239 622nd Acft Contr & Warning Sq 1ST LT JAMES L GLESSNER JR A0590725 do 1ST LT ALEXANDER B FADILLA A0556092 do 1ST ET WILLIAM C MILLER JR A0822331 24th Mtr Veh Sq 13. CAPT CHARLES E McGEE, A0807103, USAF, Hq & Hq Sq, 18th AB Gp, AFO 74, is reld as gitt & dy thercto & reasgd Hq, 18th Ftr Bmr Gp, AFO 74, NTI. AUTH: AFR 35-59. EDCSA: 17 Jul 50. 14. 1ST LT ROBERT L NAYLOR, A0942139, USAF, 18th Comm Sq, APO 74, is reld asignt & dy thereto & reasgd 622nd Acft Contr & Warning Sq, AFO 74, NTI. Rptg to CO thereat NLT 14 Jul 50. AUTH: AFR 35-59. EDCSA: 17 Jul 50. 15. SMOP 3 SO 127, this Hq, cs, pertaining to Amn placed on DS w/Dallas Sq, (Frov), APO 74, as reads: \"S Sgt Ralph M Fuller, AF16050177\" is amndd to read: \"S Set Ralph M Fuller, RF16040177\". 16. SMOP 9, SO 128, this Hq, cs, pertaining to Ann, placed on DS w/Dallas Sq, (Prov), APO 74, as reads: \"Sgt 754 Ronlad C Parent, AF11159052\" is amndd to read: 754 Ronald C Parent, AF11159052\" BY ORDER OF COLONEL DAVIES: OFFICIAL: JOHN L KOTTAL Captain USAF Adjutant JOHN L KOTTAL Capt ain USAF Adjutant DISTRIBUTION: \"A\" HEADQUARTERS PHILIPPINES COMMAND (AIR FORCE) iND THIRTEENTH .IR FORCE Clark hir Force Base APO 74 PERSONNEL ORDERS ) 12 July 1950 NUMBER 13 Personnel Orders imposing Suspensions from Flying Status on folg Offs, USAF, UP AFL 36-26, 29 Nov 49 and/or AFL 36-3, 5 Aug 49, are rescinded. AUTH: USA.F Rad AFPMP 48219, 2 Jul 50 & FEAF Rad 1 2090 PERS-MP-1, 4 Jul 50. This action subject to satisfactory completion of Phy Exam for Flying (SF 88). CAPT WLLEN W HUNSAKER AS 516023 6204th Photo Mapping flt Suspended por Par 2, PO 23, Hq USI.F, 2 Feb 50 CAPT BERNARD` W LUSTER 100 753534 Hq & Hq Sq, 18th /B Gp Suspended per Par 1, PO 230, Hq US.. , 30 Nov 49 CAPT CHARLES E MCGEE AO 807103 Hq & Hq Sq, 18th MB Gp Suspended por Par -9, PO 69, Hq US.F, 10 fipr 50 CAPT EDWARD M VAUGHN no 405910 Hq & Hq Sq, Thirteenth AF Susponded per Par 5, PO 41, Hq US.F, 1 Mar 50 1ST LT ROBERT R BLANK HO 802978 Hq & Hq Sq, Thirteenth A.F Suspended per Par 8, BO 60, Hq USAF, 28 Mar 50 1ST LT DONALD D BOLT AO 837772 Hq 18th Ftr Bmr Gp Suspended per Par 2, PO 240, Hq USAF, 14 Dec 49 1ST LT PHUL D BUTTRY HO 2091149 24th Mtr Veh Sq Suspended pcr Par 8, PO 60, Hq USAF, 28 Mar 50 1ST LT KENNETH M DISM NNG AO 938500 Hq & Hq Sq, 18th Ftr Bmr Wg Suspended per Par 5, PO 41, Hq USA.F, 1 Mar 50 1ST LT HARRY E DUGAN JR AO 700239 622d ACW Sq Suspended per Par 2, PO 240, Hq USAF, 14 Dec 49 1ST LT JAMES L GLESSNER JR AO 590725 622d AC&W Sq Suspended per Par 5, PO 41, Hq USAF, 1 Mar 50 1ST LT ROBERT L HARDY AO 2080277 622d AC&W Sc Suspended per Par 4, PO 19, Hq USAF, 27 Jan 50 1ST LT SANTIAGO HERNANDEZ AO 934819 24th Sup Gp Dep Suspended per Par 7, PO 27, Hq USA.F, 8 Feb 50 1ST LT RICHARD E JOSLIN AO 811213 Hq & Hq Sc, Thirteenth AF Suspended per Par 8, PO 60, Hq USAF, 28 Mar 50 PO 13, Hq PHILCOM (AF) & Thirteenth AF, CAFB, APO 74, 12 Jul 50, contd. 1ST LT JAMES I KIDD JR . 823386 He & Hq Sq, Thirteenth AF Suspended per Par 8, PO 60, Hq USAF, 28 Mar 50 1ST LT LOWELL A MO OMAW AO 2099549 6204th Photo Mapping Flt Suspended per Par 2, BO 240, Hq USAF, 14 Dec 49 1ST LT ALFRED J NELSON 40 937033 18th Sup Sq Suspended per Par 2, BO 240, Hq USAF, 14 Dec 49 1ST LT DEAN L SWANSON AO 730189 622d Sq Suspended pur Par 4, PO 19, Hq USAF, 27 Jan 50 1ST LT MELVIN L WARM HO 2073916 Hq & Hq Sq, 18th AB Gp Suspended per Par 8, PO 60, Hq USAF, 28 Mar 50 1ST LT ALEXANDER B PADILLA AO 556092 622d ACWW Sq Suspended por Par 2, PO 240, Hq USAF, 14 Dec 49 1ST LT WILLIAM C MILLER JR 822331 24th Mtr Veh Sq Suspended per Par 8, PO 60, Hq USAF, 28 Mar 50 BY OF MISJOR GENERAL TURNER: OFFICIAL: DACHE hi. REEVES Colonel, USAF Vice Commander ..F Asst General DISTRIBUTION: 5 cys - Off concorned 1 l cy cy - Orgn. concerned l cy - CG, 18th Ftr Bmr Wg l cy - Flt Surg, this Hq 1 cy - Fin 0 18th Ftr Bmr Wg 5 cys - Deputy for Pers 2 cys - Deputy for Opr 3 cys - AG Files HEADQUARTERS PHILIPPINES COMMAND (AIF FORCE) AND THIRTEENTH AIR FORCE Clark Air Force Base APO 74 AG 300.4 3 July 1950 SUEJECT: Letter Orders No. 50-332 TO: Officers Concerned Folg Offs, USAF, are aptd to serve on Bd of O for purpose of re- viewing and/or passing upon recms for sep fr SV of EP UP AR 615-369. Bd convened under this auth will consist of three (3) Offs. Sr Fld Gr 0 present w/b dsgd President of Bd. Bds previously convened under this auth will compl all cases presently indorsed to them. DETAIL FOF: THE BD MAJ FREDERICK E SULLIVAN 5830A 24th Veh Rep Sq MAJ BERNARD A MINNEHAN 9043A Hq & Hq Sq, Thirteenth AF 2D LT HLNRY C PRICE JR AO 1909383 21st Trp Carr Sq (Alt Def Counsel) 1ST LT GLORGE KALLUM JR AO 941206 24th Gen Sup Sq (Def Counsel) CAPT E RUOFF AO 799647 Hq & Hq Sq, Thirteenth AF CAPT CHARLES E MCGEE AO 807103 Hq & Hq Sq, 18th AB Gp 2D LT WILLIA L PATTERSON AO 1909631 67th Bmr Sq (fecorder) BY COMLAND OF M AWOR GLNERAL TURNeR: DISTRIBUTION: 50 - D/P 5 - AG File 1 - Orgn concerned the HEADQUARTERS PHILIPPINES COMNAND (AIR FORCE) AND THIRTEENTH AIR FORCE Clark Air Force Base APO 74 AG 300.4 3 July 1950 SUBJECT: Letter Orders TO: Officers Concerned 3o much of Letter Orders No. 50-184, this Hq, 3 May 50, appointing Bd of Offs for purpose of reviewing and/or passing upon recms for sep fr SV of EP, is amndd to delt 11 'AR 615-369)\", &: further amndd as fols: DELETE: \"LT COL IRA F 3748A Hq 18th Ftr Bmr Gp CAPT ROBERT H GARLOCK AO 659370 24th Tech Sup Sq 13T LT JEREMIAH F CALLAHAN AO 786059 6204th Photo Mapping Flt (Def Counsel) \"MAJ FREDRICK E SULLIVAN 5830A 24th Veh Rep Sq CAPT CHARLES E MCGEE AO 807103 Hq & Hq Sq, 18th AB Gp (Member) 1ST LT GEORGE KALLULi JR AO 941206 24th Gen Sup Sq (Def Counsel) 11 BY COMMAND OF MAJOR GENERAL TURNER: or, Asst Adj General DISTRIBUTION: 50 cys - D/P 5 11 - AG File 1 cy - orgn concerned HEADQUARTERS PHILIPPINES COLMAND (AIR FORCE) AND THIRTEENTH AIR FORCE Clark Air Force Base APO 74 AG 300.4 28 June 1950 SUBJECT: Letter Orders No. 50-308 TO: Officers Concerned Folg Offs, orgns indicated, APO 74, a re aptd a Bd of Offs to inves alleged theft at Airman's Lounge, PX Br #6, Det #1, 14th Comm Sq, Joint Radio Transmitter Station on 11 Nune 1950. Bd will mect at call of the president to determine time, place, cause and extent of the loss; verify Exchange's Statment of Claim; obtain all other material facts having bearing on the loss; repoit all evidence, testimonics, findings and recommendations in connection w/the loss. Report of Proceedings will conform to provisions of AR 420-5, 20 May 40 & w/b submitted in quintuplicate to Deputy for Mat, ATTN: PHILCOM (AF) & Thirteenth AF Central Exchange Officer. AUTH: PHILCOM (AF) & Thirteenth AFR 34-1, 27 Jan 50. CHARLES E. MCGEE no 807103 Hq & Hq Sq, 18th AB Gp 1ST LT ALFRED B BAZZARRE AO 786208 14th Comm Sq, Comd **1ST LT JAMES B FAGAN 40 714685 Hq 24th Sup Gp *- ** Recorder BY COMMAND OF MAJOR GENERAL TURNER: Major, DISTRIBUTION: 10 cys - Ea Off Concerned 2 \" - Ea Orgn 5 - Con Exch 0 3 II - AG Files 5 - Deputy for Mat 5 \" - Deputy for Pers 30 \" - Recorder 41 1 No tv involved No por dien auth CLIRK FCRCE S.SE AND 18TH FIGHTER DOVPER !ING AFC 74 30 June 1950 121) 1. Felg funn, USAF, (T), arc r:ll fr asamt & dy orins indicnted, AFO 74 & reasgd 622nd AC& Sq, AFC 74, w/dy CJT 514. ittI. MUTH: .614-200. 29 Jun 50. EDCSA: 4 Jul 50. (405) Robert H %arden LF14220725, (TCE 6 yrs (DOS: 20 Oct 55) (FSC: 5) (DerOS: 12 far 52), (YOL: 1927) (Not flying) Reld Asint 6204.th Fhoto flt (756) Robert U Binder LF19330307 (TOE: 3 yrs) (DOS: 2 Aug 51) (FSC: 0) (DEROS: 3 Jul 51) (YOD: Unk) (Not flying) (754) :illiam D Reske AF19333.38 (TOE: 3 jyrs) COS: 26 Jul 51) (FSC: 0) (DEROS: 26 Jun 51) (YOB: Unk) (Not flying) Reld Dot 54.ttt Rcn Tech Cp. (945) Claude C Davis, Jr., 6F14249942 3 yrs) (DOS: 11 Fcb 51) (FSC: 0) (DEROS: 12 Jon 51) (YOE: Unk) (Not flying) Rold Asemt 18th AE Set (750 c) Victor Denny 3 yrs) (DOS: 24 Feb 52) (FSC: 8) (DEROS: 25 Doc 51) (Flying) (YOB: Unk) Sat (970 c) Billy G hitoside AF16191672, (TOE: 3 yrs) (DOS: 8 Aug 52) (FSC: 40) (DEROS: 16 `far 52) (Not flying) (YOB: Unk) Set (405) David J Lingane 1F31335404 (TOE: 3 jrs) (DOS: 2 Jun 52) (FSC: 9) (DEROS: 1 Nov 51) (Not flying) (YOB: Unk) Cn] (945) Thomas R Black AF141349C8 (TOE 3 yrs) (DOS 29 Jul 51) (FSC: 8) (DEROS: 7 Sep 50) (Not flying) (YOB: 1931) Cp] (573) Donald R filler AF17244320 (TCE: 3 yrs) (DOS: 20 Jun 51) (FSC: 7) (DEROS: 29 May 51.) (Not flying) (YCB: 1929) Reld Food Sv (060) Daniel Chandler AF39035939 TOE: yrs) (DOS: J:n 52) (FSC: DEROS: 10 51) (Not flying) (YCE: Unk) (017) alter Young yrs) (DOJ: AF15269527 (TOE: 51) (FSC: (DEROS: 2 51) (Not flying) (YOE: Unk) 2. 1ST LT LLITHIAS I SETNESS, 10739349, USAF, Hq c: HI;; Sc, 18th Gp, AFC 74, is nptd Custodian of the fol; Funds vice CAPT JOHD F LADLY AC791945, US.LF, Hq & Hc Sy, 18th LE Gp, ALCO 74 ruld. C.FI FT Spocial felfars Dependonts School Fund Kindergarten Fund CJLFE Prent Teachors Assn and Thrift Shap Fund Fol, Offs, USAF, crins indicatod, AFC 74, are aptd rbbrs of C.F.]. & 18th Ftr Bar E, Che Lr Guidance Council, which will mect upon call of the Prosident. Frocoedings ty//o carried cil in accord w/provisions of lifr 35-3 & 35-32. :ILLIA!! De:.ITT 190201 (Fres lifed ARREN FERGUSON, 18751A Sc, litth Ftr 10906763 6205th AP CAFT BERNARD LUSTER A0573534 CIFT CHARLES 10007103 do CAPT JOUN LUTS 6277A Sc., lith Ftr Bnr .g A02073916 Sq, 10th AS. Gp 1ST LT JASFER D DeBruler Sc, 10th 4. The CIFD &: 18th Ftr Emr is, Character Guidanco Council, aptd 51 prir 3 SO 4, Hc CAFE 2: leth Ftr Wg, dto 19 Jen 50, is hereby dissolved. 5. Fol linn, (7), (Not flying) 2sunt C dy 67th Ftr Bmr Sc,, AFO 74 2: reasad 6204th Photo `[ap Flt, AFO 74. NTI. MUTH: AR £15-200. EDCSA: ;4 Jul 50. Sct (750) Edgar AF44211901 (TOE: 3 yrs) (DOS: Sep F3C: (DEROS: 4 Doc (YOB: 1925) (747) Carlton T 'illner (TOE: yrs) (DCS: Feb 52) (FSC: 18) (DEROS: Oct (YOB: 1929) 6. 3.t (945) James latters, AF16037366, USAF, ( ), (TCE: 3 jrs), (DCS: 7 Jan 52), (ISC: 20) (Dercs: 2 Dec 51), (Not flyin;.) (YOB: 1922), is relc asent is dy Det 1, 546th Rcn Toch Sc, RFO 74, &: reased 6204th Fhotc Nap Flt, AFC 74. `TI. Rpt NLT 1 Jul 50. AUTH: AR 615-200. Jul 50. 7. CAFT JOSEPH E LEARN, 10803361, USAF, Hq & Hc; Sc, lith Ftr Enr Je, :PP 74, is aptd as Defense Counscl of the Spocial Court-Jorticl apt d by par 3, SO 94, this Hq, cs, Vico: CAFT HOWARD JESSEE, A01703774, USAF, 1961st AACS Sc, rGld. 8. Folg Offs, Orens indicatod, AFC 74, are antd of the CAFE Protcstant Religious Fund Council, cff 1 Jul 50. * Indicatod w/concurrence of CG 13th AF & 6202th Dep g. AUTH: AFR 165-3. (I.T COL) *RALPH HILL 13709A (Fres) 13th C\" (TAJ) *HENRY FOSS A0503306 (ifbr) 620.th Den PARGER 17C45A (MLr) 44th Ftr Sc (MAJ) /ARREN (Cust Redr) FERGUSCN 16751A 18th Ftr Bmrigg 9. 1ST LT JERRY L STUTLER, A0E37995, USAF, Hq Ho Sc, 18th AB Gp, APC 74., is aptd Custodian of CAF2 Consolidatod Non-appropricted Funds, vice: 1ST LT JAVES D HEATH, A0674305, USAF, Hc EG Sq, 16th ftr Bar &, APC 74, reld, off 1 Jul 50. AUTH: AFR 176-2. 10. Folg Offs, USAF, orens indicated, APO 74, are placed on TDY w/622nd AC Sc, AFC 74, for apprx thirty (30) days, for purpose of perforaing Acft Contr & warning functions. Upon compl w/ret proper oren. NTI.NIFD P 0/'a 30 Jun 50. AUTH: 13th AF Reg ll-11. 1ST LT DONALD ACE37772 Hq 1Cth Ftr Gp 1ST IT DAVID E :ARTIN A03393/C 44th Ftr Emr 3C 11. S Set (750 C) Goorge S Duncan, AF20443040, USAF, (.), (TOE: yrs) (DOS: 13 Nov 52), (FSC: Unk) (DEROS Unk), (YOE: Unk), is reld l dy 21st Trp Carr Sq, AFC 74 & reased 16th AF Gp, APC 74. itil. AUTH: AR 615-200. EDCSA: 5 Jul 50. BY ORDER OF COLONEL DAVIES: OFFICIAL: JOHM L KOTTAL Cantain USAF Adjutant JOHN L KOTTAL Captain USAF Adjutant DISTRIBUTION: SYMBOLSt NTI No tvl Involved Refer AFR 11-11 for all other abbrevs. HEADQUARTERS PHILIPPINES COMLIAND (AIR FORCE) AND THIRTEENTH AIR FORCE Clark Air Force Base APO 74 SPECIAL ORDERS ) 211 June 1950 E T R A C NUMBER 124 ) 3. Folg Offs, orgns indicated, APO 74, are aptd to on hand in possession of Charles F Lichalec, DAFC, Sp C1 \"B\" Agent to Disbursing 0, CAFB, APO 74. Offs will rpt to Sp C1 \"p\" Agent, CCPO at 0800 hrs, 21 Jun 50. AUTH: Par 158, AFM 173-3, Dec 48 as anndd. 1ST LT PAUL J BURGDORF 14709A USAF 21st Trp Carr S Sq 1ST LT FRANK H PAIGE AO 590285 USAF 24th Gen Sup Sq 4 Folg Offs, USAF, are reld fr ascott to Hq & Hq Sq, Thirteenth AF , APO 74 & are asgd to orgns indicated, APO 74. NTI. PCA. EDCSA 25 Jun 50. .TO: LT COL RALPH A HILL 18709A Hq & Hq Sq, Thirteenth AF MAJ JOHN P WELLS 7311A Hq & Hq Sq, 18th Ftr Bmr Wg CAPT JOHN B ANDERSON 12485A Hq 6208th Dep Wg CAPT JOEL B CALDWELL 13263A Hq & Hq Sq, Thirtcenth AF CAPT JEAN K JONES AO 732009 Det if1, 548th Rcn Lech Sq (Dird dy asgmt in SSN 8502 UP AFR 35-34, 17 Feb 50) CAPT JAMES C KEITH AO 561402 24th Veh Rep Sq CAPT BERNARD W LUSTER AO 753534 Hq & Hq 3q, 18th AB Gp T E McGEE AO 807103 H & Hq 3q, 18th AB Gp in or Ops Fld UP AFR 35-580, 3 May .50) 1ST LT ROBERT B MEAGHER 14223A Hq 6205th AP Gp , 1ST LT LORAINE NOLL AO 586292 Hq & Hq Sq, Thirteenth AF 1ST LT GEORGE G BARNETTE AO 862187 Hq 620,5th AR Gp (Dird dy asgmt in SSN 9110 UP AFL 35-710, 13, Jan 1ST LT WILLIAL! A POLLOOK AO 1577698 Hq & Hq Sq, 18th AB Gp 1ST LT DOUGLAS R SMITH 15186A Hq 6208th Dep Wg 2D LT ROBLRT N HOLMAN AO 1903214 Hq 18th Ftr Bmr Gp WOJG WILLIAM E CASEY 951372 21st Trp Carr Sq (Dird dy asont in Maint Fld UP AFR 35-580, 3 May 50) WOJG ROY E MATLOCK AW 951526 24th Equip Rep Sq (Dird dy asgmt in Maint Fld UP AFL 35-580, 3 May 50) THOMAS P MORGAN AW 951535 18th Maint Sq (Dird dy asgmt in Maint Fld UP AFR. 35-580, 3 May 50) EXTRACT - Par 43 SO 124, Hq PHILCOM (AF) & Thirteenth AF, CAFB, APO 74, 21 Jun 50, contd. WOJG JOSEPH F RYNKIEWICZ AIN 951116 18th Maint Sq (Dird dy asgmt in Maint Fld UP AFR 35-580, 3 May 50) WOJG CHARLES E JR AW 951556 Hq 18th Ftr Bmr Gp (Dird dy asgmt in liaint Fld UP AFR 35-580, 3 May 50) 5. Folg Offs, USAF, are reld fr asgmt to Hq & Hq Sq, Thirteenth AF (P/L), APO 74 & are asgd to orgns indicated, APO 74. NTI. PCA. EDOSA 25 Jun 50. CAPT JAMES Vil BRADFORD 10082A 67th Ftr Bmr Sq, 18th Ftr Bmr Gp MAJ HARVEY L SIMMS AO 300653 Hq 24th Sup Gp CAPT ROBLRT J LILLS 12661A Hq 24th Sup Gp 1ST LT JAMES F SULLIVAN AO 763773 Hq & Hq Sq, Thirteenth AF 6. VOCG 20 Jun 50, asgg MAJ GEORGE W SHIPLEY, 3306A, USAF, Hq & Hq Sq, Thirteenth AF, APO 74, to PDY as Asst Dir of Maint (4823) eff 20 Jun 50, is C&MR. 7. SMOP 28, SO 117, this Hq, cs, pertaining to trf of EM to Hq RYCOM, APO 331, is anndd to delt \"M Daniel Rus 18th Med Gp, APO: 74. 8., M Sgt Daniel Nuqui, RA 6737225, is reld fr asgmt & dy w/DAF (SCARWAF) & fr 18th Med Gp, APO 74 & trfd in SU, PHILCOM (AF) Augm, APO 74, & placed on DS w/present No C of dy asgmt & sta involved. NTL. EDCMR 26 Jun 50. Pers Off of the losing unit will notify the disbursing Off S .rving the losing unit, on mil pay order, of the C in status fr SCARNAF in accordance w/SR 600-145-6, 8 Jul 49. AUTH: FEAF Msg AX 1374, 19 May. lay.50. 50. > BY COMMAND OF MAJOR GENERAL TURNER: OFFICIAL: LEONARD J. BARROW JR Lt Col. USAF Actg Vice Commander C LJEURANCE 2d Lt. AGD Asst Adj General DISTRIBUTION: B, BB, BBB Plus 5 - Z-7, D/P distribution For abbreviations AFR 11-11 HEADQUARTERS AJ-S616-A (a 7th 2349TH AF OVERSEAS REPLACEMENT DEPOT USNS Gen Sultan Camp Stoneman, California Destination: PI SPECIAL ORDERS 22 May 50 NUMBER 101 49 Offs atchd roster (Page 2) reld asgmt 2349th AFORD (p (p/1 /1 M/R) this (ConAC) asgd Hq & Hq Sq 13th AF (p/1) Clark AFB, APO 74, for further my to asgmt indicated. Dsgd Shipt AJ-S616-A (a 7th Incr. EDC3A to Hq & Hq Sq 13th AF (p/1), APO 74, 8 Jun 50. VJP by har boat o /a 27 May 50 to SFPE embg on. USNS Gen Sultan for my outside US. Bag alw in accordance with Cir 357, WD 1946. Mailing address: Provisional Sq 785 APO 74, c/o Postmaster, San Francisco, California Trans Off will furn nec trans. PCS PCA TDN 5704500 P533.5 02, 03 899-999. Automobiles, depns, friends, relatives or pets will not accompany to nor join Offs a t PE. Auth: ITV Order, Shipt AJ-S616-A (a) Hq USAF, Wash, DC, May 50. BY OFDER QF LIEUTENANT COLONEL WILLIAMS: OFFICIAL: GORDON L WHITTED 2D LT USAF Ad jutant DISTRIBUTION: 30 Plus 2 Shipping Br 25 Trp MU Sec 350 T-1 2 Port Postal Off, Bldg. T-11, Ift Mason 2 SFPE 2349th AFORD, Ft Mason 2 Mail and Locator Sec 2 Consolidated M/R Sec M/R Sec 2 Outgoing Bag 10 Hq & Hq Sq 13th AF (p/1), APO 74, SF 2 CG 13th AF, APO 74, SF 1 Postal off, APO 74, SF 1 Hq USAF. Uash, DC, Attn: Postal Br efb 5 CO 33d Stat Svs Unit, APO 74, SF Par 49 SO 101, 22 May 50, Hq 2349th AFORD, Camp Stoneman, California SHIPT: AJ-S616-A(a) 7th Incr ASGMT: 13th AF, APO 74, c/o Postmaster, San Francisco, Calif Name Rank SN Arm Reld fr to 1 FEAF (FEAF MAY 50 REQ, GP VI, P 13, L 114, MOS 5310) 2 WELLS, JOHN P MAJ 7311A USAF SAC FEAF (FEAF MAY 50 REQ, GP I, P 2, L 18 MOS 9310) 3 ANDERSON, JOHN B CAPT 12485A USAF ConAC FEAF (FEAF MAY 50 REQ, GP III, \"64, L 7, NOS 4823) 4 BRADFORD, JAMES W CAPT 10082A USAF Hq Comd FEAF ( FEAF MAY 50 REQ, GP I, P 2, L 15 MOS 2161) 5 CALDWELL, JOEL B JR CAPT 13263A USAF ATRC (FEAF MAY 50 REQ, GP III, P 9, L 83, MOS 6302) 6 JONES, JEAN K CAPT A0732009 USAF SAC FEAF (FEAF MAY REQ, GP II, - 51, MOS 8502) 7 KEITH, JAMES C CAPT A0561402 USAF ConAC FEAF (FEAf MAY 50 REQ, GP III, P 3, L 65 ROS 4823) 8 LUSTER, BERNARD W CAPT A0753534 USAF MATS (FEAF MAY 50 REQ, GP III, P 7, L 58, MOS 4823) 9 C A0807103 USAF SAC FEAF (FEAF MAY-50 REQ, GP II, P 3, L 22, MO3 4823) 10 MILLS, ROBERT J CAPT 12661A USAF ATRC (FEAF MAY 50 REQ, GP II, P 5, L 43 MOS 4902) 11. ROBERT B 1ST LT 14223A USAFF Hq USAF FEAF (FEAD ILAY 50 REQ, GP I, P 2, 12, MOS 1051) 12 NOLL, LORAINE IMI 1ST LT A0586292 USAF ATRC FEAF (FEAF MAY 50 REQ, GP II, P 5, L 43, MOS 4902) 13 BARNETTE, GEORGE G 1ST LT A0862187 USAF ATRC FEAF (FEAF MAY 50 REQ, GP III, P 9, L 88 MOS 9100) 14 POLLOCK, WILLIAM A 1ST LT 101577698 USAF ATRC FEAF (FEAF MAY 50 REQ, GP II, P L 22, MOS 4823) 15 SMITH, DOUGLAS R 1ST LT USAF AMC FEAF (FEAF MAY 50 REQ, GP I, P 1, L 6, MOS 1028) 16 HOLMAN, ROBERT N 2D LT A01903214 .USAF ATRC FEAF (FEAF JUL 50 REC, P 40, L 223, MOS 1054) 17 CASEY, WILLIAM E WOJG AW951372 USAF AFTRC FEAF (FEAF MAY 50 REQ, GP II; P 3, L. 22, MOS 4823) 18 MATLOCK, ROY E WOJG AW951526 USAF ATRC FEAF (FEAF MAY 50 REQ, GP II, P 3, 'L 22, MOS 4823) 19 MORGAN, THOMAS P WOJG AW951535 USAF SAC FEAF (FEAF MAY 50 REQ, GP II, P 3, L 21, MOS 4823) 20 RYNKIEWICZ, JOSEPH F WOJG AW951116; AFTRC FEAF F 50 REQ, GP III, :P L 65, 21 SIIMONS, CHARLES E JR WOJG USAF ATRC FEAF (FEAF MAY 50 REQ MOS 4823) N D Pages 1 - 2 VETERANS ADMINISTRATION DISTRICT OFFICE 17 NORTH DEARBORN STREET CHICAGO 2, ILLINOIS YOUR FILE REFERENCE IN REPLY REFER TO: CH9ABA Capt. Charles E. McGee, USAF -A0-807 103 N 616 99 24 P. 0. Box 101 March AFB Riverside, California Dear Capt. McGee: We have received your letter stating that your National Service Life In- surance special dividend check did not cover the full amount of dividend due you. A review of your account reveals that you were underpaid. Therefore a check for the amount still due as indicated below will be mailed to you at a later date to the address shown above. Insurance Check Amount of Amount Still File Number Number Previous Check Due N 616 99 24 19,581,570 $143.00 Lf you change your address before receiving this check, please furnish your local postmaster with a forwarding address to avoid delay in receipt of the check. Very truly yours, L. C. COCHEU Director, Insurance Service with premiums paid by Albotme P.S. The records of persons in service are maintained in Centrol Office, Veterans Administration, Washington 25, D. C. We are, therefore, trans- ferring your records to that office. Any future inquiries concerning your National Service Life Insurance should be forwarded to the Central Office of the Veterans Administration. FL 9-409 Jan 1950 An inquiry by or concerning an ex-service man or woman should, if possible, give veteran's name and file number, whether C, XC, K, N, Or V. If such file number is unknown, service or serial number should be given. March fir Force Base, California Clearance Shoet Date 1. 2. Departing 2 3. : Type of Clearance (Check One). a. Leave, TDY, or DS (Thirty days or more) b. PCS. 1. 2. 3. 15. - 4. Squadron - 5. Qtrs 17. Dontal Surgeon (Officers Officers-occupying occupying 6. 18. Billcting Office (Bldg T-107) 7. 19. AF Aid Society & Personal Affairs OFFICERSM T-462) 21. Base Provost MAFB Form 35-4 (REV 23 May 49) Authority: Wg Reg 35-2 (Over) 4. Certificates (Sign a, a b, or a b c, as appropriate) a. General: I certify that I have turned in for which I am responsible, except those which are my proporty; that I have satisfied all porsonal indebtedness in this area or have made arrangements satisfactory to my croditors; that I have made settlement of all public funds, proporty ac- counts, and debts due all agencies and instrumentalities of the United States; that I have submitted the necessary efficiency reports, both military and civil- i n par b. PCS. I cortify further that I have in my possession, for transmittal to as- signed station, or have mado provisions through my organization for mailing my Field Military 201 File, Form 66, Form 77, Form 8-117, 481, and if. rated, Form 5, Form 8-116; and copios-o: orders announcing ratine and auth- orizing flying status, and Form 64 as a sealed inclosure to 2 1 Furthor, I my possession Form 65 and identification completed and mailcd nec Sa 9 c. Oversoas Assignment. I certify further that I am propared for oversoas movement accord- ance with Section II of AFM 35-10. Signature 5. Finalization, oversees clearance (Centr^l Clearing Office) I have oxamined abovo clearance for completenessy-and-) have determined that all requirements and provisions of Section II AFM 35-10 have been a0- complished by the rosponsiblo orginization and/or the individual clearing. Name, rank, orgonization 6. Quartors assignment cortificate. DEPARTMENT OF THE AIR FORCE HEADCJARTERS UNITED STATES AIR FORCE WASHINGTON 10 April 1950 PERSONNEL ORDERS) NO. 69) EXTRACT 9. Under the provisions of AFL 36-26, each of the following-namer USAF officers is SUSPENDED from flying status, and the orders detailing each officer to flying duty are SUSPENDED, effective on the date indicated after each name. This order will remain in effect until the officers concerned are relieved from active duty. When an officer named herein is relieved from active duty, this order in its application to him will automatically be rescinded, and the flying status orders he holds at this date will, unless otherwise terminated, again become valid. Effective Date * 1ST IT EDWARD D HOGAN, A02061708 30 Apr 50 1ST LT JOSEPH R HURLEY, A02101638 28 Apr 50 MAJ TOY B HUSBAND, A0728872 24 Apr 50 1ST LT RALPH E IRWIN, A0817452 29 Apr 50 CAPT ROBERT D JACKSON, A01820912 26 Apr 50 CAPT GEORGE T JOHNSON, A0817958 25 Apr 50 1ST LT ROBERT H JONES, A0769842 30 Apr 50 1ST LT WILLIAM E KAAKE, A02086255 25 Apr 50 1ST LT MELVIN TN KAISER, A01696769 30 Apr 50 1ST LT CHARLES E KEENAN, A0737429 28 Apr 50 1ST LT. DONALD K KLEINER, A0719095 30 Apr 50 1ST LT RAYMOND P KLEMME, A02076946 24 Apr 50 1ST LT WILLIAM J KRISTEN JR, A0817231 30 Apr 50 CAPT KENNETH D KUSTER, A0504960 30 Apr 50 1ST LT FRANK C LACHOWSKY, A02070999 30 Apr 50 CAPT FRANCIS M LAMBERT, A0732022 30 Apr 50 MAJ GLENN W LANDRETH, A0412969 28 Apr 50 CAPT MERRITT S LAUBACH, A0791217 25 Apr 50 1ST LT JOHN R LAVACH, A07202/7 30 Apr 50 CAPT ROBERT F LAVLLER JR, AQ660273 25 Apr 50 CAPT RUSSELL J LEIBFARTH, A0799589 28 Apr 50 1ST LT JOE A LEWIS, A0807101 30 Apr 50 1ST LT VIKING H LIAN, A02085803 30 Apr 50 1ST LT WILLARD E LOCKER, A0590268 30 Apr 50 1ST LT RAYMOND A LOWERY, A02072489 28 Apr 50 1ST LT JAMES W LYBRAND, A0748709 29 Apr 50 1ST LT ROBERT B LYON, A0836396 30 Apr 50 CAPT JOHN V McCALL, A0728897 26 Apr 50 1ST LT EARL M McCRARY, A02085808 30 Apr 50 CAPT CHARLES E McGEE, A0807103 27 Apr 50 P.O. 69, Hq USAF, dated 10 April 1950, cont 1ST LT JOHN A MacCOSHAM, A0742745 30 Apr 50 1ST LT CLEMENT M MALONEY, A0936896 28 Apr 50 1ST LT ROY B MARTIN, A0764055 25 Apr 50 1ST LT JOHN C MEAD JR, A02087819 28 Apr 50 CAPT CARL L MELLBERG, A0660584 26 Apr 50 1ST LT ROBERT M MILLER, A0690237 30 Apr 50 1ST LT JOHN I MILLIKEN, A0693063 30 Apr 50 CAPT VERNON C MISER, AO406426 25 Apr 50 2D LT CHARLES R MONTGOMERY, A01908716 26 Apr 50 1ST LT JAMES H MOORE, A0936503 30. Apr 50 1ST LT JAMES A NALER JR, A0784921 30 Apr 50 1ST LT RUSSEL J NORRIS, A0803258 28 Apr 50 1ST LT ERNEST J NORTH, A0818735 29 Apr 50 CAPT JOHN H OLIPHINT, A0674390 25 Apr 50 1ST LT J R PANNELL, A0778928 29 Apr 50 CAPT BENJAMIN L PARKISON, A0416885 27 Apr 50 CAPT JOHN W PATTERSON, A0428557 26 Apr 50 1ST LT PETER PAWLUK, A0786799 26 Apr 50 CAPT CHARLES I PECK, A0699022 2 May 50 1ST LT IRVING B PEDERSEN, A0818527 24 Apr 50 CAPT WHITMAN R PEEK, A0660798 29 Apr 50 1ST LT HAROLD W PERKINS, A0833994 28 Apr 50 CAPT CLIFFORD L PETERSON, A0799850 28 Apr 50 1ST LT LORIMER PETERSON, A0533672 28 Apr 50 1ST LT GEORGE W PHILLIPS, A0695125 30 Apr 50 1ST LT BYRON P PIKE, A0750451 25 Apr 50 CAPT RICHARD K PIMENTEL, A0740009 30 Apr 50 CAPT WILLIAM D POLLOCK, A0857251 30 Apr 50 CAPT RUFUS H PRADOS, A0800042 29 Apr 50 CAPT THEODORE R PRYOR, A0823515 30 Apr 50 1ST LT PHILLIP A QUADY, A0516453 28 Apr 50 1ST LT LOUIS R RANDOLPH, A0778559 30 Apr 50 1ST LT VERNON E RICHARDSON, A0831802 30 Apr 50 1ST LT JAMES S ROBERTS, A0944013 25 Apr 50 1ST LT DALE A ROGERS, A0556519 30 Apr 50 1ST LT JOHN F RCGERS, A0838020 30. Apr 50 1ST LT WILLIAM R ROMANSKY, A0674338 30 Apr 50 CAPT RAYMOND C ROTE, A0432314 28 Apr 50 1ST LT ROBERT C ROUTZONG, A0930507 28 Apr 50 1ST LT JOSEPH N ROY, A02095896 25 Apr 50 BY COMMAND OF THE CHIEF OF STAFF: R. E. NUGENT Major General, USAF OFFICIAL: Acting Deputy Chief of Staff, Personnel HEADQUARTERS 22D BOMBARDMENT WING (M) March Air Force Base, California SPECIAL ORDER 29 April 1950 NUMBER 94 X T R A C T 3. CAPT 2110 JAMES M. SMITH, AO-560 348, WM/USAF & Hq Sq, 221 Bomb Wg this sta is granted four (4) days [Ordinary) lv eff 2 May 50. Address while on lv: 220 Stephens St., Riverside, Calif. Upon compl of lv Off will rpt to CO Hq & Hq Sq, 22nd Bomb Wg this sta. AUTH: AR 600-115. 4. Pending receipt of orders issued by Headquarters United'Stat Air Force, suspending the fol named Offs fr flying status each Officer named is SUSPENDED fr flying status under the provisions of paragraph 5d, AFL 36-26. MAJ DONALD M. CUMMINGS, A0-667 803 MAJ CECIL L. FOMAR, A0-280 839 CAPT GEORGE T. JOHNSON, A0-817 958 CAPT KENNETH D. KU'STER, 10-504 960 CAPT WHITMAN R. PEEK, 1ST LT STEVE hi. ETCHISON, :0-686 729 1ST LT D. HATCHER, AO-1 998 946 1ST LT ROBERT M. MILLER, A0-690 237 1ST LT GEORGE W. PHILLIPS, A0-695 125 1ST LT JAMES S. ROBERTS, 40-944 013 1 T LT JOSEPH N. ROY, AO-2 095 896 APT 2159 CHARLES E. McGEE, 40-807 103 5. M Sgt 821 Harry L. Fogle, AF6 255 908, WM/USAF Hq & Hq Sq, 22d Bm Wg this sta (DOS: Indef) (39 FSC as of Aug 47) is trfd in gr to 22d Supply Sq, 22nd M&S Gp this sta. PCh. No tvl involved. EDCSA: 6. CAPT 1024 CLAYTON D. BURR, JR, 40-809 919, WM/USAF (Comp USAFR) (Basic & Dy A/S-4F) (Plt on fly status) (AFSS Jan 52) (31 FSC as of Dec 46) (YOB: 1921) is reld fr asgmt & dy Hq, 22nd Bomb Gp t}is sta (SAC) and is asgd to Hq & Hq Sq, 22d Bomb Wg for dy as Ground Tng Off (A-3) SSN 2520. PCh. No tvl involved. EDCSA: BY ORDER OF COLONEL GANEY: CHARLES S MANGAN Major, USAF Adjutant 0 was not submitted to Finace office on the above suspension due to Captain McGee departing before 29 50 with pay records DISTRIBUTION: in his possession. 10 ea Par 3, 5, 6 HEADQUARTERS 22ND BOMBARDMENT WING (M) March Air Force Base, California SPECIAL ORDER 21 April 1950 NUMBER 87 R A C T 1. Exigencies of the SV having prevented the issuance of written orders in adv the VOCO 17 Apr 50 directing the fol named Offs & EM WM/USAF orgns' indicated t is sta to proceed on TDY for approx two (2) days fr March AFB, Calif to Rapid City, South Dak for the purpose of ferrying acft parts and upon conpl of TDY Offs & EM will return to proper orgn this sta is hereby confirmed and made a matter of record. It is mandatory that EM utilize all govt grs and/or messing fac available. When air status does not exist EM will be paid mon alws as prescirbed in Sect II AFR 173-5 as amended. 1ST LT GEORGE W. PHILLIPS, AO-695 125, 22nd Maint Sq, 22nd M&S Gp 1ST LT BRUCE M. GEIGER, AO-807 835 2nd Bomb Sq, 22nd Bomb Gp S Sgt John J. Rusbarsky, AF17 056 245; Hq & Hq Sq, 1st AB Gp CAPT CARL K. BAKER, 6852A, Hq & Hq Sq, 22nd Bomb Ng APT CHARLES K. McGEE, A0-807 103, Hq 22nd T Sgt George W. Pennington, ^AF1906894, Hq & Hq Sq, 22nd AB Gp THIA is directed. (Requests R-694, 693) TDN A 5704400 067-1440 P442-02 S04-151 AUTH: 15th AFR 35-2 dtd 1 Jul 49. 2. Exigencies of the SV having prevented the issuance of written orders in adv the VOCO 17 Apr 50 directing the fol named Offs & EM WH/USAF orgns indicated this sta to proceed on TDY for approx five (5) days fr March AFB, Calif to MacDill AFB, Fla and Eglin AFB, Fla for the purpose of ferrying personnel and upon compl of TDY Offs & FM WH/USAF will return to proper orgns and sta is hereby confirmed and made a matter of record. It is mandatory that EN utilize all govt grs and/or messing fac available. When air status does not exist EM will be paid mon alw as prescribed in Sect II AFR 173-5 as amended. CAPT KENNETH H. F. COFFEY A0-792 223; 1st Maint Sq; 1st M&S Gp 1ST LT DALE L. SAMUELSON, A0-699 765, 22nd Bomm Sq, 22nd AB Gp T Sgt George J. Richers, AF19 309 648, Hq & Ho Sq, 1st AB Gp TBMA is directed. (Requesr R-692) CIPAP TDN A 5704400 067-1140 P442-02 S04-151 AUTH: 15th AFR 35-2 dtd 1 Jul 49. 3. The fol aamed offs having been asgd this sta per par 11, SO 85, Hq, 93rd Bm Wg Castle AFB, Calif dtd 11 Apr 50 are further asgd to Ha & Hq Sq 22nd AB Gp this sta. CAPT 0612 FORREST V. POOKE, AO-797 601, WM/USAF (Basic & Dy A/S-AF) F) (Comp USAFR` (Plt .on fly status)( tus)(AFSS (AFSS 1 Jun 52)( (22 FSC as of Jun 45) (YOB: 1916) 1ST LT 7025 WENTWORTH E. COLLINGS, AO-2 058 714, WH/USAF (Basic & Dy A/S-AF) USAFR) (Plt on fly status) (AFSS 1 Feb 52) (i7 FSC as of Jul 47) ) YOB: HQ 22ND BOMB WG MARCH AFB, CALIF SO 87 dtd 21 Apr 50 (Contd). 4. Exigencies of the SV having prevented the issuance of written orders in adv the VOCO 8 Apr 50 directing the fol named Offs & EM WM/USAF orgns indicated this sta to proceed on TDY for approx four (4) days fr March AFB, Calif to Chanute AFB; Ill; Chicago, Ill. and Vright-Patterson, Ohie; for the purpose of ferrying freight and personnel and upon compl of TDY Offs & EN will return to proper orgn this sta is hereby confirmed and made a matter of It is mandatory that EM utilize all govt and/or messing fac available. When air status does not exist EM will be paid mon alw as prescribed in Sect II, AFR 173-5 as amended. 1ST DT DAVID T. BARISH, 17142A, Ha & Ha Sq; 22nd Bomb Wg 1ST LT ERWIN R. STUHR; AO-668157; 2d Bm Sq, 22d Bm Gp S Sgt William F. Koch, AF6294748, Hq & Hq Sa 22nd AB Gp TBMA is directed. (Request R-685) CIPAP TDN A 5704500 067-1440 P442-02 S04-151 AUTH: 15th AFR 35-2 dtd 1 Jul 49. 5. Exigencies of the SV having prevented the issuance of written orders in adv the VOCO 13 Apr 50 directing the fol named Offs & EM WM/USAF orgns indicated this sta to proceed on TDY for approx two (2) days fr March AFB, Calif to Oklahoma City Okla for the purpose of ferrying freight and personnel and upon compl of TDY Offs & EM will return to proper orgns this sta is hereby confirmed and made a matter of record. It is mandatory that EM utilize all govt grs and/or messing fac available. When air status does not exist EM will be paid mon alw as prescribed in Sect II, AFR 173-5 as amended. CAPT ALBERT N. STONE, 7863A, 1st Maint Sq, 1st M&S Gp 1ST LT JOHN L. BRENNAN, A0-1703077, Mobile Tng Det T Sgt Harold B. Cookson, AF39 836 215, Hq & Hg Sq, 22nd AB Gp TBMA is directed. (Request R-684) CIPAP TDN A 5704400 067-1440 P442-02 504-151 AUTH: AFR 35-2 dtd 1 Jul 49. BY ORCER OF COLONEL GANEY: OFFICIAL: CHARLES S MANGAN Major, USAF Adjutant CHARLES S MAN Major, USAF Adjutant DISTRIBUTION: 5 ea Par 1 thru 5 Basic fr Capt Charles E. McGee, AO 807 103, 22 March 1950 Subj: \"Application for Renewal of AFSS\", cont'd 201 - McGee, Charles E (o) 5th Ind AFPMP 4D Dept. of the Air Force, Hq USAF, Washingtor 25, D. C. , 18 April 1950 TO: Commanding Officer, 22d Maintenance & Supply Group, March AFB, California. Approved. BY COMMAND OF THE CHIEF OF STAFF: BAILY, Colonel, USAF, Office, Director of Military Personnel 201-McGee, Charles E (o) 22 Mar 50 Subject: Application for Renewal of Air Force Service Statement 210.4 3d Ind PDCAB HEADQUARTERS FIFTEENTH AIR FORCE, March Air Force Base, California TO: Commanding General, Strategic Air Command, Offutt Air Force Base, Omaha, Nebraska Approved. FOR THE COMMANDING GENERAL: ART4UR Ca tain, USAF 0827 Asst Adjutant Gen ral SAC 210.4 (22 Mar 50) 4th Ind 13 APR 19 DP2A1 HEAD JUARTERS STRATEGIC AIR COMMAND, Offutt Air Force Base, Omaha, Nebraska TO: Director of Military Personnel, Headquarters USAF, Washington 25, D.C. 1. Reconmend approval. 2. Request expeditious reply. FOR THE ING GENERAL: Major, US Asst Adj Ges 22 March 1950 Subject: Application for Renewal of Air Force Service Statement 201 - McGee, Charles E (o) 22MSG-1 1st Ind HQ, 22ND INT & SUPPLY GROUP (MI), March N Base, California. 23 Mar 50 TO: Commanding Officer, 22nd Bombardment ing, Medium, March Air Force Base, California. 1. 2. Captain McGee, while assigned to this organization, has at all times exhibited the highest standards of observance of the officers code of conduct. He is loyal, trustworthy, and inspires confidence in both senior and subordinate. On the basis of his excellent moral character and high degree of proficiency in his profession, I heartily recommend approval of basic request for renewal of ir Force Service Statement. Colon USAF Commanding MBB O 2d Ind HEADQUARTERS 22D BOMBARDMENT WING (M) March Air Force Base, California 25 MAR 1950 TO: Commanding General, Fifteenth Air Force, March Air Force Base, California 1. Approved. 2. Officer's current Air Force Service Statement expires 1 December 1951. 3. Subject officer has been selected for reassignment to FEAF, reporting AFORD, Camp Stoneman, Pittsburg, California on or about 19 May 1950. (Definite reporting date requested from AFORD). Noraml tour of duty in FEAF, except Japan is twenty-four (24) months. FOR THE COMMANDING OFFICER: 2 30HOJ yily OH Hq. 22d Maintenance & Supply Group March Air Force Base, California 201 22 March 1950 SUBJECT: Application for Renewal of Air Force Service Statement TO: Commanding Officer 22d Maintenance & Supply Group March Air Force Base, California 1. Under the provisions of paragraph LO.a.(1), AFR 35-8 as amended, dated 9 April 1948, I, Charles E. McGee, Captain, USAFR, A0-807103, request renewal of my Air Force Service Statement. 2. My current Air Force Service Statement expires 1 December 1951. The remaining time is insufficient to cover a normal overseas service tour (13th Air Force, Phillipines) 3. I am cognizant of all the provisions contained in subject reg- ulation. 4. Within five (5) days of receipt of approval of this application, it is my intent to sign the Air Force Service Statement as described in AFR 35-8. HEADQUAETERS 22ND BOMBARDMENT WING (M) March Air Force Base, California 14 April 1950 82 R A C T 24. Pursuant to auth contained in par 4, AFR 35-16, 20 Oct 44; par 9, AR 40-110, 12 Dec 44, as amended, and par 2 of AR 35-1480, 29 Jan 46, the fol named Off & EM WM/USAF orgns indicated this sta having been found physical disqualified for flying dy is suspend'ed fr all flying dy until notification is received by him fr proper auth that his suspension has been removed. Eff dts indicated. Confirming VOCO. 1ST LT 1035 ROBERT C. ORR, A0-2098382; 33rd Bm Sq, 22nd Bm Gp Eff 10 Apr 50 S Sgt 2756 James B. Adams; AF38410956; .2d Bm. Sq, 22nd Bm Gp Eff 10 Apr 50. S Sgt 2756 Robert L. Kegg, AF33199798, 2nd Bm 22nd Bm Gp Eff 12 Apr 50 Cpl 867 Glenn L. Elliott, Bm Gp Eff 11 Apr 50. 25. Pursuant to auth contained in par 4, AFR 35-16 20 Oct 44; par 4F AFR 160-1, 14 Apr 49, and par 12 of Executive Order 9195 contained in par .2 of AR 35-1480, 29 Jan 46, the fol named Off & EM WM/USAF orgns indicated this sta having been suspended fr flying dy their suspension fr flying is revoked eff dts indicated. Confirming VOCO. CAPT 1024 BRYAN M. SHOTTS, 14680A, 33rd Bm Sq, 22nd Bm Gp Eff 7 Apr 50 T-Sgt 750 Carl W Holler, AF18015440;; HH & Hq Sq, 22nd 50 Sgt 612 William T, Bradford, AF35579693, 19th Bm Sq, Apr 50 Cpl 612 Victor Soules, AF36969790, 33rd Bm. Sq, 22nd Bm 50. CAPT 4823 CHARLES E. MCGEE, AO-807 103, NM/USAF (Gomp USAFR) (Basic & Dy A/S-AF) (AFSS 1 Dec 51) (Pit on flying status) (11 FSC as of Dec 4)(YOB: 1919) is fr asgmt and dy Hq & Hq Sq, 1st Ftr Wg this sta (SAC) and is asgd; Cp Stoneman, Pittsburg, Calif. for further asgnt Gp .2, page 3, line 22, SSN 4823 FEAF May 50. Rqn. Off WP 5Q rptg AFQRD NLT 18 May 50. WD Pamphlet 29-11, amended and AFR be complied with: Equip wili be secured at AFORD: Depns will not accompany Off to AFORD. TPA auth provided disposition is made of auto prior to rptg to AFORD. OS Shipt of privately owned veh is auth in accordance with AFR 75-43, 30 Apr 48, until replaced by appropriate publicat- ion. Twenty (20) DDALVP. EDCSA: PCS PCA TPA TDN A 5704500. 060-114 )-99 S99-999 AUTH: 15th, AF Msg, file PDCPO-155 50. 27. Sgt E. Miletieh RA6 912 636, 6513 ASU, Ft MacArthur, Calif is fr atchd Det of Patients, AF Hosp this sta and WP in patient status o/a 17 Apr 50 to .atche Det of Patients, Fitzsimons Gen Hosp. Denven, Colo., for further observation and treatment. Upon compl of treatment EM will return to proper orgn and \"sta, unless other is indicated. TBMA is directed. (Request R-672). In the event mil acft is not available for journey, tvl by common surf carr is auth] TDN A 5704400 067-1440 P442-02 S04-151 AUTH: AFR 35-58, dtd 7 Feb 50 & Ltr CG, Sixth Army, AMMED 704.11 HQ 22ND BOMB WG MARCH AFB, CALIF SO '82 dtd 14 Apr 50 (Contd). 28. The fol named Offs & EM WM/USAF orins indicated are aptd a committee for the purpose of conducting a monthly inspection of Base, Dinning Halls to determine \"The Best -Dinning Hall of the Month\". Members will 22nd Bomb Wg Food Sv Supervisor at 0900 hrs the 1st day of each month for instruct- ons and inspection forms. Completed forms will be to the Wg Food Sv Supervisor NLT the 10th Day of that month. CAPT ALLON H. WATERMAN, AO-564 571, Hg, 22nd Bomb Gp LST LT JOHN J. SULLIVAN, 0-2 030 585, WM/CE, 817th Engr:(Avn Avn. Bn this sta. M Sgt H. Church, AF15 379, 33rd Bm Sqy 22nd M Sgt Charles J. Gover, 27th-Ftr Ftr Sq, lst Ftr Gp M Sgt Frank Hands, RA6742004,1 Hq Sq, Sv Co, 924th Engr Avn Gp M Sgt Ralph C. Lowis AF35 450 825, Supply Sq, 22nd Gp 29. UP of AFR 35-16, 7a, dtd 20 Oct 44; M Sgt 750D Walter. A. Bremneman, AF6 893 680, 22nd Supply Sq, 22nd M&S Gp is no longer required to participate. in regular and frequent aerial flt and his flying status is hereby terminated* eff 6 Apr 50. Confirming VOCO. 31. The fol named Pars & so, this Hq, dts indicated as reads: \"Govt qrs are available\", is AMENDED to read: \"Govt will be utilized Par 24, SO 59; this Hq, dtd 18 Mar 50 Par 35; SQ 58, this Hq, dtd 17 Mar 50 Par 23, SO-54, this Hq, dtd 13 Mar 50 (Re: TDY Offs & EM fr March AFB, Calif to Victorville AFB, Calif) (Request R-558A, B-560A, R-661A). BY ORDER OF COLONEL GANEY: OFFICIAL: CHARLES S MANGAN Major, USAF Adjutant DISTRIBUTION: 10 ea Par 24 thru 31 HQ 22ND BOMB WG MARCH AFB, CALIF SO 73, dtd 4 Apr 50 27. Par 11, SO 64, this Hq, dtd 24 Mar 50 is RESCINDED eff 4 Apr 50. (Re: Amendment of Investigatinn Bd for the fires occuring on March AFB, Calif) 28. Par 26, SO 57, this Hq, dtd 16 Mar 50 is AMENDED as follows: so much as reads: \"COL STANLEY R. SCARBROUGH\" is AMENDED to read: \"COLONEL STANLEY R and so much as reads: \"LT COL JOHN DOZISR, 797A, Hq 1st M&S Gp\" is AMENDED to read: \"LT COL JOHN DOZIER Hq-lst M&S Gp\", and so much as reads: \"MAJ ROGER HERRICK, AO-330 581, Sq, 1st Ftr Wg\", is AMENDED to read: TJ ROGER M. HERRICK, AO-330-581, & 22nd Bm and so much as reads: \"Mr Cornelius A. Tagerstrom\", is AMENDED to read: Mr Cornelius A. (Re: Investigation Bd for the Fires occuring on March AFB, 29. SMOP 34, SO 72, this Hq, dtd 3 Apr 50, as pertains to MAJ 2136 JOHN M. HOFFMAN, 8556A, is REVOKED. (Re: Reasgmt of Off fr 22nd Supply Sq, 22nd M&s Gp to Hq, 1st M&S Gp). 30. The fol named Off's orngs indicated this sta are aptd members of the 22nd Bomb Wg Abort Bd (Add Dy) eff 29 Mar 50. Bd aptd per par 5&6, SO 51, dtd 8 Mar 50 and par 10, SO 61, this Hq, dtd 12 Mar 50 is hereby DISSOLVED. Confirming VOCO. AUTH: SAC Reg 66-11 MAJ 2161 LOUIS J. LAMM, 8612h, 19th Bomb Sq, 22nd Bomb Gp (President). CAPT 4822 HARRY E. BITTNER, A0-860793, Hq 22nd Bin Gp CAPT 1024 FREDERICK B. FARRELL 7206A, 33rd Bm Sq, 22nd Bm Gp 1024 ALFRED V. HEINO, 7096A, 2nd-Bomb Sq, 22nd Bomb Gp 4823 CHARLES E. McGEID A0-807103, Hq 22nd M&S Gp 1ST LT 1024 ROBERT E. FRITTS, 15482h, 33rd Bomb Sq, 22nd Bomb Gp 1ST-L LT 4823 CECIL L. KLINE, A0-590409, 19th Bomb Sq, 22nd Bomb Gp 1ST LT 4823 JOSEPH KUMPAN, A0-889903, 2nd Bomb Sq, 22nd Bomb Gp 1ST LT 0141 WINSTON J. NAP IER , A0-818730, Hq, 22nd Bomb Gp 1ST LT 4823 CLAIBORNE F. BICKHAM, 60-872805 Hq, 22nd Bomb Gp (Recorder). BY ORDER OF COLONEL GANEY: CHARLES S MANGAN Major, USAF hdjutant EADQUARTERS 22ND BOMBARDMENT WING (M) March Air Force Base, California SPECIAL ORDER 4 April 1950 NUMBER 73 23. T Sgt 750C Lee D. Johnson AF19 309 643, WM/USAF Flt B 4th Rescue Sq ARS MATS This sta WP o/a 12 Apr 50 on DS for approx eight (8) wks fr March AFB Calif to 3750th Tech Tng 3750th Tech Tng Wg, Sheppard AFB, Texas to att Crse 99500 (Rotary Wg EM will rpt NLT 0800 hrs 17 Apr 50., for class commencing 19 Apr 50. Length of crse eight (8) Wks. Upon compl of DS EM will return to proper orgn and sta. It is mandatory that utilize all govt qrs and/or messing facilities available. Clothing and records will accompany EM in accordance/w AFL 50-48. TBMA is directed. (Request S-233). In the event that mil acft not avail TC Will furn nec T. TDN A 5704500 065-1475 P552-02 S04-151 AUTH: Ltr DP/E 352.11 Hq ARS Subj: Allot of Sch suotas dtd 17 Mar 50 and 1st Ind Hq, 4th Rescue Sq, Hamiliton AFB Calif dtd 24 Mar 50. 24. Pursuant to auth contained in par 4, AFR 35-16, 20 Oct 44; par 4F AFR 160-1, 14 Apr 49, and par 12 of Executive Order 9195 contained in par 2 of AR 35-1480, 29 Jan 46, the fol named Offs & EM NM/USAF orgns indicated this sta having been suspended fr flying dy their suspension fr flying is revoked eff dates indicated. Confirming VOCO. CAPT 1059 WYMAN D. ANDERSON, 11283A, 94th Ftr Sq, 1st Ftr Gp Eff 31 Mar 50 CAPT 1024 RALPH L. WALKER, 7836A, 33d Bm Sq, 22nd Bm Gp Eff 31 Mar 50. CAPT 1034 LUTHER H. BURNEY, AO-734068, 19th Bm Sq, 22nd Bm Gp Eff 31 Mar 50 CAPT 1024 CLAYTON D. BURR, AO-809919, Hq & Hq 22nd Bm Wg Eff 31 Mar 50 1ST LT 1051 FDWARD F. McDUFFIE, JR, AO-842865, March Flt Sv Center, Eff 14 Mar 50. Subj to confirmation fr higher auth. 1ST LT 1024 ERNEST W. OLIVER, A0-2093224, 2d Bm Sq, 22d Bm Gp eff 1 Apr 50 S Sgt 2756 John F. Cummins; AF12030440, 2d Bm Sq, 22nd Bm Gp Eff 31 Mar 50 S Sgt 2756 Hildreth Deanne, AF13 043693, 19th Bm Sq, 22nd Bm Gp Eff 31 Mar 50 25. The fol named Offs WM/USAF orgns indicated this sta re atpd Test Flt in T-6 Type Acft. AUTH: 22nd Bm Wg Reg 50-12 dtd 21 Nov 49. Confirming VOCO, dts indicated. CAPT WILFORD J. CRUTSL GER A0-726 134, Hq & Hq Sq, 22nd AB Gp Eff 23 Mar 50 1ST LT RONALD A.: JAMESON, 16240A, 19th Bm Sq, 22nd Bm Gp Eff 30 Mar 50. (hptd Instructor Plt in T-6 type acft) 2.. The fol named EM WM/USAF orgns indicated t is sta are trfd in gr to ong. indicated this sta. PCA. No tvl involved. EDCSA: Par 13 g AFR will be complied with. TRFD Cpl 534 Walter W. Barton AF17 249 944 Hq & Hq Sq, 1st Ftr Wg (For dy/w Chaplains Office). TRFD TO: 1st Ftr Pfc 534 Armand A. Grillo, AF12 308 348 Hq & Hq Sq, 22nd Bomb Wg (For dy/w Chaalains Off HEADQU.LRTERS 22D DOMBARDINENT TIING (ii) March Air Forco Basc, California SPEC I L ORDER 3 hpril 1950 72 E X T R N C T T R C 34. The fol named Offs, TM/USAL unloss othorwisc indicatod, orgns this sta, are trfd in gr to orgns indicatod, this sta. PC.1. No tvl involved. 6 .PPRIL 1950. Par 13g .`FR 35-13 will bc conpliod with. TRFD TO: HQ & HQ 22D BOMB TIG (11) 810L GEORGE J. SCHWEIZER, ..0749 823 Hq & Hq Sq, 1st Ftr 1ST LT 2110 J. HICKCOX, 15410.1 Hq 22d .ir Basc Gp TRFD TO: HO c: HQ 1ST FTR 'TG 7536 CECIL L. FOLILLR, 10280 839 Hq 22d .ir Baso Gp 1823 E. McGEE, .10807 103 (N) Hq 22d N&S Gp 1059 D. MICHELSON, A0756 649 Hq 1st Ftr Gp TRFD TO: HQS 22D M&S GROUP FT 2110 R. TURNER, .10573 627 Hq lst M&S Gp TRFD TO: 22D SUP 22D M&S GP 4419 JIMES M. FOX, 1.01 588 562 lst Sup Sq, 1st M&S Gp 4902 .LONZO E. GOODITIN, ..0477 346 1st Sup Sq, 1st M&S Gp TRFD TO: HQS 1ST MI&S GP 2136 JOHN M. HOFFIKIN, 8556.1 22d Sup Sq, 22d M&S Gp 2110 CHLRLES L. BROOKS, 9886.1 Hqs 22d NIS Gp TRFD TO: 1ST SUP 1ST MISS GP 4010 H. BORGENS, 10562 581 Hqs 22d NI&S Gp 4902 STEVEN L. Do PYSSLER, 11990 537 22d Sup Sq, 22d M&S Gp 4419 ROL NND G. STEVENS, 117951 199 22d Sup Sq, 22d J&S Gp TRFD TO: HQS 1ST `IR B.SE GP 2136 OLiN, 10514 228 Hqs 22d hir Basc Gp Paragraph 34 contd on back HQ 22D BONB T.GG MLRCH .ifB C LLIF, SO 72 dtd 3 Apr 50 (Contd) (Paragraph 34 Continued) TRFD TO: HQS 1ST 'IR B.ISE GP (CONT'D) 1059 RICH.IRD D. STARK, A0768 801 Hqs 22d hir Base Gp TRFD T-: 1ST COITM 1ST .IIR BASE GP TO JG 0200 ... JOINSTON, 117950 772 Hq & Hq Sq, 1st Ftr TIg TRFD TO: 1ST INSTALLITIONS SQ, 1ST AIR BASE GP 7025 JOIN T... ETTER, JR., 10:370 845 Hqs 22d lir Basc Gp C.1PT 7015 LLOYD B. ELDER, 10915 418 22d Instl Sq, 22d :BBp CAPT 7025 JACOB F. FULLILOVE. 365 Hqs 22d lir Base Gp 1ST LT 1062 SCOTT, 903 143 Hqs 22d fir Base Gp TRFD TO: 1ST .IIR POLICE LST .IR BLSS GP 1ST LT 1054 ROBERT E. P.RRFITT, 10840 627 Hqs 22d lir Base Gp TRFD TO: 22D ..IR POLICE 22D .1IR B.SS GP 1ST LT 9110 BYRON G. KUHN, 411 1st \"ir Police Sq, 1st .1BGp BY ORDER OF COLONEL GANEY: OFFICIAL: CHARLES S MANGAN Major, USAF Adjutant WOJG, USAF Asst Adjutant DISTRIBUTION: 20 ea to Orgn 3 ea Off HEADQUIRTERS 22ND EOMBARDMENT WING (M) March Air Force Base, California SPECIAL ORDER 25 March 1950 NUMBER 65 T R h C T 2. UP of AFL 35-704, dtd 5 Oct 49, as amended and recommendations of the g Personnel Classification Bd aptd per auth contained in AFL 35-391 dtd 29 Jul 49, as amended the fol named Offs WM/USAF unless otherwise indicated, orgns indicated, this sta, are awarded new WO Primary Air Force Specialties and Secondary hir Force Specialties as indicated: 22nd Bomb OLD CAREEH WARRANT TITLE NEW AIR FORCE SPECIALITY CAI T 1400 AUDREY D. TOLLEY 27000 Air Traffic Con & Wg Supt A0-579 481, Comm Supply (Primary) 29000 Comm Opr Supt (Secondary) CWO 0200 REX R. BAKER, 29000 Comm Opr Supt (Primary) AW 2119190, hir Comm 36000 Wire (Secondary) 30100 Radar Maint (Secondary) WOJG 2110 FRANKLIN JONES, 73000 Mil Pers Supt AW 950 774, Adm Asst WOJG 4823 THOMAS P. MORGAN 43100 Acft Maint Supt (Frimary) AW 951 535, Acft Maint & Insp 22nd M&S MAJ 4823 BYERS FREEMAN, 43300 Acft Eng Overhaul Supt A0-493 986, Acft Maint & Insp (Frimary) 43100 Maint Supt (Secondary) 27000 kir Traffic Con: & Ving Supt (Irimary) 43100 Acft Maint Supt (Secd) - 4400 HERBERT B. BAIRD, 64100 Supply Supt (Irimary) AW 950 342, Comm Supply WOJG 4902 STEVEN L. DePYSSLER, 64100 Supply Supt (Irimary) AW 950 537, Air: Tech Supply WOJG ROLAND G. STEVENS 64100 Supply Supt (Irimary) AW QM Gen Supply WOJG 2110 GEORGE J. STIGLINSKI 70000 Adm Supt (frimary) AW 951. 202, Adm Asst 73000 Mil Fers Supt (Secd) 22nd Mtr Veh 4805 HIRAM M. YOUNG 47000 Veh Maint Supt (Trimary) AO-1 553 584, Wheel Veh Maint (Faragraph 2 Continued on back page) HQ 22ND BOMB WG MARCH AFB, CALIF SO 65 dtd 25 Mar 50 (Contd) aragraph 2 continued) lst Ftr & WOJG 2110 HAROLD R. GALLOWAY 70000 Adm Supt (Primary) AW 950 611 HOJG 0200 JAMES A. JOHNSTON, 29000 Comm Opr Supt (Irimary) AW 950 772, Air Comm 36000 Wire Maint Supt (Secd) lat AB 1ST LT 4823 RAYMOND W. SKIZKE, 43100 Acft Maint Supt (Irimary) 60-871 905,Acft Maint & Insp 43300 Acft Eng Overhaul Supt (Secondary) 1st Comm CAI T 0224 ROBERT W. WHITFIELD, 29000 Conm Opr Supt (Trimary) A0-1 638 782, Cryptographic WOJG 0200 WILLIAM HADDOX 29000 Comm Opr Supt (Primary) AW 902 236, Hir Comm 30100 Radar Maint Supt (Secd) 1st Ftr NOJG 4593 - F. YOUNG, 32000 Arm Systems Supt (Primary) AW 2133402, Acft Armament 46200 Weapons Maint Supt (Secd) lst M&S CAIT 4419 JAMES M. FOX, 64100 Supply Supt (frimary) A0-1 588 562, QM Gen Supply CArT 4902 ALONZO E. GOODWIN, 64100 Supply Supt (Trimary) AO-477 346, Air Tech Supply 1st Mtr Veh WOJG 2110 OSCAR O. BROWNT JR 70000 Adm Supt (Trimary) AW 951 367, Adm Asst. BY ORDER OF COLONEL GANEY: CHARLES S MANGAN Major, USAF Adjutant DISTRIBUTION: 5 ea lar 2 22D BOMBARDITINT (if) MiRCH AIR FORCE BASE, SUBJECT: Conversion to the Career Program TO: Captain McGee HIg 22d NISS Grour March /FB, California 1. Under the provisions of paragraph 5A, LIFL 35-704.1, dated 3 February 1950, you are scheduled to :neet the hing Classification Board at on 22 March 50 The Classification Board will convone in the 22d Bomb thing Clossification Board Room Building T-5501. 505 2. _1 reviow has boen made of your VID ..GO Form 66. Based upon this reviow, it sppoars likoly that your conversion b c to one of tho following hir Forco Spocialtics: 43100, 43300, 7000, 70000 It is roconnondod you road and those job tions prior to appoaring buforo the Bonrd. 3. Undor the provisions of poragraph n(2)(h), .FFL 35-704.1, you are required to proscnt to the Board your \"Lotter of Soloction\", \"Officicl alrant \"ppointment\" or othor substontinting ovidence as proof of cligibility bofore your co!vorsion can be offectod. FOR THE PRTSIDETT KENNETH '. CORKHILL lst Lt, USAF Recorder EAD JUARTERS 22ND BOMBARDMENT WING (M) March Air Force Base, California SPECIAL ORDER 8 March 1950 NUMBER 51 EXTRACT A C T 5. The fol named Offs WM/USAF orgns indicated this sta are aptd members of the 22nd Bomb Wing B e, Abort Bd. eff 1 Mar 50. Confirming VOCO. AUTH: SAC Reg 66-11. CAPT 4823 CHARLES E. McGRE, AO-807 103, Hq, 22nd M&S Gp CAPT 0200 BRUCE H. EVENS, 10259A, 19th Bomb Sq, 22nd Bomb Gp CAPT 1024 FREDERICK B. FARRELL 7206A, 33rd Bomb Sq, 22nd Bomb Gp 6. The fol named Offs WM/USAF orgns indicated this sta are apt members of the 22nd Bomb Wg Base Abort Bd (Add dy) eff 1 Mar 50. Confirming VOCO. AUTH: SAC Reg 66-11. MAJ 2161 LOUIS J. LAMM, 86124, 19th.Bomb Sq, 22nd Bomb Gp MAJ 2161 JOHN W. SWANSON, 10783A, 2nd Bomb Sq, 22nd Bomb Gp CAPT 2161 WILLIAM P. LEMME, 7650A, Hq,, 22nd M&S. Gp: 7. SMOP 17, SO 44, this Hq, dtd 28 Feb 50. as reads: \"MAJ ORLAND-O SISLER, 7539A, WM/USAF, 2nd Bomb Sq, 22nd Bomb Gp\" is AMENDED TO read: HVAJ ORLAND 0. SISLER, 7539A, WM/USAF 22nd Bomb and as reads: \"FEAF Mar 50\" is AMENDED to read: \"FEAF Trf of Off to 2349th AFORD Hamilton AFB, Calif). 8. Par 24, SO 41, this dtd 50 is to NAUTH: AF MAJ MAX W. HENNEY, 9219A Hq & Hq Sq, 22nd Bm Wg to Hq & Hq Sq, 15th AF this sta). 9. Pursuant to auth contained in par 4, AFR 35-16, 20 Oct 44; par 4F AFR 160-1, 14 Apr 49, and par 12 of Executive Order 9195, contained in par 2 of AR 35-1480, 29 Jan 46; S Sgt 612 Carson Bryant AF6 922 031, WM/USAF 19th Bomb Sq, 22nd Bomb Gp this sta having. been found physically disqualified is suspended fr all flying dy until is received by him fr proper auth that his suspension. has been removed. Eff 6 Mar 50. Confirming VOCO. 10. Pursuant to auth contained in par 44; par 4F AFR 160-1, 14 Apr 49 and par 12 of Executive 9195, contained in par 2 of AR 35-1480, 29 Jan 46, 1ST LT 1059 JAMES C. PREBBANOW, 175204, 94th Ftr Sq, lst Ftr Gp this sta havingbeen suspended fr flying dy his suspension fr flying is revoked, reff 6 Mar 50. Confirming VOCO. 11: Pursuant to auth contained in par 4, AFR 35-16, 20 Oct 44; par 9 12 Dec 44, as amended; and par 12 of Executive order 9195, par 2 of AR 35-1480, 29 Jan 46, 1ST LT 1059 STEVE J. CHETNEKY, 14882A, 94th Ftr Sq, lst Ftr Gp this sta having been found physically disqualified for flying dy is suspended fr all flying dy is recevied by him fr proper auth that his suspension has been removed. Suspension eff 6 :Mar 50. Confirming VOCO. HQ 22ND BOMB WG MARCH AFB, CALIF SO 51 dtd 8 Mar 50 (Contd). Exigencies. of the SV. having prevented the issuance of written order the 3 Mar 50 directing S Sgt Ernest C. Johnson, AF39 022 294 294, 94th Sq, 1st Ftr Gp this sta to proceed on TDY for approx three Calif to Williams AFB, Chandler Ariz, for the purpose acft thereat and upon compl of TDY EM will return to proper orgn this sta hereby confirmed and made a matter of record. It is mand- atory that EM ars and/or messing facilities ayailsble. When air status does not EM will be paid mon alws as prescribed by Sect II AFR 173-5 as amended. TFMA is directed. (Request- TDN A AUTH AFR 35-2 dtd 1 13. Exigencies of the SV having prevented the issuance of written adv the VOCO 1 Mar 50 directing .SST LT herBERT F. WILSON, AO- 22nd Maint Sa, 22nd Gp this sta to 'proceed on TDY for days ft March AFB, to West Los for Line of Investigation Johnny D. Dotter, AF19 Bomb; AFB, Merced Calif and upon compl of TDY Off to orgn this sta is hereby confirmed and made a matter of record. TPA is auth. (Request R-548) No Per Diem auth. P442-02 S04-151 15th AFR 35-2 dtd 1 Jul 49. 14. Pfc 010 Allen A. Shelley, RA19 352 117, WN/SCRWAF, 622nd Engr Avn Maint Co, is reld fr atchd Det of Patients, this sta and WP o/a 10 Mar 50 in Patient status to atchd 2209th Hosp Sq, Letterman Gen Hosp, Presidio of San, Francisco, Calif for further obgervation and treatment. Upon compl of treatment EM will return to proper orgn this sta unless other dis- position is indicated. TBIAA is directed. (Request R-551). In the event that mil acft is not available tvl common surface carrier is auth. TDN A 5704400 067-1440 S04-151 AUTH: WD Cir 238/47 as amended by DOA Cir 68/47 & Ltr CG, Sixth Army ATMED 704.11 BY ORDER: OF COLONEL GANEY: OFFICIAL: VCHARLES S MANGAN Major, USAF Adjutant WOJG, USAF Asst Adjutant DISTRIBUTION: 5 ea Par 5, 6 10 ea Par 7 thru 14 HEADQU JARTERS 22D BOMBARDMENT WING (M) MARCH AIR FORCE BASE, CALIFORNIA 27 FEB 50 SUBJECT: Application for Retention on Active Duty in a Permanent Non-flying Status TO: Name No, `oountarily request retention on active duty in a permanent non-flying status. 2. I fully understand that this request for retention on act;ive dithy in a non-f!ying status is for continuation on active duty, and in no way affecis the possible length of my active duty at the convenience of the Government: or the terms of any Service Statements that I have signed or may sign. I under- stand that I will be considered on the same basis as other non-rated personnel for all future personnel ac:ions. 3. I request that I be permanently removed from flying status and that my flying status personnel orders be suspended. I further understand that this removal from flying status will remain in effect until I have been re- lieved from active duty, at which time the flying status personnel orders I now hold, unless otherwise terminated, will become valid. in Incl 1 22ND (N:) Air Force Base, SFECIAL ORDER 9 January 1950 NUMBER 5 C T 22. 1ST LT 2159 JAMES T McGOWAN, A0 781 926, TMM/USAF, March Flight Service Center, this sta, is reld fr AD and asgmt by direction of the I'res. ident and P o/a 10 Jan 50 to his home of record: Box 64 Centralia, Niss- ouri SO as to arrive thereat NLT 13 Jan 50 on which date Off is reld fr AD and reverts to an inactive status not by reason of physical disability. Off entitled to componsation for forty nine (49) days accrued lv under Armed Forces Lv hct as amended by Fublic Law 350-80th Congress approved 4 Aug 47. Off`will be given \"JD AGO Form 53-98, Parts 1 and 2. By direction of the Fresident all temporary apm$s held are terminated eff date of relief fr A.D. Fresent mailing address and address at time of EAD: Centralia, Missouri. Last perm duty sta: March AFB, Calif. Eff date: 13 Jan 50, FCS :TLN TPA A 5704500 060-211 P 539-02-03-07 899-999 REASON AND AUTH: Conv of Govt: Sec 515d PL 381-80th Congress Approved 7 Aug 47 (Contained in :VD Bul 18, 47) & TAFL 36-3 dtd 5 Aug 49. 23. 1ST LT 1051 NALLACE A AO 763 039, Hq & Hq 3q, 22nd Air Base Group (AP PERGONNEL ANAITING ASGMT) this sta is reld fr AD and asgmt by direction of the President and T/P o/a 14 Jan 50 to his home of record: 2729 Gilroy 3t, Los California SO as to arrive thereat NLT 15 Jan 50 on which-date Off:i is reld fr AD and reverts to an inactive status not by reason of :physical disability. Off entitled to compensation for fourteon (14) days accrued lv under Armed Forces Lv Act as amended by Fublic Law 350-80th Congress approved 4 hug 47. Off will be given ND AGG Form 53-98, Iarts 1 and 2. By direction. of the President all tomporary apmts held are terminated eff date of reliof fr -D. Frasant mailling and address at time of EAD: Los Angeles, Calif. Last perm duty sta: Germany Eff date: 15 Jan 50. PCS TDN - .TAP A 5704500 060-211 P 539-02-03-07 399-999 REASON AND AUTH: Conv of Govt, Sec 515d; FL 381-80th Congress approved 7 Aug 47 (Contained, in \"D Sul 18, 47) and AFL 36-3, dtd 5 fug 49. 24, CAPT 1035; NO PMAN -CRIFFIN, A0 765 562, VM/USAF, 2nd Bomb Sq, 22nd Bomb Gp, this sta, is reld. fr AD and asent by direction of the Fres- ident and WP o/a 12 Jan 50 to his home of record: Coin, I wowa SO as to arrive thereat NLT 18 Jan 50 on which date off is reld fr AD and leverts to an inactive status not by reason of. physical disability. off entitiled to compensation for sixty (-60)days accrued lv under --rmed Forces Lv Act as amended by Public Law 350-80th Congress approyed 4 Aug 47. Off will be given TID AGO Form 53-98, Farts 1 and 2. By direction of the President all temporary apmts held are torminatod eff date Off is reld fr AD. Present mailing and `addross at time of EAD: Coin, I wowa . Last perm dy sta: March.RI Calif. Eff date: 18 PC3 .THA TDN it 5704500 060-211 P 539-02-03-07 S99-999 REASON AND AUTH: Cony of Govt, 3ec 515d PL 361-80th Congress approved 7 Aug 47 (Contained in Bul 18, 47) and AFL 36-3 5 Aug: 49. HQ 22nd BOMB MARCH AFB, C' 25. Exigencies of the SV having prevented the issuance of written orders in adv the VOCO 4 Jan 50 directing the fol named Off and EM, WM/USAF, orgn indicated, this sta, to proceed on TDY for approx three (3) days fr March AFB, Calif to Langley AFB, Virginia for the purpose of ferrying personnel and upon compl of TDY Off and EM to return to proper orgn and sta is hereby confirmed and made of record. It is mandatory that EM utilize all Govt ars and/or messing facilities available. When air status does not exist EM will be paid mon alws as prescribod In Sec II, AFR 173-5, as amen- ded. MAJ BRUCE L MORRISON, 8672h, Hq` & Hq Sq, 1st B Gp CAPT HOWARD FOULIN, A0 824-565, Hq 1st Ftr Gp M Sgt Marshqll Ritter, AF13 0C1 603, Hq & liq Sc, 22nd AB Gp TDN A 5704400 667-1440 P 442-02 S04-151 (R-420). TBMA is diracted. AUTH: 15th AFR 35-2, 1 Jul 49 26. Exigencies of the SV having prevented the issuance of written ord in adv the VOCO 5 Jan 50 directing the fol named Off and EMVI WM/USAF, oren indicated, this sta, on TDY for approx two (2) days fr March AFB, Calif to San Antonio, Texas; Tinker AFB, Okla and Smokey Hill AFB, Kansas for the purpose of administrative matters and ucion compl of TDY Off and EM to return to proper orgn and sta, is hereby confirmed and made a matter of record. It is mandatory that utilize all Govt ars and/or messing facilitias available. When air status does not exist EM will be paid mon alws as prescribed in Sec II, AFR 173-5, as amended. CAPT CHARLES E 610 807 103, Hq 22nd M & S Gp CAPT HAROLD A SWANSON , AO 708 346. 27th Ftr Sq, J, 1st Ftr Gp T Sgt William C Beeley, AF16 010 074, Hq & Hq Sq, 22nd AB Gp TBMA is directed. TIN A 5704400 067-1440 F 442-02 304-151 (R-<21) AUTH: 15th AFR 35-2, 1 Jul 49. BY ORDER OF COLONEL GANEY: OFFICIAL: CHARLES S MANGAN Major, USAF Adjutant H NOJG, USAF Asst Adjutant DI3TRIBUTION: 35 ea - 22 thru 24 10 ea - 25, 26 22d is Supply Group, Nedium March Air Force Base, California 123 ) 1. Oliver J Jelscher, AF-6828988, 22nd Supply SC, this Gp, is granted 10 days Teave of Absence. (Ordinary) eff 23 December 1949. Upon comp of lv, rpt to CO 22d Supply Sc; NIT 2400 hrs 2 January 1950. IV ADDRESS: 24874 Atwood st Sunnymead, California. AUTH: ^R 600-115. The fol name d Officers and Airmen, Hq 22nd Maint & Supply Group are ased as indicated with section as indicated AUTH: SAC Re g 66-12 4823 CHARLES E MCGEE, AD 807 103, Dy as OIG Inspoction and Flight Tost Seb. w/Maint Gontrol. 1ST LT 1054 WILLIAM D HATCHER, A0 1 998 946, Dy as OIC of Personnal, Adm. and Tng w/Maint Control. M/Sgt 925 Alcxander Tunnor, AF6 7091 370, DJ as NCOIC of Control-Unit Control. M/Sgt 82 6 Morri's Langor, AF6 481 530, Dy as Supply Liaison Coordinator and Inspector w/liaint Control. I/SS 502 Steve Turner, AF6 859 728, Dy as Supply Liaison and Coordinator and Inspector w/Maint Control. 3. The following name`d Officer and Airmen, 22nd Maint Sq, 22nd Maint & Supply Group re`ased duty as indicated with section as SACR 1ST LT 4821 JOHN 0 RAYMER, 15310A, Dy as OIC of Control Unit W ^iaint Control. M/SSt 925 Alfred L Cove, AF6 578 319, Dy as acft and Engine Inspactor Control. Set 405 Temmy N Greene, AF7 083° 197, Dy as IRR Control Clerk w/Maint Control. Cpl 405 William C Be nne tt , AF14 264 941, Dy as Teeh Order Compliance Che w/Maint Control. 4. Under the provision of AFL 39-9 and upon recommandation of the ir ommand ing Officer, the following named -irmen, 22nd Maint Sq, 22nd Maint & Sup Group are promoted to the grade of CORFORAL: Ffc 747-V Elisha Bryant AF14 297 184 Pfc 555 Lawrence A Regly AF16 266 977 5. In accordance with Wing Re: 32-2, dtd 22 June 1949, the following named Officer and Airmen, 22nd Maint Sq, this Gp, are aptd Ground Safe ty Officer and Ground Safety NCOs for the 22nd Maint Sg, this Gp. 1ST LT 4823 HERBERT F WILSON 40 588215 M/Sgt 925 Gilbert T Bottcher AF 6936237 I//SSt 925 Erwin Greenhut no 6488220 D.UARTERS 22ND MA INTEN NCE & SUP. LY GROUP (M), SO 126, dtd 22 Dec 49 (Cont'd) Far 5 (Cont'd) M/Sgt 925 Walter W Hosch AF 6489736 M/Sgt 574 Richard H Larson AF 6913677 M/Set 821 Jame s F Metcalf AF 6748386 M/Sot 750I Charles H Brient, Jr. AF 6272745 M/Sgt William C Sundgren AF 11013915 T/Sgt 747D Floyd J Champion AF 19309503 T/Sgt 925 Norman J Blazzard 18017964 T/Sgt 911 Franklin B Sipes AF 15382572 T/Sgt 958 Curtis R Hill FA 15336797 T/Sgt 957 Carl C Watson AF 6953162 T/Sgt 826 William J AF 6557770 T/Sgt 555 Floyd J. Bull AF 19045994 T/Sgt 573 Wal ter. I Rogers AF 6291116 S/Sgt 955 Jose ph R Benemann A 13041012 S/Sgt 542 Charles F lccCaffre-y if 19309654 S/Sst 621 Ob ie C Crawford AF 6296028 S/Sit 555 Wilfred M Schauf MA 17166536 Sgt 575 Robert: B Schaeffer AF 12292153 Sgt 114 John Robaczewski, Jr. 16265149 6. M/Sgt Oliver J Welscher, AF6 828 988, WI//US.F, 22nd Sup Sq, this Gp, is granted ten (10) days ord lv eff.23 December 1949 and upon completion of lv amn will report to CO 22nd Sup Sq, this Gp, NLT 2400 2 January 1950. address while on lv: 24874 Atwood Street, Sunnymead, California. ..UTH: AR 600-115. 7. Sgt 835 Walter G Coleman, -F14 227 900, 22nd Sup Sq, this Gp, is auth to ration parate ly eff 6 December 1949. Confirming VOCO. AUTH: R 210-10. 8. SMOP 8 SO 115, this Hq, CE, as reads: asgd* Dy Unit Mail Clark (SSN 055` is ame nded to re ad : 'ssed du OJT Unit Mail Clerk (SSN 055)., (RE: Dy asgmt of Ffc William T Hunter, -F13 306 980,, 22nd Mtr Veh Sq, this Gp). 9. 6gt (014) Clarence H Nelson, AF38 725 499, NN/US.F , 22nd Mtr Veh Sq, th Gp.is asgd Dy OJT 965 (automotive Repairman). AUTH: AFM 35-1 as amended and approval of Hq 22nd Bomb Wing. 10. Pfc (345) Paul L Quakenbush, LF17 291 771, WM/USAF, 22nd Mtr Veh Sq, Gp, is asidd Dy OJT 242 (Toolroom Keeper) AUTH: AFM 35-1 ad ame nd ed and appr ov.'. appr of Hq 22nd Bomb Wing. 11. Pfc (931) arthur Grace, 270 524, NM/US..F , 22nd Mtr VE h Sq, this Gp, is asgd Dy OJT 932 (Specal Vehicle Operat cr) AUTH: AFM 35-1 as amended and appr oval of 22nd Bomb Wing. 12. S/Sgt (014) Cecil B Luckie, 862 664, NM/USAF, Mtr Veh Sq, this Gp, is asgd Dy OJT 166 (Powerman). AFM 35-1 ad amended and approval of 22nd Bomb Wing. -2. Hi, , 22ND M.INTEN.. & SUPILY GRUUP (M) , SO 126, d dd 22 Dec 49, Cont'd 13. Having baen asgd this Hq par 22 SO 132 Hq 22nd Bomb Wing (M), this sta, Ffc (521) illired L Flickingor AF19 330 211, WM/USAF, is further asgd 22nd Maint qq, this Gp, for Dy OJT in SSN 955. PCA. No tvl involved. EDCS.1 BY ORDER OF COLONEL SC.RBOROUGH: CHARLES L BROOKS Capt, USAF OFFICIAL: adjutant bes CHARLES I, BROOKS Capt, USA.F Adjutant DISTRIBUTION tis & B X wife /2 ,919 HARLES fi OLC A E pm p- 30 Wosh Subj: Age Waiver 3 August 1949 201-MCGEE, Charles E. (o) PP 201-MCGEE, Charles E. (o) 1st Ind JRS/hc HEADQUARTERS, 2260TH AIR BASE SQUADRON, LOCKBOURNE AIR FORCE BASE, Columbus 17, Ohio. 8 August 1949 TO: Captain Charles E. McGee 2260th Air Base Squadron Lockbourne Air Force Base Columbus 17, Ohio For your information and guidance. US R SAVAGE lst Lt., USAF Asst Adjutant HILADQUART.RRS 22ND BOMBARDMENT WING (M) March Air Force Base, Califirnia STECIAL ORDER 19 December 1949 NUMBER 130 E X T R A C A C T 1. 2D LT 4823 CHESTER E. MCCOLLOUGH JR 19728A, (Basic & Dy A/S AF) (Comp USAF) (Non rated, not on status) (YOB: 1922) is reld fr asgmt & dy .71st Ftr Sq, lst Ftr Gp this sta and asgd to 3820th Air Univ Ug Tyndall AFB, Fla, rptg not earlier than 3 Jan 1950 and NLT 1500 hrs 5 Jan 1950, for the purpose of attending Air Tactical Sch. Off possesses tempor- ary clearance for access to classified material up to and including Confident- ial, Off WI o/a 25 Dec 1949 for New Orgn & sta. 2 Jan I CS ICA TIA TEN A 5704500 060-205 S99-999 AUTH: Ltr Hq, USAF, file 6FTMF-1-E-3, \"Regular Second Lt\" dtd 21 Nov 1949. 2. The fol named Offs TMM/USAF March Flt Sv Center this sta WI o/a 19 Dec 1949 on TDY for approx 16 wks to Tyndall AFB, Fla., for the purpose of att Air act-Sch, class commencing 6 Jan 1950. Upon compl of crse, unless sooner relieved, officers will return to proper orgn this sta. Officers-will rpt not earlier than 3 Jan 50 and not NLT 5 Jan 50. Officers have bee granted temporary clearances in accord/w AFR 205-6, pending compl of a national agency check. Trovisions of Aph 60-13 complied with, Delay en route of 7 days prior to. rptg to sch is auth not to interfere with rptg date. AUTH: AFR 35-59 and Ltr Hq Flt Sv, Vashington D.C. dtd 7 Dec 49, subj: Air Tact Sch. CAFT 2159 RALPH M. OLSON, AO-659 754 CAFT 2159 NOEL E. TURNER, A0-725 010 TFA and/or TBM/ is auth. (Request LS-693 CIPAP TDN A 5704500 065-1475 1552-02 S04-151 3. T Sgt 955 Eugene I . Reeder, AF35 791 822, 19th Bomb Sq, 22nd Bomb Gp (M) this sta (DOS: 29 Sepp FSC as of 31 May 49) is trfd in gr to 3700th AF Indoctrination Wg, OCS, Lackland AFB, San Antonio, Texas for asgmt to AF OCS Class 1950-A, class starting Jan 50. EM WI` rptg to CO thereat not earlier than 0800 3 Jan 50, and not later than 1600 4 Jan 50. EM will be paid in full prior to departure fr this sta. Servi~ Recrods and allied papers will accompany EM to new sta. Delay en route agth not to interfere EUCSA: Jan this sta will pay adv three- cents per mile in lieu of T fr March AFB, Calif to San Antonio Texas. and mon alws in liau of rats for two (2) days. Upon compl of tvl commutation value of the garrison rat is pay- able for excess auth t ime over that required by surface common carrier. AUTH AFR 173-5 as amended. FCS I Ch TPA TDN A 5704500 060-205. 535-02-03-07-699-999 AUTH: Msg Hq, 15th AF IDCAS 182 dtd 13 Dec 49. 4. CAIT 4823 CHARLTS E. MCGEE, AO-807 103, W!5/USAF Eq 22nd M&S Gp this sta is aptd Base UR Control Officer (Add dy) vice CATT 4823 JOSEI H T. LEMONS, RELD. Eff 8 Dec 1949. Confirming VOCO. AUTH: SAC REG 66-12 HQ 22ND BO!MBARDMENT TING MARCH AFB, CALIF SO 130 dtd 19 Dec 1949 (Contd) 5. lvt 521 George E. Thomas AF19 339 880; WM/USAF (DOS: Dec. 51) (No FSC) 22nd Ar Sq, 22nd AB Gp this sta is trfd ingr to Hq 22nd M&S Gp this sta. (For dy in Career Fld Transportation-60) TCA. No tvl involved, FDCSA: Dec 6. If 405 Leon F. Tallon AF12 309 760, WM/USAF (DOS: Jan 51) (No FSC) 22nd Med Gp this sta is trfd in gr to Hq & Hq Sq, 22nd AB Gp this sta. CA. No tvl involved. EDCSA: Des 7. T 409 Richard C: Ialmer AF6 248 696 TM/USIF (DOS: Jul 50)(20 FSC as of Aug 22nd Sq, 22nd AB Gp this sta is trfd in gr to 22nd Med Gp this sta. I`CA. tvl involved. EDCSA: Dec 8. fc 747V Vernon W. Standiford AF16 281 061 TMM/USAF (DOS: Feb 51-) (No FSC) 22nd Instls Sq, 22nd I.B Gp this sta is trfd in gr to Hq & Hq Sq, lst AB Gp this sta. ICA. No tvl involved. INDSA: Dec 9. SMOI 5 SO 122 this Hq, dtd 8 De'c 49 as reads: \"Sgt 237 Roy F. Guffe; Jr, LF13 180 043, MM/USAF is AMENDED to read: `! Sgt 237. Roy F. Guffey Jr, AF13 180 043, If (Re: Trf of EM fr Hq & Hq Sq, 22nd /B Gp to Hq & Hq Sq, 1st hB Gp). 10. SMOI 2 SO 126, this Hq, dtd 13 Dec 49 as reads: \"**Sgt 409 James R. Knight AF14 264 445; 22d Medical Gp\", is AMENDED to read? 409 James Re Knight AF14 264 445, 1st Medical (Re: Trf of EM fr 1st Med Gp to 2349th AFORD Hamilton AFB, Calif for asgmt to project ALA 0116). 11. SMOI 26 SO 128, this Hq, dtd 15 Dec 1949, as reads: \"EDCSA: 29 Dec is AMENDED to \"EDCSA: 2 (Re: Trf of M' 747D AF6 150 100 Hq & Hq 'qq; 22nd AB Gp (f/L-AIR CND DET) this sta to Hq & Sq, 550th Guided Missles Eglin Fla, w/pers dy sta Hq 550th Guided WIg Det NANTC, Doint Calif.) BY ORDER OF COLONISL LLE: OFFICIAL: CHARLES S MANGAN Major, USAF Adjutant DISTRIBUTION: 25 ea I ar 1 10 ea lar 2, 4, 5, 6, 7, 8, 9, 10, 11 20 ea lar 3 HEADQUARTERS 22ND BOMBARDMENT WING (M) March Air Force Base, California SPECIAL ORDER 5 December 1949 NUNBER 119 EXTRACT R H 15. M Sgt 631 Henry A Buller AF6 914 090 WM/USAF (DOS Nov 52) (48 FSC as of Apr 49) (VOL) (YOB 1920) (Non-flying) (QOS) Hq & Hq Sa 1st Ftr Wg this sta (SAC) is trfd in gr to 2349th AF ORD, Hamilton AFB, Calif, for asgmt to PROJECT ANC-DYKE (Jan) and further movement overseas. WP departing this sta o/a Dec 49 on reenl lv, to: 6 John St., Worcester, Mass. Upon compl of lv will rpt to CO AF ORD, Hamilton AFB, Calif, NLT 26 Jan 50. The fol will be accomplished prior to departure fr this sta: IMM will be immunized and equipped in accordance/w DA Pamphlet 29-11 May 47 as amended and A 35-10 (PCR) as anendod, Narking and banding of personal bagsage will be accomplished in accordance/w APM 35-10 (POR) as amended. EM will be screened in accordance/w AFR 35-39 5 Jul 49 and SAC Reg 39-2, 4 Apr 49 as amonded. Friends, relatives, pets, dependents will not accompany EM to AF ORD nor join him thereat. 0/s shipment of privately owned veh is auth under the provisions of AFL 75-43, 4 Apr 48 as amended. The additional time and cost incident to delivery of veh to proper port must be borne at personal time and expense. S/R and AP will be forwarded SO as to' reach AF ORD not less than seventy-two (72) hours prior to rptg date of EM, Civilian clothing will not be worn not taken to TFF ORD , Mailing address: Grade, first name, MI, last name, i:ESN, Casual AF Post Office, POE, Hamilton AFB, Hamilton, California. EM will remain atchd to present orgn pending departure for AF ORD. EDCSA: 25 1950. In accordance/w par 56 AFR 173-5 the ID this sta will pay in adv the prescribed mon alws in lieu of T a/r of five (05c) cents per mile fr March AFB, Calif, to Worcester, Mass., and fr Worcester, Mass.. to Hamilton AFB, California. PC3 PCA TDN 5704500 060-204 P 534-02-03-04-07 S99-999. is 5704500 060-209 P 538-02 399-999. AUTH: AFR 35-59 as amended, Ltr Hq' 15th AF, file 220.3, subj: Mandatory Overseas Projects\", dtd 15 Nov 49. 16. Par 10 SO 117 this Hq dtd 2 Dec 49 is RESCINDED (Re: Reasgmt of CAPT 2159 CHARLES E MCGEE A0-807 103 Hq & Hq Sq 22nd AB Gp) 17 CAPT 2159 CHARLES E MCGEE A0-807 103 NM/USAF, (Comp USAFR) (AFGS 1 Dec (Basic & Dy H/S-AF) (Pilot on flying status) (11 NSC as of Sep 45) is reld fr asgmt and d y Hq & Hq Sq 22nd AB Gp this sta and is asgd to Hq 22nd M & $ Gp this sta for dy. PCA No tvl involved. 18. CH (CAPT) 5310 JOHN F FULFORD 0-550 473 WM/USAF, Hq & Hq Sq 1st Ftr: Wg this sta WP o/a *Dec 49 on DS for approx ten (10) days Ir March AFB, Calif, to Ocpnomowoc, Wisc, for the purpose of attending Religious Retreat at Redemptorist Fathers Seminary. Upon compl of DS Off is auth fourteen (14) days ordinary lv, to be spent at 1107 Campbell hive. Detroit, Michigan. Upon compl of lv Off will rpt to CO Hq & Hq Sq 1st Ftr Wg this station Tvl will be at no expense to the Government. AUTH: AFR 1,65-3, AR 60,0-115, and AR 210-10. HQ 22ND BOMB WG (M), M/RRCH AFB, CALIF, SO 119 dtd 5 Dec 49. 19. CAPT 2110 EDWARD J WEBBER A0-562 299 UM/USAF, Hq & He Sq 1st 4B Gp this sta WP o/a 'Dec 49 on TDY for approx two (2) days fr March AFB, Calif, to Offutt AFB, Omaha, Nebr., for the purpose of interview relative to possible reasemt to Hq SAC, dy w/Materiel Directorate. Off to rpt to Officers Branch, D/Pers, Rm 129, Bldg D, w/DA:A . Form 66, upon arrival. Upon compl of TDY Off will return to proper orgn this sta., TBMA is directed w/cmerg prov for use of common carrier and/or commercial acft. TDN A 5704500 067-1820 P 821-02 '25-010. AUTH: Msg Hq SAC, file DP2B 1861, dtd 28 Nov 49 and Msg Hq 15th AF, filc PDCPO, 210, dtd 29 Nov 49. 20. Exigencies of the SV having prevented the issuance of written orders in adv the VOCO 1 Doc 49 directing the fol named Off TM/USAF, orgn's indicated this sta to proceed on TDY for approx three (3) days f'r March AFB, Calif, to Spokane AFB, Bong, Wash, for the purpose of coording- ting Maintenance Control matters and upon compl of TDY Off will return: to proper orgn this sta is hereby confirmed and made a matter of record. COL 1013 :ILLIAM L LEE 430-1 Hq & Hq Sq 22nd Bomb Wg LT COL 4010 RiY M hawLey 2105 1 Hq & Hq Sq 22nd Bomb Wg MAJ 4010 MIX Ty HENNEY .922.9A Hq & Hq Sq 22nd Bomb Wg CAPT 4593 WHITMAN R PEEK 40-660 798- Hq & Hq Sq 22nd Bomb We CAPT 4902 ROY P NRIGHT A0-573 831 Hq & He Sq 1st Ftr Wg CAPT 4823 JOSSIPH R LEMONS 6384-1 Hq 22nd M & S Gp CAPT 4823 JOSEPH R DONAHUE JR A0-812 775 Hq 1st Ftr Gin 1ST LT 4823 ELDRED V SCOTT A0-518 526 Hq 1st Ftr Gp 1ST LT 4821 JOHN C RAYMER 15 3101 22nd Maint Sq, BM, 22nd M & S Gp 1ST LT 1024 WILLIAM D HATCHER A0-1 998 946 Hq 22nd M & S Gp TBMA is directed. (R-364) TDN A 5704400 067-1440 P 442-02 S04-151. AUTH: VOCG 15th AF. BY ORDER OF COLONEL LEE: OFTICIAL: CHARLES S MANG/N Maj, USAF Adjutant WOJG, USAF Asst Adjutant DISTRIBUTION: 20 ea par 15 10 ea par 16, 17, 18, 19 5 ea par 20 22ND BOMBARDMENT WING (M) March Air Force Base, California SILCIAL ORDER 2 December 1949 NUMBLR 117 X T R A C T 6. The fol named EM t.M/USi.F (except as indicated) status indicated, Hq & Hq Sq, 22nd AB Gp are trfd in gr to orgn indicated this sta. CA. No tvl involved. EDCSA: 5 Dec TRFD TO: & 22nd Bomb Sgt 622 Norman L. Miller, AF19311840 (DOS: 0ct 50) (No FSC) (YOB: 1928) TRFD TO: 22nd Medical Cpl 657 Carl E. Clement, AF37 347 075 (DOS: Nov 50)(3 FSC as of Apr 45) (YOBs 1924). TRFD TO: lst M&S 1st M&S Cpl 821 Charles C. Cramer, AF16 041 873 (DOS: Aug 51)(46 FSC as of May 49) (YOB: 1921) Ifc 345 !alter McElvenny AF13 282 233 (DOS: Jul 51) (No FSC) (YOB: 1930) Cpl 550 Hueston T. McClelland, i.F19 292 987 (DOS: fug 50) (No FSC) (YOB: 1929) M&S Sgt 684A Clifford E. Reed Jr, AF17 192 270 (DOS: Aug 2)(33 FSC as of May 49.) (YOB: 1929). TRFD TO: 1st Ftr Gn; T Sgt 542 Alfred N. Cummings, AF16 001 037 (DOS: Sep 51) (57 FSC as of Aug 48) (YOB: 1919). Sgt 060 Joel W. Walters: AF33 125 398 (DOS: Jul 50) (7 (7 FSC as of Cct 45)(YoB: 1918). S. Sgt 060 otto J. Frank, AF38 111 368 (DOS: Apr 52) 52)(36 (36 FSC as of Jul 48) (YOB: 1914). \"Sgt 060 Rufus E. Turner, AF38 086 635 (DOS: Mar 54)(7 FSC as of Nov 43) (YOB: 1907) Sgt 060 Allen R. Laubenspeck, AF6 377 355 (DOS: Feb 52).31 FSC as of Nov 48) (YOB: 1905) S Sgt 060 Cyril 0. Milliams, 6F36 894 804 (DOS: Indef) (42 FSC as of Mar 49) (YOB: 1908) HQ 22ND BOMB IVG MARCH AFB, CALIF SO 117 dtd 2 Dec 49 (Contd). 7. 1ST LT 1034 CARL HANSEN h0-718 301 tMM/USAF (Comp USAFR) (Basic & Dy A/S-AF) (Nav on flying status)( (7 FSC as of 12 Jan 45) having been asgd this sta per par 1 SO 213 Hq, 1100th USAF Spec Rptg Gp, Sandia AFB, Albuquerque NM, dtd 17 Nov 49, is further sgd to Hq & Hq Sq, 22nd AB Gp this sta. I`CA. No tvl involved. EDCSA: 26 Nov 8. 1ST LT 1024 DALE L. SAMUELSON 60-699 865 UM/USAF (Comp USAFR) (Basic & Dy A/S-AF) illot on flying status) (f FSS 1 Feb 52)(i1 FSC as of 4 Jul 45) is reld fr asgmt & dy Hq & Hq Sq, 22nd AB:Gp this and asgd to 22nd Comm Sq, 22nd AB Gp this sta. I Ch. No tvl involved. EDCSA: Dec 9. CAIT 1059 LOUIS A. GREEN 9468A TM/USAF (Comp USAF) (rilot on flying status) (39 FSC as of Oct 49) is reld fr asgmt and dy Hq & Hq Sq, 22nd AB Gp this sta and asgd to Hq, lst Ftr Gp this sta for dy. CA. No tvl involved. 103 NM/USAF (Comp USAFR) (AFSS 1 Dec 51)(Basic & Dy A/S-AF) `)(Filot on flying status; (11 FSC as of Sep 45) is reld fr asgrit and dy Hq & Hq Sq, 22nd AB Gp this sta for dy. ICA. No tvl involved. EDCSA: Dec 11. Sgt 677 THara, AF39 726 468, MM/US!F (DOS: Dec 51) (24 FSC as of Nov 47) (YOB: 1925) 22nd AT Sq, 22nd AB Gp this sta is trfd in gr to 1st AP Sq; lst AB Gp this sta. ICh. No tvl involved. Dec 12. S Sgt 677 Villiam A. Daugherty Jr, F19 332 629 IMM/USAF Hq & Hq Sq 22nd Bomb Wg (M) this sta is granted thirty (30) days (Ordinary) lv eff o/a 5 Dec 49. Address while on lv: Apt 88 Clark Court, Riverside, Calif. Upon compl of lv EM will rpt to CO Hq & Hq Sq, 22nd Bomb Wg (ir) this.sta. 13. Sgt 070 Henry T. Harber AF12 339 615 (TMM/USAF HG & Hg Sq, lst Ftr Wg this sta. is granted twenty-six (26) days (Ordinary) Jv eff o/a 19 Dec 49. Address while on lv: 1137 Lowell St., Camden New Jersey. Upon compl of lv E will rpt to CO Hq & Hq Sq, lst Ftr Wg. BY ORDER OF COLONEL LEE: CHARIES S MANGAN Najor, USAF I.djutant WOJG, USAF Asst Adjutant DISTRIBUTION's 1ST FIGHTER WING Air Force Base, California OFFICERS INCOMING PROCESSING CHECK SHEET Date 28 Nov mb r NAME RANK ASN A0-807 103 MOS 2159 Rptd this Sta 26 Nov Per Par 5 SO 216 Hq 301st Bomb SHAFB Dated Oct When you have signed the Officers' register outside of the Wing Adjutant's Office, please proceed to the building listed below and accomplish each of the actions indicated, having each item initialed by the authorized officer or NCO. 1. 1ST FI WING HEADQUARTERS 506 a. Report your arrival to Wing Adjutant b. Make appointment for official call on Wing Commander. (Field Grade Officers only) c. Obtain Wing Regulations for required reading. (AG Library - Bldg T-FOD 506 d. Fill out MAFB locator card. (Bldg T-BOI 506 2. 1ST AIR B SS GRO P PERSONNEL SECTION (Bldg T- 505 a. Fill out March AFB Project Card. b. Report to S-1 for interview and assignment, c. History and Mission of USAF. SAC, 15th F and 1st Fighter Wing. (Bldg T-4dd) 505 d. Military discipline and customs of the service. 3. ARMY POSTAL SERVICE (side entranc ) a. Arrange for mail delivery. 4. PROVOST MARSHAL T-2000) a. Register automobile, firearms, cameras, etc. b. Check AGO Identification Card. (Bldg 503) c. Loyalty Investigation Check (Bldg T-535. 503 MAFB Form 35-3 (Rev 16 Jun 49) Ref Wg Reg 35-3 5. FLIGHT SURGEON a. Turn in Medical records and undergo physical exam. 6. MARCH AFB FINANCE OFFICE AFB BILLETING OFFICE a i Arrange for EOQ. Married officer are asgd: CingAdjutant when available. - Club and for wife's membership in MAFB Women's Club. OFFICERS 9. RECORDS CARRICDE BY OFFICER: a. Turn in Form 66, - 201-file ,nnd allig/ paporis to Orgn A-1 or S-1 to which you are a$signed. Bldg MSgt Roth B. Turn in Form 5 ( Rated Officers only) to the Operations section which will serve your orrgan. 10. Upon completion of above, please return this foorm to the Officers Section of lst-Ai Base Group ( - 503 n1. Upon assignment to a new organization, make yowr official call on the Group Commander and Squadron or Detachment Commander. It is also suggested that you call on the Wing Chaplin at his of the Base: Chapel. 12. AF Aid Society and Personal Affairs (Bldg T-462) Asgd Hq & Hq Sq 22d AB Gp re Par 16 SO 89 Hq 22d AB Gp 14 Nov 49 This SO is for delivery to referred to in par HEADOUARTERS 22D AIR BASE GROUP March Air Force ase,California SPECIAL ORDERS 14 November 1949 NUMBER 89 1. Sgt 1383 Abran S Anaya. AF39 443 530, WM/USAF, 22d Instls Sq (.SM), 22d AB Gp, this sta, having reenl in the AF 9 Nov 49 for a period of five (5) years is auth thirty (30) days reenlmt lv eff o/a 11 NOU 49 & WP to 3744 E lst Ave, Springfield, Mass. Upon compl of lv Amn will rpt to CO 22d Instls Sq (BM), 22d AB Gp this sta. In accordance w/par 56 FR 173-5 the FD this sta will pay in adv the prescribed mon alws in lieu of T a/r of five ($0.05) cents per mile fr March AF Bass, Calif to Springfield, Mass and f'r Springfield, Mass to March AF Base, Calif. TDAT 570#500 060-209 P 5 28-02 S99-999. AUTH: {R 600-115 2, A FR 39-9/49. 2. SMOP 6 SO 86 Hq 22d Gp, c s as reads, \"THJ BYRON H. LYTLE AO 140 690, 22d Instls Sq\", is amended to raad, \"MAJ BYRON H LYTLE HO 140 690, Hg & Hg Sq\". (Re: Deletion of PMOS). 3. SMOP 7 SO 8 6 Hq 22d Gp, cs, as reads \"MAJ BYRON H. LYTTLE 610 140 690 WM/USAF, 22d Instls Sq\", is amended to read, BYRON H 10 140 690 Hq 8 Hq Sq... (Re: Award 8 designation of PMOS). 4. S Sgt 824 Philip S Kelly, 052 8 26, F, 22d Food Sv Sq, 22d '.B Gp, this sta, is auth to rat sep eff 5 Nov 49. AUTH: (:R 210-10: Confirming VOCO . 5. Sgt (SN Unk) Kenneth S Ra y , AF18 252 779, (DS Salton Sea Test Base, Westmoreland, Calif) Asgd Hq 2: Hq Sq, 3170 Sp Dev Gp, Kirtland AFB. N Mex is reld fr atchd Hq & Ha Sq, 22d 6.B Gp (PP) this sta. Alnn departed w/gds 5 Nov 49 to his proper orgn &: sta. AUTH: F LL 125-10 & AR 61 5-300. 6. T Sgt 766 Leslie M Thompson, AFL6 095 61 5, VM/US: F (AIR) enl 23 Jan 46 for five (5) years, 43 mos o/s SV as of 30 Jun 49, Non-flying, YOB 1917, is reld fr &sgd Hq & Hq Sq, 22d AB Gp Pers lwaiting this sta (S : C ) in gr to 22d Comm Sq (BM), 22d B Gp this sta. EDCS... 18 Nov 49. AUTH: 39-8, 14 Feb 49, ! F Form 136, rpt 35-49 Hq 22d B Gp, 30 hug 49, 6.F Alloc 30 Aug 49 2 TT PDCPE 452 Hq 15 A.F. 7. C.APT 7025 J.C.B F FULL ILOVE JR, 100 726 365, (Basic &: Dy '//S-USA.F) (Plt on fly status) FSS lJun 52) (28 FSC as of 8 Oct 40) (YOB 1921) heving been asgd this sta. fr 4107th Base S u Sq, Ent AFB, Colorado Springs, Colo, per par 13 SO 203 Hq 15th AF d td 4 NOU 49 &: as amendnd by par 8 SO 204 ljq 15th A.F dtd 5 Nov 49 is further asgd to Hq Hq Sq, 22d A G p this sta. PCA. No tvl involved. HC, 22D AB GP, M/RRH AFB, CALIF., SO 89, 14 NOU 49. 8. CAPT 9100 J/CC RJ. FSHOON , 110 73 042, WM/US:FF, (Basic & Dy n/s- US./.F) (Comp-ushFF) (Non-rated, not on fly status) (AFSS 1 May 52) (29 FSC as of 5 Aug 47) (YOE 1903) having been asgd this sta per par 8 SO 203 Hq 15th ..F, Ent A.F Base, Colorado Springs, Colo, d td 4 Nov 49 is further asgd to Hq & Hq Sq, 22d AB Gp this sta. FCA:. No tvl involved. EDCSA: 12 Nou 49. 9. Pvt (SSN Unk) William J Hart, AF18 099 587, WM/USAF, Sq \"p\". 3906 A/FBU, Sheppard AFB, Tex is atchd Hq & Hq Sq, 22d hB Gp (PP) this sta. limn since 12 May 46 app by civ auth a t Fresno, Calif, 1345, 8 Nov 49. Ret to mil contl this sta and conf 21 30, 8 Nov 49 pending dispo- sition of AWOL chgs. AUTH: AF 125-10 & AR 61 5-300. 10. Pfc (SSN Unk) James P Barker, AF19 340 835, 3327 Tng Sq, Scott :FF, Ill, is e tchd Hq &: Hq Sq 22d AB Gp (PP) this sta. fimn AWOL since 2 Sep 49 app by hir Police at Long Beach, Calif, 0930, 8 Nov 49. Ret to mil contl at 2347 2347th AFRTC, Long Beach Apt, Calif, 8 Nov 49. Trfd &: conf this sta 1340, 8 Nov 49. AUTH: AFL 1 25-10 &: '.R 61 5-300. 11. M Sgt Robert B McEnery, AF12 014 102, V!M/USAF, Hq &: Hq Sq, 22d hB Gp this sta is auth to r~t sep eff 1 0ct 49. AUTH AR 210-10. Confirm- ing VOCO. 12, 1ST LT 1024 HARRY E WIGHT, 60 802 010, WM/US/F (Basic & Dy (//s- US / F) (Comp US :FR) (Pilot on fly sta.tus) (AFSS 29 Fe b 52) (11 FSC as of 18 Sep 44) (YOB 1922) having been asgd this sta fr Det \"B\", Hq &: Hq Sq, 1100th USA.F Sp Rptg Gp, Sandia Base, Albuquerque, N Mex., per par 1 SO 204 same sta d td 3 Nou 49 is furtherrasgd Hq & Hg Sq, 22d AB Gp this stc. PCA. T o tvl involved. EDCS/. 12 Nov 49. 13. MAJ 1051 L FRED E B/JUCOM,AO 786 648, WM/US/.F, (Brsic & Dy ^/S- USAF) (Comp USA FR) (Pilot on fly status) (AFSS-31 Jan 52) (16 FSC as of 6 Sep 44) (YOB 1919) having been asgd this sta fr Det \"B\", Hq &: Hq Sq, 1100th USA.F Sp Rpts Gp, Sandia Boss, Albuquerque, N Mex., per par 1 SO 204 same sta dtd 3 Nou 49 is further asgd Hq &: Hq Sq, 22d AB Gp this sta. PCH. No tvl involved. EDCS : 12 Nov 49. 14. MAJ 7576.CECIL L FOL MAR AO 280 839, :M/USAF (Comp USU.FR) (.F FSS 1 Jun 51) (Basic & y:A/S-AF) (Comd Plt on fly status) (YOB 1907) having been asgd this sta per par 3'SO 216 Hq 301st Bomb V.g , Smoky Hill AFB, Salina, Kan, dtd 31 Oct 49, is further asgd to Hq &. Hq Sq, 22d AB Gp this sta. FCA. No tvl involved. EDCS: 9 Nou 49. 15. 1ST LT 6302 MARTIN D FISHEL, AO 715 755, VIM/USAF, (Comp US : FR) (AFSS 1 Jul 52) (Besic &: Dy A/S-AF) (Pilot on fly status) (10 FSC as of 15 May 45) (YOB 1921) having been asgd this sta par 3 SO 216 Hq 301st Bomb Wg, Smoky Hill AFB, Saling, Kan, dtd 31 0ct 49, is further asgd to Hq &: Hq Sq, 22d .BB Gp this sta. PCh. No tvl involved. EDCS.: 9 NOU 49. HQ., 22D AB GP, MARCH AFB, CALIF., SO 89, 14 NOV 49. 16 CAPT 21 5 RLES E MCGEE, 40 807 103, KM/US (Comp FR) 1 Dec ) Basic &; Dy A/S-AF) (Pilot on status (11 FSC as of Sep 45) (YO3 1919) hnving been asgd this sta per par 5 SO 216 Hq 301st Bomb Ng, Smoky Hill AFB, Salina, Ken, d td 31 Oct 49 is further asgd Hq & Hq Sq, 22d AB Gp this sta. PC.1. No tvl involved 9 Nov 49. 17. 1ST LT 6201 RARVEY H NEWTON , '0 2 015 576, WE/USA F (Comp (HFSS 1 May 52) (Basic & Dy A/S-:F) (Non-rated, not on fly status (35 FSC as of 2 Oct 45) (YOB 1918) having been asgd this sta per par 12 SO 203 Hq 15th AF, Ent AFB, Colorado Springs, Colo, dtd 4 Nov 49 is further asgd to Hq & Hq Sq, 22d AB Gp this sta. No tvl involved. EDCSA: 16 lov 49. 18. Par 14 SO 88 this Hq, cs, is ReVOKED. (Re ; Trans of Pfc 213 Charles R Kuzmic, .F19 346 509). 19. In accordance w/par 42, 6R 210-10, termination of grs in the BOQ for the fol officers is made, eff dates indicated Confirming VOCO. RANK NAME A BLDG ROOM EFF DATE CAPT JACK H HILL 196421 103 38 30 Sep 49 CAPT E JOHNSON 40 1 28 3 781 101 46 11 Oct 49 CAPT ARTHUR E KILLIAN AO 670 090 109 23 10 Oct 49 CAPT WAYNE MAKI AO 807 010 665 2 28 Oct 49 CAPT RO BERT A NORVELL AO 777 78 2 103 43 28 Oct 49 CAPT STINLEY G OSKAMP AO 563 968 109 39 31 Oct 49 1ST LT JAMES M CHENAULT 818 600 101 20 Sep 49 1ST LT WILL AAM D FISHER 7 68 051 109 25 Oct 49 1ST LT AL BERT S HALL 100 205 7503 103 15 31 Oct 49 1ST LT WILLIAM J LANZER AO 931 188 101 438:45 Il Oct 49 1ST LT DIN IEL M LEININGER 027992 103 22824 23 Sep 49 1ST LT AN THON Y T LINKIEWICZ 1:0 759 034 100 19 27 Oct 49 LT (JG) BED FORD SHELMIRE JR 408451 43 30 Sep 49 1ST LT KEITH E SIMS 732 386 100 15 26 Sep 49 1ST LT DONALD W VOLLETT 551 62 101 23 9 Sep 49 2D LT WILLIAM J BENKE .10 903 052 109 32 28 Sep 49 2D LT RO BERT E BORDEN 903 186 101 22 30 Sep 49 2D LT FLOYD H CLAYTON 1 903 003 111 22 17 Sep 49 2D LT LAVERNE H GRIFFIN AO 1 903 208 101 17&19 30 Sep 49 2D LT ARTHUR E HAVN 10 1 903 211 101 40642 14 Oct 49 2D LT GECRGE E KEVIL 1 903 217 101 28 14 Oct 49 2D J.T JOHN R Mc FARLAND 410 1 852 648 103 11 22 Sep 49 2D LT RO BERT S McCORMICK AO 1 903 229 101 26 31 Oct 49 2D LT RO BERT F C TONDO AO 1 908 947 665 33 20 Oct 49 20 LT VICTOR is RAL ON 40 1`908 733 103 23 23 Sep 2D LT JOHN R TULLY AO 1:908 973 665 37 18 Oct 49 2D LT ALVIS G UPCHURCH 40 1 908 604 109 43 8 Sep 49 HQ., 22D AB GP, MIRCH hFB, CAL IF., SO 89, 14 NOV 49. 20. In accordance w/par 42, GR 210-10, termination of grs (SHELTER ONLY) in the BOC for the fol officers is made, eff dates indicated, Confirming VOCO. RANK NAME AFSN BLDG ROCM EFF DATES MAJOR WILL LAM H hass AO 485 1 68 111 20 31 Oct 49 CHRISTIAN C LUTZ 01105633 111 9 6 Oct 49 NHJOR GEORGE H MELLIN AO 412 218 109 40 8 Oct 49 CAPT DON/LLD h BALLARD 0975291 111 13 3 Oct 49 CAFT FREDERICK B BEAM 10 429 903 103 35 1 Nov 49 CAPT ELDON N COL BY AO 740 749 665 11 18 Oct 49 CAPT h B COPPENS AO 1 638 8 67 111 36 30 Sep 49 CAPT CH'RLES W DUNGAN AO 763 1 20 665 54 19 Oct 49 CAPT LLOYD B ELDER AO 915 48 2 111 40 19 Oct 49 CAPT JAMES W HADMOT AO 666 932 665 16 22 Oct 49 CAPT LLOYD J HARTER HO 1 635 976 665 9 28 Oct 49 CAPT JCHN M MAGIDA AO 479 690 109 42 8 Oct 49 CAPT RO BERT E PECKHAM no 730 161 665 2 7 Oct 49 CAPT SAMUEL PESACRETA 14281A 109 42 23 Sep 49 CAPT HOWARD C STAGNER AO 548 245 665 3 4 Oct 49 CAPT RO BERT F THYLOR 11559A 109 36 8 Sep 49 CAPT ZENNETH D AO 579 348 103 37 22 Sep 49 CAPT JOHN. WYATT 573 8 37 111 20 7 Sep 49 1ST LT JOHN C ANDERSON AO 2.094 777 103 5 16 Sep 49 1ST LT JACK R DAVIS 0110860 109 7 15 Sep 49 1ST LT WALLACE R DONALDSON AO 2 0 24 014 111 33 20 Sep 49 1ST LT ROBERT D DOWDY AO 708 422 111 25 7 Sep. 49 1ST LT R&L PH T DOYLE AO 58 5 478 665 29 17 Oct 49 1ST LT FRANK W DURKEE 10 2 099 670 109 21 15 Sep 49 IST LT GEORGE T GEARHART AO 740 785 111 36 19 Oct 49 1ST LT WILL IAM V HOLLAND AO 741 785 111 36 12 Sep 49 1ST LT RICHARD H HOYT no 733 895 665 53 14 Oct 49 1ST LT JOSEPH H MITCHELL 1798811 665 41 18 Oct 49 1ST LT M A PRUETT ho 681 188 665 13 19 Oct 49 1ST LT ERNEST P ROOKHUYZEN 01 551 507 109 29 26 Sep 49 1ST LT WILLIAM J SHARPE 17614A 665 18 12 Oct 49 1ST LT ERNEST W SIMS AO 678 342 111 30 2 Sep 49 1ST I.T WILLIAM B 103 37 21 Oct 49 1ST LT WILLIAM K THOMASSET 0?79443 665 24 14 Sep 49 1ST LT NANUEL h TORRES AO 717 920 111 1 31 Oct 49: 1ST LT GORDON L TURNER .10 2 068 801 665 7 27 Sep 49 2D LT LEWIS S COLWELL HO 1 846 67 2 109 23 9 Sep 49 2D LT LESTER W KRUSHAT 110 1 908 557 665 32 18 Oct 49 2D LT DONALD T LYNCH A0 1 908 566 665 31 20 Oct 49 2D LT CHARLES 0 RIESTER AO 1 908 588 109 40 23 Sep 49 2D LT RO BERT E SIZEMORE 665 35 22 Oct 49 2D LT N WAHL 400 2 067 043 665 15 21 Oct 49 HO , 22D AB GP, MARCH AF3, CALIF., SO 89, 14 NOV 49. BY ORDER OF COLONEL MARION: OFFICIAL: THEODORE S CO BERLY Captain, USAF Adjutant THEODORE S CO BERR Y Captain, USAF hdjutant DISTRIBUTION \"/\" SLOOKY HILL AIR FORCE BASE Salina, Kansas OFFICER'S IFICATE OF CLEARANCE I report my departure (Print Name) (Rank & AFSN) This is to certify that the above named Officer (ulis NOT) assigned public quarters to SHAFB FORI 35-4 (15 July 1949) SPECIAL ORDERS ) 301ST BOMB.1RDi.ENT WING (M) 217 ) Smo!cy Hill Air Force Base Salina, Kansas, 1 November 1949 I R C I SNOP 23 SO 216 this Hq c s (re: EM trf'd in gr to 4108t Base Sv Sq, SHAFB) as reads: \"301st Bomm Sq, 301s: Air Base Gp\", is amended to reads \"301st Comm Sq, 301st Air Base Gp.\" 25 SMOP 5 SO 216 this Hq cs (re: PCS, of Offs) as pertains to 131 LT (4823) LEO E SULLIVAN A0923831, FCS to 98th Bomb Wg, Spokane AFB, Bong, Jash, and CHPP (2159) CHIRLES E A0807103, PC 3 to 22nd Bomb March LFF, Calif, as reads: \"Reld fr Supply Sq, 301s: MAS Gp\", is amended to read: \"Reld fr Maint 301s t M&S Gp.\" 26. SMOP 17 SO 210 this Hq cs (re: PCS, of EM) as pertains to S SG T (911) LYLE R WILLIAMS, 1F15062429, 32nd Bcanb Sq, 301s Bomb Gp (M), PCS to 98th Bomb .Vg, Spokane L B, Bong, Wash, as \"JP o/a 26 Oct 49, Rptg date NLT 3 Nov 49\". is amended to read: o/a 5 date NLI 13 Nov 49.\" 27. SMOP 32 SO 213 this Hq OS (re: PCS, Off to issembly Sta, Scott AFB, Illinois) as reads: \"IST Lr (1024) .IILLI.LM 0 SCHENREE 10537496\", is amended to read: \"isr (1024) 0 23. SMOP 22 SO 210 this Hq OS (ro: FCS of EM) as portains to SG T (204) ROSCOE S BELL 1F44146576, 301st Supply Sq, 301st M&S Cp, FCS to 91st Statt Rcn ig, Barksdale AFB, La) as reads:. is amonded to read: 29. Par 1 SO 214 this Hq cs (re: PC.S, EM to Barksdale LFB, Louisiana) is amended to delete so much as pertains to S SG 1 (612) KENNETH HARDIN AF16163122, 352nd Bomb Sq, 301st Bomb Gp (i.). 30. SMOP 3 SC 214 this Hq c s (re: Offs & LM PCS to 1FB, La) as reads: \"lst (0142) E GORD ON A02068652, 352nd Bomb Sq, 301st Bomb Gip (M)\", is amended to read: '1ST Lf (0142) JIMESS E GORDON, JR A02068652, 352nd Bonb Sq, 301st Bomb Gp (M). 31. SMOP 29 SO 213 this Hq c s (re: PCS, Pors fr 301st Medical Gp to Barl:sdale La) as reads: 1ST L1 (1051) RCBERT J DESTICHE 10714004, Dy SSN 3327 S SGT (861) EDTHIRD J ELLINGTON, JR if14256630, Dy SSN 861 S SG T (825) LEO J REDHAIR 1F19202298, Dy SSN 325 SGT (067) CHIRLES E 1f37730935, Dy 3SN 067 CPL (055) DONLLLD E RILEY AF17248573, Dy SSN 003 CPL (859) ADOLPH J SZALCNY Dy 359 CPL (403) TONY R LODLE NFF7226001, Dy SSW 409 CPL (345) ALLEN B McCIULEY Dy SSN 34.5 PFC (657) CLIFFORD R HYDEN AF15409532, Dy SSH 657 PFC (055) JOHN R 1F12314625, Dy SSN 003 is to ead: 1ST LT (1051) ROBERT J DESTICHE 10714044, Dy SSN 3327 S SC: (861) M ELLING TON, JR 1F14256680, Dy SSN 861 S SGT (823) LEO L REDH.LIR 1F19202298, Dy SSN 825 SG T (067) CHLRLES E ORG 1N 61337130935, Dy SSN 067 CPL (055) DONLLD E RILEY Dy SSN 405 CPL (359) ADOLPH J SZALCNY lF16268197, Dy SSN 659 CPL (409) TONY R LOD LE Dy SSN 409 CPL (345) `LLEN B Dy SSN 345 PFC (657) CLIFFORD E HYDEN lFF15409532, Dy SSN 657 PFC (055) JOHN M Z.PP1RYNIUK 1F12314625, Dy SSN 405 32. SMOP 45 SO 214 this Hq cs (re: FCS, Offs fr Gp to 2d Medical Gp, 2d Bomb .ig, Chutham AFB, Georgia) as portains to 1S. LF (4490) RAY C PERNINS, JR 102046783 (MSC), as reads:, will remain on IDY for aprx 30 days w/4180th Base Sv Sq, this is amended to read: \"off will remain on TDY for aprx 30 days this sta. 33, The fol-named EM US.1., 352nd Bomb 3q, 301st Bcmb Gp (M), TPP to Bar!sdale Louisiana, Transfer effective 7 Nov 49. Personnel will remain on TDY at SH1FB, Salina, Kansas, rear echelon (& t9 4108th Base ST Sq, for grs, rats & supplies) & upon compl of official businedd. JPP o/a 5 Ncv 49 to Barksdale .FFB, Louisiana. EM auth 3 days tvl time, & will rpt upon arrival at Barksdale LIFB to CO proper orgne No delay en routo. UP AFR 173-5 & HP 35-4810 as amended, ID will pay in adv mon alws in -lieu of subs for 5 meals to ea EM, and a/r 3c per mile for tvl f'r this sta to, Barksdale AFB, Louisiana, where Govt trans is furn Upon compl of tvl paymont of the commutation value of the garrison rat icquired in excess off that required by carrior is auth. The trans of depondents, auth baggage, and shipment of houschold goods will b e in accordance w/existing regulations. TDN FCS PC11 TP1 TBILLY TC will furn nec trans. 570:500 060-208 P537-02 03,07 S 99.-999 .UUTH: lst Ind Hq 15A1 370.5 (6 Oct 49) on Ltr Hq S.CC 370.5 (30 Sep 49) subj: Movement Orders, 301st BombardmentWing Modium, S SG: (612) INENNITH WJ HIRDIN Dy SSN 612, Sta tus Present CPL (6341) ROBERT E wilR 1F17209119, Dy SSN 6341, Status Prescnt 34n SMOP 12 SO 212 this Hq CS (re: PCS, 1S: L (6201) BOONE 177034, Hq & Hq Sq, 301st Bomb Ng (Mi) to 92nd Bomb Mg, Spolcanc .1FB, Bong, Wash) as reads; \":VP fr this ta o/a 3 Nov 494, an ] will rpt NLT 11 Dec 49, and 3 Novembor 1949\", is omended to road: 20 20 1949. 35, SMOP 1 SO 214 this Hq cs (re: FCS, to Barksdalc HIBB, La) as reads: S SG:i (911) JOSEPH R ROSS Dy SSN 352:nd Bomb Sq, 301st Bm Gp (N) CPL (911) ERWIN G MLITHYS 11117239850, Dy SSN 612, 352 nd Bomb Sq, 301s: Bm Gp(11) is amondod to read S SGI (911) JOSEPHI R ROSS ef14049155, Dy SSN oJf 612, 352nd Bm Sq, 301s t Bm Gp CPL (911) ERWIN G MATHYS 1F17239850, Dy 612, 352nd Bm Sq, Bin Gp BY ORDER OF CCLONEL USILF idjutant 5 to Comun par 24 5 oa off par 25 (.to Maint Sq) 10 EM pai 26 ( to 32nd Bm Sq) 5 CC, 93th Bomb Ig, Spol:ane AFB, Bong, Wash, jo.r 26 5 off par 27 ( to Casual Sq) 5 CO, Assembly Sto, Scctt 1FB, Ill, por 27 5 len par 28 ( to Supply Sq) 2 CO, 91st Strat Rcn ig, Barksdalo. La, par 28 10 ca C &: par 29 &: 30 to 352nd Bin Sq) 10 a 0 2 EI par 31 & 32 ( to 301st Med Gp) 15 0a EM par 33 (to 352nd Em 3q) 5 CO, Barksdalc .FF, In, par 33 15 Off par 34 (to Hq &; Hq So, 301st Em ig) 5 CO, 92nd Bm Spokane .I'B, Bong, Wash, par 34 3 .ig Class (for Offs 201 fill)) par 34 5 0a EM par 35 ( to 352n:1 Bm Sq) SPECIAL ORDERS 30131 TING (Ni) 216 ) Smoly Hill Hir Forco Baso Salina, Kansas, 31 Gctobor 1949 * 3. The fol-named Cffs (.i), Hq & liq Sq, 301st Bomb ig this- SHAFB, Salina, Kansas are rold fr dy &: asgint that crgn &: roasgd to orgn & stas indicatod. Dclay on routc auth as indicatod, chargoablo as lv. Offs JP fr this sta o/a dates indicatod, rntg da tos as indicatod, Provisions of 173-13 & AR 35-4820 as amended apply The trans of dopendents, anth baggage, and shipment of houschold goods will b.c in-accordanco w/oxisting rogulations, TD N PCS PC11 TPA TBMLL TC will furn noc trans. 570-500 060-208 P537-02,03,07 S 99-999. AUTH: 1st Ind Hq 15AF 370.5 (6 Cct 49) on Ltr Hq SAC 370.5 (30 Sep 49) subj: Moviment Ordors, 301st Bcmbardnent Wing, Medium. RANK NAME P SSN AFSN COMPONENT RACE yob FCREIGN SV CR & 1ST Lf 1024 NCRMAN ; DEVOE 40691568 1921 16 foriogn SV cr, ret Jay 49 Pilot 011 fly status AFSS - 21 Oct 51 WP o/a 1 Nov 49, rptg d : to 17 Nov 49 IDCSA: 9 Nov 49 7536 .ILL P ELLICITT A0427810 USAIRR 28 forcign SV cr, ret 2 Fob 15 No acro rating AFSS - 1 Jan 52 WP o/a 1 Nov 49, rpt: dato 15 Nov 49 10 DDALV 9 Now 49 CAPT 2590 RCBERT B FAJJLEY 10802278 1923 21 forcign SV cr; rot 24 May 47 Pilot status AFSS Hov 51 TP o/a 1 Nov 49, rpts dato 6 Nov 49 on routo SDC 9 49 97th Bcmb Jg. Biggs AFE, Toxas 1ST LT 2110 ROBER: E SOULE AF749796 1916 .20 forcign SV cr, rot 28 Doc 45 aoro rating AFSS 1 51 TP o/ 1 Nov 49, rpt dato 15 Nov 49 10 DDALV Nov 49 1st Ftr Ug, March AFB, California NAJ 7536 CECIL L FOLMLIR 10280839 1907 25 forcign SV cr, rct 5 Apr 47 Comd Pilot fly stots AFSS .PP o/a 1 .Nov 49, rptg Nov 49 No Dolay routo EDCS:: 1st LT 6302 ILARTIN D FISHEL USAFR 1921 10 forcign SV cr, ret 15 llay 75 Pilot, 011 fly status AFSS - 1 Jul 52 .JP o/a 1 Nov 49, rpts dato 17 Nov 49 10 DOML EDC SA: 9 Nov 49 isr LT (4823) is SEQUIN, J1: A02054018 (.T) (YOB 1916) (Hon ratod.) (67 forcign SV cr, dato of ret fr /s Jul 29) (AFSS- 52) 352nd Bomb Sq, 301st Bomb Gp (hi) (PPP) this ta Salina, Kansas (151F) (SHO) is rold fr dy & asymt that orgh & roasgd to 2d hir Rflg Sq, Dnvis-Mon than B, Tucson, irizona. uff .PP fr this t to o/a 1 Nov 49, rptg datc 6 Nov 49. No dolay on routc. EDCS 9 Nov .29 TD N PCS PCA TPA TC vill furn 110 c trans. The trans of depondents, cuth basgage, and shipmont of houschold goods will b c in accordance v!/cxisting regulations. 5704500 060-208 P537-02,03,07 S 99-999, 1st Ind Hq 15AF 370.5 (6 Uct 49) on Ltr Hq SAC 370.5 (30 Sop .29) subj: Movemont Crdors, 301st Bombardment Wing, Medium The fol-nomed offs USAL (.) M & S. Gp this sti. Salina, Kansas (15.1))( >hC) are reld fr dy & hagmt that orgn and roosgd to orgn &: stas as indicatod Delay on routo auth as indicatod, chargoablo as lv. offs JP fr this sta o/a dates indicatod, rptg datos as indicatod. Provisions of AFR 173-13 & .R 35-4820 as amonded apply The trans of depondents, auth baggage, and shipmont of houschold goods will bo in accordanco ti/cxisting regulations; IDN PCS PCH TPA J TC will furn nec trans. 5704500 060-203 P537-02,03.07 S 99-909. AUTH: 1st Ind Hq 15AF 370.5 (6 icct i:9) on Ltr Hq S.C 370.5 (30 Sep 49) subjt Movement Crdors, 301st Bombardment Wing, Medium. P SSN FCREIGN SV CR &3 DATE CF AERC RETING AFSS & TERM 307th Bomb `Tg, No.c Dill .1FB, Florida CHPT 0612 101696684 1919 25 forcign SV cr, ret Jul 45 Pilot on fly status AFSS - Un}: .PP o/a 1 Nov 49, rptg dato 8 Nov 49 No dolay on routc edCSh: 9 Nov 49 FR Supply Sq, 30lst M&S 1ST LT 4823 LEC E SULLIVINN AC923831 1923 11 foroign S V cr, rot Cct 45 P:lot on fly status ApSS 1 flug 52 Cff prossntly-DS to Chanu te AFB, I11, upon compl of DS, Cff WP to 98th Bomb Jig, Jash, eff 10 Feb 504 No delay eil routc Bomb Jg.: March hFB Califcrnia CHPT 2159 CHARLES E MCGEE 40807103 (N) 1919 11 forcign SV cr, ret hpr 45 Pilot on fly' status .FFS3 - 1 Dec 51 JPP o/a 1 Nov 49, rpt date 18 Nov 49 10 DDALV EDCSA: 9 Nov 49 98th Bomb Tig, Spokane 1 ist LT 2110 JESSL R 101822800 1916 18 foreign SV cr, ret Sep 45 No Acro Rating AFSS - 1 Feb 52 off presontly DS to Ft Carren, upon compl of DS, Off JP to 98th Bomb Mig, .jash, off o/a 21 Doc 49. No delay on route 1ST LT 0600 CLIVER J BENTON 101589692 USAFR (N) 1914 27 forcign SV cr, ret Apr 46 AFSS 5 Jan 52 TP o/a 1 Nov 49, rptg dato 8 Nov 49. No dclay on rcutc 49 CAPT 4010 WILLIAM H MENSSEN 1.0563820 USAFR 1920 28 forcign SV cr. ret May 45 110 herc Rating AFSS Jan 52 WP o/a 1 Nov 49, rptg dato 6 Nov 49 No dolay on rout 49 BY ORDER.CI CCLONEL KELLY: CFFICIAL: Major, USAF 13 IIq USAF, Atthis Mil Pors Div: par 3, 46-5 5 Ci, 22nd Bomb .ig, March Calif, par 5 20 02 off (to Sq), par 3, C & 5 13 H<i Attn: Air hdj Gon, Jash 25, 5 IIg 15AF, par 3, it &: 5 DC, par 3, 4 & 5 15 is Class, par 3, 1 & 5 5 CC; 98th Bomb 16, Spokano NFB, Bong, Wash, par 3 & 5 5 Co, 509th Bomb ig, WalkorAFB, Roswell, NM, par 3 &: 5 5 Co, 2:nd Bomb ig, Chatham, Georgia, par 3 5 Co, 97th Bonb Biggs, AFB, Texas, par 3 5 C.: lst Ftr .ig, March FB,Calif par 3 5.C0, 2nd hir Davis-Monthan AFB, Tucson, lirixona, par is 307th MacDill ..FB, pur 0 HEADQUARTERS 301ST MAINTENANCE AND SUPPLY GROUP, NEDIUM Smoky Hill Air Force Base Salir- Kansas SPECIAL ORDERS ) 27 October 1949 NUMBER 197 ) 1. The fol-named Offs, USAF, 301st Maint Sq, Bomb (M), this Gp, have fired the prescribed course for the Pistol Dsmtd, Cal .45, score as indicated. Auth: AR 775-10. GRADE SSN NAME AFSN SCORE 4823 ALBERT If COPELAND A0-377297 259 S 4823 ROY C FARMIER A0-20422755 281 E 21 A0-807103 215 CAPT 4821 J H MCKAMY A0-2044965 TDY UNQUALIFIED CAPT 7536 THEODORE R PRYOR A0-823515 TDY UNQUALIFIED 1ST LT 4821 CLARENCE F BOOTH AO-622923 211 MKM 1ST LT 4593 DONALD H A0-876473 335 E 1ST LT 4823 WILLIAM L FINCH A0-590372 TDY UNQUALIFIED 1ST LT 4823 WILLIAM I LUTENER 16227A TDY UNCUALIFIED 1ST LT 2110 JOHN C MOAK A0-2045135 237 MKM 1ST LT 4902 HARRY I OBERHOLTZER AO-934397 262 S 1ST LT 1024 LEO E SULLIVAN AO-923831 TDY UNQUALIFIED 2. Such orders having veer issued under exigencies which prevented issuance of orders in advance, VOCO 16 Oct 49 is confirmed & made record. CAPT (4902) RICHARD G MESTRICH, A0-665747, USAF, (W), 301st Supply Sq, Bomb (M), this Gp, is r \".d present dy asgmt & asgd Prim dy Sq CO SSN 4902, thice LT COL DAILEY JONES, 2804A, reld,\" and is further asidd add dy R&U Off, BY ORDER OF LIGUTENANT COLONEL RICHER: OFFICAL: CLARENCE H. GARRISON lst Lt, USAF Adjutant CLARENCE H. GARRISON 1st Lt, USAF DISTRIBUTION: A & B SPECIAL ORDERS ) HEAD? TARIERS 301ST (M) NUMBER 195 ) Smoky Hill Air Force Base Salina, Kansas, 3 October 19L9 TRACT T Such orders having been issued under exigencios which prevented issuance of orders in V 60 30 Sep 49 confirmed and made record: The fol-named Ofis N orgns indicated, JP fr this sta o/a 30 Sep 1949 on TDY for aprx 3 days plus tvl time to McDill, AFB, Florida rotg to CO thereat for purnose of Ferrying `epsonnel & Freight & upon corno of LDY will ret to proper orgn & sta. CIPAP. TR.A directed. Ho per dien auth because of nonavailability of funds. CHARLES AO 03AF 301st liaint Sq, 301st 1: 3: 3 Gp (M) CAPT (1024) H. J. RODGERS AC 733729 JSAF 301st Air Ref] 3q, 301st Bomb Gp (N) T SGT (2750) HAILUEL S CABALLET.O AF 38054502 USAF Hq 2 Hq Sq, 301st Air Base Gp 26. Such orders having bean issued under exigencies which prevented issuance of orders in advance, VOCO 30 Sen 49 confirmed and made record: The fol-named Offs .3. EMM orgns indicated, /P fr this sta o/a 30 Sep 1949 on TDY for 3 dayrs nlus tvl time to Carvell, N J, Cp Gordon, Ga, Carlis]e Bks, N J, ? Scott fld, 111 potg to CO therent for purnose of Ferrying Personncl & Freight & upon conn of TDY will ret to proper orgn 3: sta. CIPAP. TDN TBLA directed. No per diem auth because o. non-uvailability of funds. CAPT (1024) 0. ROGIERS AO 429979 USAN 1911th AACS ist IT (6302) Li. D. FISHEL AC 715755 USAI Hq & Hq Sq, 301st Eomb Lig (M) T SCT (2750) N. C. BODDEN Af18025496 USAF Hc & Hq Sq, 301st Air Bace Gp (M) 27. Such orders having been issued under thich prevented issuance of orders in advance, VCCO 24 Sen 49 and made record: The fol-named Offs &: EM, orgns indicated, .P fr this sta o/a 24 Sen 1949 on TDy for apry 2 days >lus tvl time to licClellan AFE, Sacramento, Calif rpts to CO thereat for ourpose of Ferrying B-29 acft Thereto C upon compl of TDY will ret to proper orgn 2: stc. TDN TEA directed. No opr dicm auth because of non-availability of funds. 301st Air Refl Sq, 301st Bomb 1ST LT HARIY il FIELD A0740391 UCAF w LT AUL A 1.! L USAF 1ST LT LEWIS A CLEVEL..ID 14753A USAF T SGT ED.JIN I AF16020913 USAD S SGT ROBERT E DALL Af12027674 S SGT C. J. KLIMRBILL AF122961,19 JENF S SCT SILL .IAM P W 10 USAT OFFICIAL: FORREST A. BRANDT Hajor, UBAF Adjutant Major, USAF Adjutant 4 ea off e EM par. 25 thru 27 (to Sq concerned) 1 wg Class Par 26 (1 for off 201 filc) 301ST MAINTENANCE AND GROUP, MEDIUM Smoky Hill Air Base Salina, Kansas SPECIAL ORDERS ) 26 September 1949 NUMBER 177 ) 1. M SGT ANDREW D. WYATT, AF-6956550, USAF, (W), Hq 301st M&S Gp (M), this sta, is granted Lv of Absence (Ordinary) for 15 days eff 26 Sep 49. EM will rpt for dy NLT 2400, 11 Oct 49. LV ALDRESS: 135 S. Clark, Salina, Kansas. Auth: AR 600-115. 2. T SGT RAYMOND F PARDEE, AF-35380839, USAF, (W), 301st Supply Sq Bomb (M), this Gp, is granted Lv of Absence (Emergency) for 16 days eff 26 Sep 49. EM will rpt for dy NLT 2400, 12 Oct 49. LV ADDRESS: 925 sum, Salina, Kansas. Auth: AR 600-115. 3. SMOP 4, SO 170, this Hq, cs (re: Asgmt of Add Dy to CAPT (4823) CHARLES E MCCE A0-807103, 301st Maint Sq), as read \"CAPT CHARLES E. MCGEE\" is amended to. read \"EAPT (2159) CHARLES E MCCEE\". 4. S SGT MICHAEL J PATRICK, AF-11022020, (w), 301st Maint Sq (1:), this Gp, is granted Lv of Absence (Ordinary) for 8 days eff 27 Sep 49. EM will rpt for dy NLT 2400, 5 Oct 49. LV ADDRESS: 1017 S 9th St. Salina, Kansas. Auth: AR 600-115. 5. CPL LANO J PURSLEY, AF-17226031, (wi, 301st Maint Sq, Bomb this Gp, is granted Lv of Absence (Ordinary) for 10 days eff 3 Oct 49. EM will rpt for dy NLT 2400, 13 Oct 49. LV ADDRESS: City Rt. #2, Bolivar, Missouri, Auth: AR 600-115. 6. The fol-named Offs, (T:), USAF, orgn indicated, this Gp, are aptd members of the Classification Board for this Gp. Auth: AFM 35-1, as amended by AFL 35-391, 29 Jul 49 & SAC Reg 50-11, 18 Apr 49. The Board aptd by Par 10, SO 156, this Hq, cs, is reld. MAJ ALBERT W COPELAND A0-377297 301st Maint Sq President MAJ DELMAR G LEE AO-484137 Member Hq 301st M&G Gp CAPT WILLIAM D LEMKOWITZ A0-342884 301st Mtr Veh Sq Member CAPT RAYMOND Wj SULLIVAN A0-433005 Hq 301st M&3 Gp Member CAPT WILLIAM T LCMAN, JR. A0-1060177 301st Supply Sq Member 1ST LT CHARLES E SCHMIDT A0-588088 Hq 301st M&J Gp Recorder 1ST LT CLARENCE H GARRISON AC-876829 Hq 301st M&S Gp Member BY ORDER OF LIEUTENANT COLONEL RICHER: OFFICIAL: CLARENCE H. GARRISON 1st Lt, USAF Ad jutant CLARENCE H. GARRISON 1st Lt, USAF Adjutant HEADQUARTERS 301ST MAINTENANCE AND SUPPLY GROUP, MEDIUM Smoky Hill Air Force Base Salina, Kansas SPECIAL ORDERS ) 19 September 1949 NUMBER 173 ; 1. PFC (521) LONNIE FISHELL, JR., AF-17233904, USAF, (W), Hq 301st M&S Gp (M), this sta, is reld present dy asgmt & reasgd dy OJT SSN 835 (Shipping Clk), no change in dy section. 2. Such orders having been issued under exigencies which prevented issuance of orders in advance, VOCO 18 Sep 49 is confirmed & made record. T SGT GEORGE W. POPE, AF-36200806, USAF, (W), 301st Supply Sq, Bomb (M), this Gp, is granted auth to rat sep & reside off the Base eff 8 Sep 49. Auth: AR 210-10 & AFR 173-9. 3. SMOP 3, SO 170, this Hq, cs (re: Asgmt of CAPT (4823) CHARLES E. MCGEE, A0-807103, 301st Maint Sq), as reads \"CAPT (4823) CHARLES E. MCGEE\" is amended to read \"CAPT CHARLES E. MCGEE\", & So much as reads \"Asgd Prim dy OIC Associated Shops, (Dy SSN 4823)\" is amended to read \"Asgd Prim dy OIC Associated Shops, OJT SSN 4. PFC (590) CLARENCE MILLER, AF-15230199, USAF, (W), 301st Supply Sq, Bomb (M), this Gp, is reduced to the grade of PRIVATE for cause. Auth: AR 615-5. 5. Such orders having been issued under exigencies which prevented issuance of orders in advance, VOCO 16 Sep 49 is confirmed & made record. T SGT ROBERT N. BURNHAM, AF-17270543, USAF, (W), 301st Supply Sq, Bomb (M), this Gr, is granted auth to rat sep & reside off the Base eff 16 Sep 49. Auth: AR 210-10 & AFR 173-9. 6. Par 5, SO 170, this Hq, c s (re: Dy asgmt of 1ST LT (4821) CLARENCE F. BOOTH, A0-822923, 301st Maint Sq), is REVOKED. 7. 1ST LT (4821) CLARENCE F. BOOTH, A0-822923, USAF, (W), 301st Maint Sq, B crbb (M), this Gp, is reld present Prim dy asgmt & asgd Prim dy Asst OIC Aero Repair & Engine Build-up, Dy SSN 4823, eff 13 Sep 49. 8. 1ST LT (4821) CLARENCE F. BOOTH, AO-822923, USAF, (W), 301st Maint Sq, Bomb (M), this Gp, is reld Add Dy Asst OIC Acft Shops eff 13 Sep 49. 9. CAPT WILLIAM D. LEMKCWITZ, AC-342884, USAF, (W), 301st Mtr Veh Sq, this Gn, is aptd alt certifying off for the rurpose of payment of troops of 301st Motor Veh Sq on re; monthly & supp payrolls, BY ORDER CF LIEUTENANT COLONEL RICHER: OFFICIAL: CLARENCE H. GARRISON 1st Lt, USAF Adjutant CLARENCE H. GARRISON lst Lt, USAF Adjutant DISTRIBUTION: A & B HEADQUARTERS 301ST MAINTENANCE AND SUPPLY GROUP, MEDIUM Smoky Hill Air Force Base Salina, Kansas SPECIAL ORDERS 19 September 1949 NUMBER 173 ) 1. PFC (521) LONNIE FISHELL, JR., AF-17233904, USAF, (W), Hq 301st M&S Gp (M), this sta, is reld present dy asgmt & reasgd dy OJT SSN 835 (Shipping Clk), no change in dy section. 2. Such orders having been issued under exigencies which prevented issuance of orders in advance, VOCO 18 Sep 49 is confirmed & made record. T SGT GEORGE W. POPE, AF-36200806, USAF, (W), 301st Supply Sq, Bomb (M), this Gp, is granted auth to rat sep & reside off the Base eff 18 Sep 49. Auth: AR 210-10 & AFR 173-9. 3. SMOP 3, SO 170, this Hq, cs (re: Asgmt of CAPT (4823) CHARLES E. MCGEE, AO-807103, 301st Maint Sq), as reads \"CAPT (4823) CHARLES E. MCGEE\" is amended to read \"CAPT CHARLES E. MCGEE\", & So much as reads \"Asgd Prim dy OIC Associated Shops, (Dy SSN 4823)\" is amended to read \"Asgd Prim dy OIC Associated Shops, OJT SSN 4823 4. PFC (59n) CLARENCE MILLER, AF-15230199, USAF, (W), 301st Supply Sq, Bomb (M), this Gp, is reduced to the grade of PRIVATE for cause: Auth: AR 615-5. 5. Such orders having been issued under exigencies which prevented issuance of orders in advance, VOCO 16 Sep 49 is confirmed & made record. T SGT ROBERT N. BURNHAM, AF-17270543, USAF, (W), 301st Supply Sq, Bcmb (M), this Gn, is granted auth to rat sep & reside off the Base eff 16 Sep 49. Auth: AR 210-10 & AFR 173-9. 6. Par 5, SO 170, this Hq, cs (re: Dy asgmt of 1ST LT (4821) CLARENCE F. BOOTH, AO-822923, 301st Maint Sq), is REVOKED. 7. 1ST LT (4821) CLARENCE F. BOOTH, A0-822923, USAF, (W), 301st Maint Sq, B cmb (M), this Gp, is reld present Prim dy asgmt & asgd Prim dy Asst OIC Aero Repair & Engine Build-up, Dy SSN 4823, eff 13 Sep 49. 8. 1ST LT (4821) CLARENCE F. BOOTH, AO-822923, USAF, (W), 301st Maint Sq, Bomb (M), this Gp, is reld Add Dy Asst OIC Acft Shops eff 13 Sep 49. 9. CAPT WILLIAM D. LEMKCWITZ, AO-342884, USAF, (W), 301st Mtr Veh Sq, this Gp, is aptd alt certifying off for the purpose of payment of troops of 301st Motor Veh Sq on reg monthly & supp payrolls. BY ORDER CF LIEUTENANT COLONEL RICHER: OFFICIAL: CLARENCE H. GARRISON 1st Lt, USAF Adjutant CLARENCE H. GARRISON 1st Lt, USAF Adjutant DISTRIBUTION: A & B 301.ST ] .INTEN.NCE .ND SUPPLY GROUP, NEDIUM Smoky Hill Air Force Base Salina, Kansas SPECIAL ORDERS ) 13 September 1949 NUMBER 170 ) 1. NAJ (4823) ALBErT COPELAND, A0-377297, USAF, 301st Maint Sq, Fomb this Gp, is dsgd Certifying Off for the purpose of payment of troops of 301st Maint Sq, Bomb (M), this Gp, on reg monthly & supp pay- rolls, vice 1ST JOHN C. MO..K, 1.0-2045135, USI.F, (\"I), reld. 2. 1ST LT (2110) JOHN C. MOAK, 10-2045135, US..F, (TI), 301st Maint Sq, Bomb (M), this Gp, is dsgd Alternate Certifying Off for the purpose of payment of troops of 301.st Maint Sq, Bomb (M), this Gp, on reg monthly & supp payrolls, vice C.P.T H.LLLY F. R.NDALL, A0-569872, US..F, (W), & CAPT THEOLORE hi PRYOH, 0-823515, US..F, (:T), reld. 3. C.PP (4823) CH.RLES E. MCC 10-807103, USAF, (c), 301st Maint Sc, Fomb (N), this Gp, is reld fr present dy asgmt & asgd Prim dy OIC associated Shops, (Dy SSN 4823). 4. C..PT (4823) CHF.RLES E. MEGEE, n0-807103, USAF, (c), 301st Maint Sq, this Gp, is asgd .dditional dy Unit Tng Off, vice MIJ J !.LBERT it. COPELAND, 10-377297, reld. 5. 1ST LT (4821) CLARENCE F. BCOTH, A0-822923, (w), 301st Maint Sq, Bomb (M), this Gp, is reld ridd dy Asst OIC Acft Shops & asgd Prim Dy `sss OIC hero Repair & Engine Build-up, Dy SSN 4821. 6. CWC (4823) ALBERT R. CARNERI, AW-2107452, USAF, (w), 301st Maint Sq, Bomb (M), this Gp, is reld present Prim dy asgmt & asgd Prim Dy Asst OIC Production Inspection, Dy SSN 4823. 7. SMOP 3, SO 169, this Hq, cs, (re: Granting PFC ROBERT L. EAGAN, auth to rat sep & reside off the Base) as reads, \"PFC ROBERT L. EAGAN, :F-13257140, USAF, (W), 301st Supply Sq, Bomb (M)\" is amended to read \"PFC ROBERT L. EAGAN, USAF, (W), Hq 301st M&S Gp (M)\" BY CRDER OF LIEUTENANT COLONEL RICHER: OFFICIAL: CLARENCE H. GARRISON 1st Lt, USAF Ad jutant SCHMIDT 1st Lt, USA.F Asst Ad jutant DISTRIBUTION: A & B SPECIAL OPDERS ) NUMBER 177 ) Smoky Hill hir Force Base Salino, Kansas, 7 Septomber 1949 I R 1 C I 40, SG T (631) JOSHUL M HINSON AF 1:11:7033 USILF, Hq &: Hq Sq, 301st Air Basc G p (M) (Casual) is trfd in or to Hq, 301st Boinb G p (ii), wi/dy as Intell Spec. PC.1 No tvl involved, 41. 2D LI (103:) GECRGE i! HUGHEY- 10940084 US..I is rold fr dy & asgitt (0001) Hq & Hq Sq, 301st hir Base Gp (1)) (Casual) and roasgd to 32nd Bomb Sq, 301st Bomb Gp (M), w/dy as Navigator (Dy SSN 1034) FC.: }'Io tvl involved, EDCIR: 9 Scp 49 E McGEE 10807103 USILF is fold fr dy & asgitt ase and to 301st Maint lifft Maint Off (Dy SSI OJ 4823) PCM No tvl 43. CHP (0400) GENE W REDDEN 101645306 USALF is reld fr dy & asgmt (0001) Hq & Hq Sq, 301s t ilr Base G p (II) (Casual) and reasgd to 301s Comm Sq, 301s Air Basc Gp (ii), v://ly as fcl fol Off (D., SSN 0.100) PCA No tvl involved EDCIR: 9 Sep 49 440 1ST Li (1051) LENIS C Perry 10680703 Hq &: Hq Sq, 301st hir Base Gp (M) (Casual), P SS.T 1051 redesignatod bo (102-) four ongine pilot, huth: .FFM 35.-1 as amonded 45. 131 LF (1024) LEVIS C Perry 10680703 USILF is reld fr dy & asgmt (0001) Hq & Hq Uq, 301st hir Basc Gp (?:) (Cosual) and reasgd to 32nd Bonb Sq, 301st Bomb Gp (M). t//dy as four engine pilot (Dy SSN 1024) PCH1 No tvl involved 9 49 46, T SGT (750.-C) I.L.R.ION is SIACY AF 17027938 USAF, Hq & Hq Sq, 301st hir Base Gp (M) (Casual) is granted Lv of Absence (Roonlistment) for 7 days, off 12 Sep 49. EM wil] rpt for dy NLT 2400, 19 Sep 49. (Roonlitt lv deforrod by Sq CC) Aldress on lv: Dixio Hotol, 240 4.2d St., New York, NY. FD will pay in adv a/r 5c por milc reonlint tyl alus pay fr this sta to New York, NY and ret to stas AR 600-115. AFR 173.5 2c LFR 39-9n 5704500 060-209 P538-02 S 93-999 47. SHOP 1 SO 176 this Hq CS. as reads:os The fol-named USAFR Offs, having rptd this ta for 15 days tive Dy por Par 4 SO 140 Hq 15AF, 10 hug 49. are atchd to Hq & HIq Sq, 301st Bomb Tig (1.2) this sta for pd of AD and upon compl of \"D. unless Soonor reld, Offs will ret to perm home address and revort to inactive status, off 2 Sep 19\", is amonded to read: (cont'd) Par 47 SO 177 Hq 301st Bm .gg SILAFB, 7 Sop 49, cont'd. \"The fol-named USW.FR Officors, havin rptd this is ta for 13 days lictive Dy por Par 4 SO 140 Hq 15AF, 10 lug 49, are asgd to Hq 2: Hq Sq, 301st Bomb Ng (M) this S ta for pd of Ing and upon of AD, unloss sooncr rold, Offs will ret to perm home address and revort to inactive status. eff 2 Sep 49,\" The fol--named EM (RA)((ir)(P/L) Hq &3 Hq Sq. 301st. Bose Gp (M) this sta SH.FB. Salina., Kansas (15.1F)(3lic) aro trfd in gr to (OPERITING) McChord AFB ; Cashington, and furthor asgnt to 803rd Engr, fr this sta o/a 13 Sep 49 Sc as to arrive thereat 16 Sep 49, No delay . ch routc. EDCIR: 17 Sep 49 EM will rpt to new sta in propor uniform. IDN PCS TC will furn noc trans, FD will pay in e.dv mon alus in licu of subs for 7 moals to 0a ENH in accordance 173-5 & .L.R 35-4810 as amonded, and a/r 32 por milc for tvl fr this sta to 1:cChord Wash, whore Govt trans is not furn, 5704500 060-204 P534-02,03 S 99-999. .UUTI: FTE: DE J.FQC 34B, fr Hamilton fb,Calif, 31 lig 4 & ifr 35-59 as amonded PFC (605) BILL J V.UUGHN 18279341 (ii)) 1930) (12 forcign S V credits, date of ret fr /s 13 Jul 40) (DGE 21 Jan .88 for 3 yrs) PFC (345) CECIL J TAYLOR R., 18339882 (i,) (YOB 1927) (12 forcign SV credits, dato of rot fr 0/s 1.3 Jul 49) (DOE 6 43. for 3 yrs) BY ORDER OF COLONEL KELLY: OFFICIAL: FORREST is BRANDT idjutant DISTRIBUTION! 3 EM par 40 ( to Gq) 3 0a Off par 41 thru 45: to Sq, 1 cy for Of::'s 201 filc) 5 Ug Class, par 4]. thru 45 5 EM par 46 ( to Sq) 10 .to Vig A~3, par 47 15 ea EM por 48 to Casual Sq, littn Set Saltz) 5 CO, McChord AFB, .jash, par 48 CE CERTIFICATE INSTRUCTIONS: 3 copies to Officer (1 for Officer and 2 for new Officer) and 1 copy to Officer's 201 file. LAST NAME-FIRST NAME-MIDDLE INITIAL ARMY SERIAL 'GRADE AUTHORITY FOR DEPARTURE (Order No., par., date, etc.) SO 22 pa 22, dtd 27 July 1949 CHECK LIST Check or initial facilities used and cleared) PROPERTY RESPONSIBILITY RECORDS OFFICERS REGISTER IN HEADQUARTERS COPIES OF SPECIAL ORDERS WD AGO FORM 66-1. 66-2. OR 06-3 PRIVILEGE PASSES (Commissary ourds, Dost ex- change cards, theater pasecs, etc.) REMARKS: CERTIFICATION I certify that I have turned in all classified documents for which I am responsible, except those which are my personal property: That I have liquidated all personal indebtedness in this area or have made arrangements satisfactory to my creditors: That i have made settlement of all public funds, property accounts, and debts due all agencies and instrumentalities of the United States, including the against me at the agencies (GRADE AND ORGANIZATION (SIGNATURE) I certify that adequate quarters were were not furnished (FOR THE COMMANDING OFF7 From (Date) To (Date) (GRADE. ARM. AND TITLLE) WD AGO FORM 1 J A N 1 4 6 is GOVERNMENT PRINTING OFFICE 16-47143-1 y th i rl n ster Ronal . (McGoe 30 un 1943 linoi . In r C. Int 105 ,1055,1051,216 2162, 3 n 44 1(5 OLC) ib, Vic P-39, 7, F-5 , 29 July 194 C R S E, Cap , US HEADCUARTERS 332D FICHTER WING 332D AIR BASE GROUP LOCK BOURNE AIR FORCE RASE Columbus 17, Ohio (Date) OFFICERS REPORTING TO THIS STATION FOR 411 Officers reporting to this Station for assignment will clear through each of the following functions. Upon complation, this form will be turned in to Officers Clearance. This form must be completed within twenty four (24) hours after reporting. RATING The responsible Officer of each of the following functions will initial opposite the office as the Officer clears: BILLETING OFFICER T-1 T-1 1 Copy Officers' Clearance 1 Copy Officer Concerned Yes INSTA' NSTAVITATION ATION OFFICER'S CLE  ANCE CERTIFICATRated 33 Tech Tng Wg No Chanute AFR, Illinois INSTRUCTIONS: 3 copies to Officer (1 for Officer and 2 for new Finance Officer) and DATE OF DEPARTURE 1 copy to Officer's 201 file. LAST NAME-FIRST NAME-MIDDLE INITIAL ARMY SERIAL No. GRADE ORGANIZATION Lockbourne AFB RECORDS OFFICERS REGISTER IN CLASSIFIED DOCUMENTS EFFICIENCY REPORTS COPIES OF SPECIAL ORDERS PRIVILEGE PASSES (Commissary cards, post ex- change cards, theater passes, etc.) WD AGO FORM 8-117 TURNED IN REMARKS: Key : * Cleared personnally by Officer P Permanent Party Only S Student Officers Only R Rated Officers CERTIFICATION: I certify that I have turned in all classified documents for which I am responsible, except those which are my personal property: That I have liquidated all personal indebtedness in this area or have made arrangements satisfactory to my creditors That i have made settlement of all public funds, property accounts, and debts due all agencies and instrumentalities of the United States, including the above. There are no charges against meat the agencies listed where no checks or initials appear. (SIGNATURE) I certify that adequate quarters were were not furnished To (Date) 14 6 WD AGO FORM 1 J A N 1946 * U. s. GOVERNMENT |*RINTING OFFICE 16-47143-1 AFTRC Form No.15-2 HEADQUARTERS AIR TRAINING COMMAND 15 APRIL 1948(REV) Auth: AFTRC Reg 15-2 STUDENT RECORD CARD TECHNICAL TRAINING I. Last Name First Name 2. ASN 3. Grade 4.SSN 5. Enlistment Status 6. Assigned Station & AF or Command 7. Squadron 8. Age 9. Grade School IO. High School II. College 14. Basic Training (Years Attended) (Years Attended) (Years Attended) a. Date Completed: b. Length (weeks) 15. M.C. C. 0. 16. Experience 18. Race W N (months) O Test Scores 20. Ist. Choice of Course 21. 2d. Choice of Course 22. 3d. Choice of Course Test St. Score TC 70 TC 30 II-AC TC 4o III-AR 23. Date Entered Course 24. 25. Class Number and Shift IV-PA IV PA ARC- MA 6 27. S mbol Phose Remarks Reason for Elim. or Holdover 33. Repeat coses 34. Total or Average 3.9 0. No. Phoses Repeated b. Average grade bosed on orig phoses only INCL. TO AFTRC REG. 15-2 AFTRC FORM NO. 15-2 15 APRIL 1948(REV) 1948 (REV) STUDENT RECORD CARD 36. PERSONNEL RECORD Action T & 0 & Order Dote Reoson 37. REMARKS Reported dote 7-B per par 199 Tng Sq to I. Final Roting is a word of the student's obility. SUPERIOR, EXCELLENT, VERY SATISFACTORY, SATISFACTORY, UNSATISFACTORY. 2. Definition of numerical groding is as follows: SCALE VALUE DEFINITION 5 Completes work quickly and efficiently and understands bosic principles thoroughly. 4 Completes work with little -hesitancy; understands underlying principles better than overage. 3 Has general ideo of work to b e done and performs job with some repetition and minor errors but indicates odequate knowledge of subject moterial. 2 Is able to complete part of work but does not understand underlying principles of subject moterial. I Connot complete work satisfoctory and has little knowledge of subject moterial. 3. In order to determine degree (S, S-Sk) ottention invited to pars 506.2 through 508, Sec V, AF Manual No. 35-0-1, 3 April 1944 (as rev.) Air Craining Jommand fiven ot Chanute Air Farre Buse, on this fourteenth day of June in the year of our Cord one thousand mine hundred and or ty-nine R E S T R I C T E D HEADQUARTERS CHANUTE AIR FORCE BASE and 3345TH TECHNICAL TRAINING WING Chanute Air Force Base, Illinois SPECIAL ORDEFS) 8 June 1949 NUMBER EXTRACT 8. A of the Offs 3345th Tech Tng Tg: (Auth: Par 18 AF dtd 8ct FOR THE BOARD LT COL ED ARD F STODDARD A035194 USAF (President) Hq & Hq Sq 3345th Tech Tng Wg MAJ LEONARD V ANDERSON A053497 USAF Hq & Hq Sq 3345th AB Gp MAJ DONALD F PENDERGRAST A046853 USAF Hq & Hq Sq 3345th Tech Tng Wg MAJ ROY E VHITTAKER A035361 USAF Hq & Hq Sq 3345th Tech Tng Gp CAPT CLARENCE J EDEN A0438481 USAF Hq & Hq Sq 3345th Tech Tng Wig CAPT HARRY J THOMAS A035592 USAF Hq & Hq Sq 3345th AB Gp CAPT POBERT B STONEHILL 01726280 MC 3345th Sta Med Sq (Flt CAPT WALTER E BERMAN 01756971 MC 3345th Sta Med Sq COL LOUIS K POHL 021473 MC 3345th Sta Med Sq (Alternate The Fly Evaluation Bd aptd by Par 26 SO 81 this hq cs as a mndd by Par 8 SO 82 this hq cs is hereby dissolved. 9. The folg named Offs atchd P/L (Stu Pers-USAF) AFTRC 3350th Tng Sq (AMOT) 3345th Tech Tng Gp scd to grad fr Acft Maint Off Crse TS TDTRC Chanute AFB Ill on 14 Jun 49, on DS this B fr B shown below FP their proper B o/a 14 Jun 49 in accordance w/orders shown. 468th AFBU Res AF ADC Orlando Fla 21 Jul 4 THOMAS K DICKINSON A053664 USAF (Twenty (20) DDALV per TWX SCRT-P 6-14 2584th AFRTC Memphis Tenn. 174th AFBU (Res Barksdale AFB La 78 Tng) AFB La 13 Aug WALTER A0568739 USAF Lockbourne AFB Colubmus Ohio CAPT (2159) CHARLES E McGEE USAF 1ST LT FRANK ALLEN USAF 6 Hq_10th Bragg - 1ST LT EUGENE T MAXWELL A0660779 DISTRIBUTION \"Btl jo - 2 - RESTRICTE F E S R E S T R; I C T E D 1. Class of allotment to be affected D (See AR 35-5520) Flrst DISCONTINUANCE CHANGE (Complete both dlscontIn- .k one) (Co mplete block below) uance and new allotment blocks below) of allotment 8. DlscontInue last day of 9. Army Serial No. to be dlscontInued dlscontInued 10. Allottee's name and address (If payable to bank, state to whose credit, 18. Allottee's name and address (If payable to bank, state to whose credIt) 11. Relationshlp of 12. Reason for dlscontInuance 19. Relationship of allottee 21. (Class D or N only) show how allottee amount of flrst deduction from pay computed Premlums 13. Commencement date 14. Last pald to Include 15. Allotment deducted to 20. (Class E only) Total amount of E Month of of allotment month of Include month of allotments now In effect Including this allotment Month of Month of Total n handwriting) 23. Date slgned 24. BY COMMANDING OFFICER OR PERSONNEL OFFICER OF ENTRY ON SERVICE RECORD (Not required for officer allotment) 25. Certifylng officer's slgnature and rank 26. Date slgned 27. Date entered on 28. Certifylng officer's organization and station service record or APO 29. If Allotter's name has changed-Indlcate OLD name WD AGO FORM 1 141 REPLACES WD AGO FORM No. 29. 1 FEB 45. AND WD AGO FORM No. 30. 16-45188-1 U. S. GOVERNMENT PRINTING OFFICE U L 1 9 4 5 20 SEP 44. WHICH MAY BE USED UNTIL EXISTING STOCKS ARE EXHAUSTED S T R I C T E D HEADQUARTERS CHANUTE AIR FORCE BASE and 3345TH TECHNICAL TRAINING WING Chanute Air Force Base, Illinois SPECIAL ORDERS) 4 May 1949 NUMBER 122) EXTRACT & Sup Gp eff 5 May 49. 83. CAPT CLARENCE J EDEN A0438481 USAF AFTRC Hq & Hq Sq 3345th Tech Tng Wg is granted 5 days ordinary lv of absence eff o/a 9 May 49. Upon expiration of lv Off will ret to proper Base and Orgn. 84. VOCG 3 May 49 authorizing S Sgt Marcus 0 Espinosa AF19290540 asgd (PP Pers-USAF) AFTRC 3499th Mobile Tng Sq 3499th Mobile Tng Gp to mess separately and reside off Military Reservation, are hereby confirmed and made a matter of record. (Auth: Par 21 AR 210-10.) 85. Add SSN-1091 awarded to C.:PT (4222) ALBERT D BYRNE A0747207 USAF asgd PL (Stu Pers-USAF) AFTRC 3350th Tng Sq (AMOT) 3345th Tech Tng Gp is heroby deleted off this dato. 86. Having rptd this Basc 4 May 49 in accordance w/Par 8 SO 83 Hq 78th Maint & Sup Gp Hamilton AF Base Calif 28 Apr 49 WOJG (4823) PAUL M MUDROCH AW950967 USAF is atchd PL (Stu Pers-USAF) AFTRC 3350th Tng Sq (AMOT) 3345th Toch Tng Gp w/(Dy SSN 2700) Stu Off for period of approx 4 weeks purpose of pursuing Ap & Eng Mech Specialized F-80C Transition Course No 747-C-3. (COMP - USAF) (Race - W). Upon compl of course Off will bc rold from atchd PL (Stu Pers-USAF) AFTRC 3350th Tng Sq (iMOT) 3345th Toch Tng Gp and from dy as Stu Off (Dy SSN 2700) eff o/a 2 Jun 49. 87. VOCG 3 May 49 granting TWOJG OSCAR T haZard AW950693 USA\\F AFTRC 3347th Tng Sq (Woa) 3345th Toch Tng Gp 7 days omerg lv of absence, are hereby confirmed and made a matter of record. Upon expiration of lv Off will ret to propor Base and Orgn. 88. Qrs at 17 Grove St Chapman Court are asgd to M Sgt James H. Beaver AF6916092 asgd (PP Pors-USAF) AFTRC Hq & Hq Sq 3499th Mobilc Tng Gp off 2 May -49 (Auth: Par 43 AR 210-10.) 89. Asgmt of ars at 65 Glendalo Road Chapman Court O CAPT ROBERT E GILL A039376 USAF asgd (PP Pors-USAF) AFTRC 3363rd Tng Sq (Advanced Courses) 3345th Toch Tng Gp is terminated off 3 May 49. (Auth: Par 42 AR 210-10.) 90. Qrs at 65 Glendalo Road Chapman Court are asgd to CWO-ROBERT J BILLINGS AW2125523 USAF css (PP Pors-USAF) AFTRC 3355th Tng Sq (Advancod Courses) 3345th Tech Tng Gp eff 4 May 49. (Auth: Par 40 AR 210-10. 91. 1ST LT (7314) JACK L WILT A01037781 USAF asgd (PP AFTRC Hq & Hq Sq 3345th Toch Tng Wg is awarded add SSN 2520 Mil Tng Off off this datc. R E S T R T- C T E D SO 122 Hq Chanuto AF Base and 3345th Tech Tng Wg Chanute AF Base Ill 4 May 49 Cont'd 92. CAPT (2161) CHA LLES E NC GEE A0807103 USAF atchd PL (Stu Pers-USAF) AFTRC 3350th Tng Sq (AMOT) 3345th Tech Tng Gp is awardod add SSN 2159 off this dato. of Fry SSN for MC GEE A0807103 USA1 atchd PL (Stu fr 2161 to 2159 is 94. So much of Par 7.S0 121 this hq cs portaining to 1st LT (4823) DIO P RITTENHOUSE A0865140 USAF reporting this Baso 2 May 19 in complianco-w/Pai 30 SO 101 Hq Chanuto AF Base and 3345th Toch Tng Wg Chanute AF Baso Ill 13 Apr 49 as reads: \"is atchd (PP-Pers-USAF) AFTRC 3346th Maint Sq (Fiold) 3345th Maint a Sup- ply Gp\" is amended to read: \"is atchd (PP Pers-USAF) AFTRC 3345th Sq anizational) 3345th Maint & Sup Gp\" 95. VOCG 25 Apr 49 changing the dy a8 shown of the fol named O asgd (PP Porsr ARWAF) AFTRC 3345th Sta Lod . od-Sq, are hereby confirmod and made a matter of record; FROM ASGD TO MAJ (3170) E as Off Dy as Chiof of Den- RUEDIGER 056812 DC Gcn dy (Dy SSN tol Clinic (Dy SSN 3170) 3170) CAPT (3100) EARL W Dy as Ward Off, Dy as Chicf of Out- LOWRY 01756993 MC Modical Sv (Dy pationt Sv (Dy SSN SSN 3100) 3100) CAPT (3430.) VIOLET R Dy as Asst Chiof Dy as Nurse General CAMPBELL N222 ANC Nursc (Dy SSN 3430) Dy (Dy SSN 3449) 96. Having been trfd this Base in compliance w/Par 5 SO 73 Dept of The hir Forco Wosh D. C 15-Apr 49 1ST LT (3449) LILLI N A GRAVIS N789580 ANC is asgd (PP Pors-ARWAF) AFTRC 3345th Sta Mod Sq w/(Dy SSN 0006) Off Enroutc. EDCMR: 2 May 49 Off not yet rptd. (COMP - RES) (Raco - w) 97. 1ST LT (3449) LILLIAN A GRAVIS N789580 ANC asgd (PP Pcrs-ARVAF) AFTRC 3345th Sta Med Sq rptd this Base 3 May 49. Dy C from Off Enrouto (Dy SSN 0006) to dy as Nurse Gon Duty (Dy SSN 3449 off 3 May 49. BY COMMAND .O BRIGADIER GENERAL MOORE: A B TENOLD Lt Col, USAF Adjutant A B TENOLD Lt Col, USAF Adjutant DISTRIBUTION: \"B\" R E S T R I C T E D RECORD OF EMERGENCY DATA HE ARMED FORCES OF THE RELATIONSHIP 8. AS A GUIDE IN ADMINISTERING LEG ATION G ERNING THE L-BEIN AND PROTECTION OF MY DEPENDENTS IN THE EVENT THAT I AM UNABLE TO MAKE PROVISION THEREFOR, IT IS MY DESIRE THAT FIRST NAME-MIDDLE INITIAL-LAST INITIAL NAME A. NECEIVE EACH MONTH OR OF MY PAY B. DOLLARS MONTHS GRATUITY PAY CHILDREN ADDRESS FIRST NAME-MIDDLE NAME-LAST NAME (Number, Street, City and State) arlent 11. IN TO THE THE EVENT DEPENDENT THAT AM RELATIVE NOT SURVIVED (other BY than A SPOUSE spouse OR ELIGIBLE or child) CHILD. SHOWN OR OF (one THEIR only). DECEASE (If OR designation DISQUALIFICATION of a BEFORE dependent PAYMENT relative IS MADE. is THEN declined, DESIGNATE state PAYMENT in your BE MADE own handwriting: \"I decline to designate any person to receive this pay.\") FIRST NAME-MIDDLE 12. IN THE EVENT OF DEATH OR DISQUALIFICATION OF THE LAST NAMED DEPENDENT RELATIVE. I THEN DESIGNATE AN ALT ATE DEPENDENT R LATIVE (other than spouse or child). (First name initial-Last name) SHOWN BELOW (on only). (If designation of an alternate is declined, designator must state in own hand- writing: \"I ecli to designate any person as alterna relat1 e to receive this pay.\") 13. I UNDERSTAND THAT THIS FORM DOES NOT DESIGNATE OR CHANGE LIFE POLICY BENEFICIARIES AND THAT ANY SUCH DESIGNATION CAN Y BE EFFECTED ACTION ORIGINATED BY M E. SUBSCRIBED AND SWORN TO BEFORE ME THIS DAY OF 19 SIGNATURE OF OFFICER ADMINISTERING OATH (First name-Middle initial-Last name NAME OF OFFICER ADMINISTERING OATH (Print or type) GRADE OR RANK SERVICE NO. ORGANIZATION (First ame-Middle initial-Last name) 1 Must be attested by an officer on active duty in the United States Armed Forces authorized to administer oaths or by a Notary Public. NME FORM NO. 1 OCT 48 93 REPLACES WD AGO FORM 41, 1 NOV 45. WHICH IS OBSOLETE. PRINTING OFFICE: 1948-O-808820 R E S T R I C T E D ARTERS AIR FORCE BASE and 3345TH TRAINING Chanute Air Base, Illinois SPECIAL ORDERS) 2 March 1949 NO. 60) EXTRACT 1ST LT PETER ROZDAY A0682902 USAF (OIC) MAJ LEOMARD T. ANDERSON A053497 CAPT CLARENCE J EDEN A0438481 USAF CAPT RODERICK E EWART A0687687 USAF CAPT GEORGE J FRANKOVICH A0752399 USAF CAPT .1RCHIE U GRANT A037699 USAF CAPT RANDALL GILPATRIC A01283584 USAF CAFT harry E HASKETT A049491 USAF CAPT HOWARD E NICHOLS 40675937 USAF CAPT CL.RRENCE B ODLE A0810934 USAF CAPT DAVID J SCHMERBECK A055476 USAF CAPT MAX A VAN AUSDAL A0735606 USAF CAPT THEODORE 0 1 RIGHT A047076 USAF 1ST LT I.ILLIAM H COOFER A0206157 USAF 1ST LT EARL t: GRAIG A0764244 USAF 1ST LT DONALD FRY JR A0714690 USAF 1ST LT JACK F SMITH A0750471 USAF 1ST LT MICHAEL J STROFF A0804422 USAF 1ST LT I.ESLEY F UIMBERLY A048670 USAF Tech CAPT CORTIS A A045732 USAF CAFT WARREN G HARDING 40663147 USAF MAJ EARL I. TETERS A0660799 USAF CAPT THEODORE H BROMAN 40433644 USAF CAPT HAROLD L WALKER 10520510 USAF C OT .ILLI^ a DAI. N A0725588 USAF 1ST LT CHARLES E COFFMAN A0413746 USAF 1ST LT DAVID T JENKINS A0713756 USAF 1ST LT ALLEN E KILE A01704121 USAF 1ST LT ERNEST I. SPITZER A0692902 USAF 0th ( CAFT FT.CHARLES E McGEE 40807103 USAF 1ST LT A0806609 USAF 1ST LT WILLIAM H CLARK A0696213 USAF 1ST LT IVAN R HENRY A0669721 USAF 1ST LT WILLIAM L SCOTT A0689379 USAF 1 R E S T R I C E D Par 72 SO 60 Hq Chanute AF Base and 3345th Tcch Tng lig Chanute AF Base Ill 2 Mar 49 (Cont'd) 1ST LT BURTON A DAVIS A038444 USAF Maint & 1ST LT EUGENE M SHADLE A0825305 USAF Any orders. portiining to the above Instrument Flt Examinor is hereby dissolved. A B TENOLD Lt Col, USAF OFFICIAL: Adjutant A B TENOLD Lt Col, USAF Adjutant DISTRIBUTION: \"BR R E S T R I C T E D HELDQUARTERS CHANUTE AIR FORCE B.SS and 3345TH TRAINING WING Chanute Air Force Base, Illinois SPECIAL ORDERS) 24 February 1949 NO. 54) 45. The fol named O Sq & Gp indicated are designated Instrument Flt Examiner in accordance /AF Reg 60-4 1 Nov 48. & 1ST LT PETER ROZDAY - A0682902 USAF (OIC) MAJ LEONARD W ANDERSON A053497 USAF CAPT CLARENCE J EDEN A0438481 USAF RODERICK E EVART A0687687 USAL CAPT GEORGE J FR.1NKOVICH A0752399 USAF CAPT .RRCHIE VJ GRANT A037899 USAF CAPT RAND.LLL GILPATRIC A01283584 USAF CAIT harry E HASKETT A049491 USAF CAPT HOUARD E NICHOLS A0675937 USAF CAPT CLARENCE B ODLE A0810934 USAF CAPT DAVID J SCHMERBECK A055476 USAF CAPT MAX A VAN AUSDAL A0735606 USAF CAPT THEODORE 0 LRIGHT A047076 USAF 1ST LT VILLIAM H COOPER 40206157 USAF 1ST LT EARL VJ CRAIG 40764244 USAF 1ST LT DONALD FRY JR A0714690 USAF 1ST LT JACK F SMITH A0750471 USAF 1ST LT MICHAEL J STROFF 40804422 USAF 1ST LT VESLEY F WIMBERLY A048670 USAF Tech CAPT CORTIS A CLARK A045732 USAF CAPT WARREN G HARDKING A0663147 USAF ea MAJ EARL A0660799 USAF CAPT THEODORE H BROMAN A0433644 USAF C.PPT HAROLD L WALKER A0520510 USAF CATT t. .ILLIAM A DAILSON 40725588 USAF 1ST LT CHARLES E COFFMAN 40413746 USAF 1ST LT DRVID T JENKINS A0713756 USAF 1ST LT ALLEN E KILE A01704121 USAF 1ST LT ERNEST T. SPITZER A0692902 USAF A0807103 USAF 1ST LT J HN B A0806609 USAF 1ST LT [.ILLIAM IJ CL.RRK A0696213 USAF 1ST LT IV.NN R HENRY A0669221 USAF 1ST LT WILLIAM L SCOTT A0689379 USAF R E S T R. I C T E D R E S T R I C T E D Par 45.S0 54 Hq Chanute AF Base and 3345th Tech Tng Wig Chanute AF Base Ill 24 Feb 49 (Cont'd) 1ST LT BURTON A :D:VIS kaint & 1ST:LT EUGENE M SH.DDLE A0825305 USAF BY COMMAND OF BRIG.LDIER GENERAL MOORE: A B TENOLD Lt Col, US.1F OFFICIAL: Adjutant A B TENOLD Lt Col, USAF Adjutant DISTRIBUTION: \"B\"I -.2 R E T F I C 'f E D R E S T R I C T E D HEADQUARTERS CHANUTE AIR FORCE BASE and 3345TH TECHNICAL TRAINING WING Chanute Air Forco Base; Illinois SPECIAL ORDERS) 28 January 1949 NO. 27) Change of 'dy SSN for the fol named 0 atchd PL (Stu lers) AFTRC 3350th Tng 3345th Tech Tng Gp fr 2700 to 4823 is directed eff this date. MAJ (2120) WILLIAM P CHATTAWAY 0439729 NG MAJ (4821) THOMAS K DICKINSON A053664 USAF MAJ (2121) CLAUD E FORD 'A036650 USAF MAJ (7536) RICHMOND L HAMILTON 01699508 NG MAJ (4823) JOHN D MALEDON A0463142 USAF MAJ (1035) JAMES R MUNRO JR 0731242 NG MAJ (4823) JOSEPH E O'BRYAN A051950 USAF CAPT (2162) JOHN R ARANT 0725571 NG CAFT (4823) DAVID H BELL A055022 USAF CAPT (4222) ALBERT D BYRNE A0747207 USAF CAFT (4821) HERBERT E CARTER A047324 USAF CAPT (1055) VINCENT E CASEY 0740741 NG CAPT (2120) CIRO CORSO A0581538 USA F CAPT (4821) HANNIBAL M COX A055882 USAF CAPT (1055) CLAYTON E DAVIS A054474 USAF CAPT (1051) JOHN E DEACY A0741246 USAF CAPT (1055) ALGER E DURELL A0762288 CAPT (1051) NED W FARR JR A0789697 USAF CAPT (4823) RICHARD L GORMAN 0824039 NG CAPT (1051) WILLIAM A HAMILTON 0681072 NG CAPT (1092) MARION H HAMMETT 01548825 NG CAPT (1014) RUSSELL C HOPF 0529031 NG CAPT (4823) WALTER B HUNTER A0568739 USAF CAPT (7536) LIONEL E HUPPE A0518608 USAF CAPT (1051) CHESTER C ISHMAEL A0678271 USAF CAPT (2161) GEORGE A JACOBI A0738163 USAF CAPT (1055) NORMAN H JACOBSON 0694163 NG CAPT (1051) ERLAND G JOHNSON 40704205 USAF CAPT (1055) EDWIN P JONES 02056050 NG CAPT (1055) JOHN L JONES 0661323 NG CAPT (1051) JOHN M KING 0793122 NG CAPT (1022) CLARENCE A LAKIN 0429077 NG CAPT (1051) THOMAS MANJAK A0694084 USAF C 2161 CHARLES E MC GEE A0807103_USAF - CAPT (4821) ROBERT H MORRISON JR A0742006 USAF CAPT (4823) EDMOND J PACKOWSKI A0569668 USAF CAPT (2161) FREDERICK L PARKER JR A01166345 USAF CAPT (1054) HUNTER D PARKER A047912 USAF CAPT (1059) JAMES B RAEBEL A047235 USAF CAPT (1056) CHARLES J RATAJSKI A0888793 USAF CAPT (1055) EARL 0 RUHLIN 0823511 NG CAPT (4823) EARL SEAY A0487926 USAF CAPT (4823) MARISHALL R SUTTER A052997. US/.F CAPT (2520 JOHN E TWEEDY A0581298 USAF CAPT (1024) CLYDE VERSLEY A0803910 USA'F E S T Par 104 SO 27 Hq Chanute AF Base & 3345th Tech Tng Wg Chanute AF Base Ill 28 Jan 41 Cont'd CAPT (1055) FRITZ S VILLINES A0704771 USAF CAPT (1051) DANIEL L WOMACK 0820625 NG 1ST LT (1051) FRANK W ALLEN A054707 USAF 1ST LT (4823) ARNOLD M ANDERSON A0590173 USAF 1ST LT (4823) FILANK K A055752 USAF 1ST LT (4823) E 0751239 NG 1ST LT (4823) W BAKER USAF 1ST. LT (7536) NG 1ST LT (4823) S A02095501 USAF 1ST LT (1051) JACK BELLAMY A056601 USAF 1ST LT (1081) FIEDERICK E BEMDER A0767975 USAF 1ST LT (1081) VIRGIL BRASHEASS JR A01313712 USAF 1ST LT (2120) LESLIE F BRAZELTON A055663 USAF 1ST LT (2161) ALBERT L BURNS 0663126 NG 1ST LT (2161) JOHN L BUTZ A0929854 USAF 1ST LT (4805) JOHN P CALL A0805566 USAF 1ST LT (6402) HEIMAN R CAMPBELL JR A0814041 USAF 1ST LT (1051) ANT'O ONY G CERSALE A056025 USAF 1ST LT (1093) EDMUND B CRANDALL A054556 USAF 1ST LT (2520) FRED J DETTMAN A0838835 USAF 1ST LT (1091) RUSSELL M DOBYNS A0809429 USAF 1ST LT (1051) GEORGE T DWYER A02083254 USAF 1ST LT (1024) RANDALL L FETTY A055557 USAF 1ST LT (1091) GEORGE A FISCHER 0826126 NG 1ST LT (0142) FOSTER F FRAZIER JR A02009154 USA,F 1ST LT (4823) GEORGE E GIFFIN A0551340 USAF 1ST LT (1055) WALTER M GREEN 0938233 NG 1ST LT (1051) GEORGE GRUBIC A0706848 USAF 1ST LT (1055) FREDERICK C HASLAM A0821706 USAF 1ST LT (1051) JAMES T HAYES A0795595 US.'.F 1ST LT (1051) DONALD 0 HEADRICK 02093871 NG 1ST LT (4902) CHARLES C HECKEL A041344 USAF 1ST LT (1051) IVAN R HENRY A0669721 USAF 1ST LT (4823) ROBERT N HIGGINS III A02085354 USAF 1ST LT (4821) HENRY HOFFS A0787814 USAF 1ST LT (1092) JOHN F HOPKINS A0704933 USA1F 1ST LT (2162) CLATUS T HORD A0684869 USA.F 1ST LT (1051) DAVID C HUGGETT 0747806 NG 1ST LT (2166) JAMES A HURD 401030158 USAF 1ST LT (1055) PAUL D JEWELL A02029330 USAF 1ST LT (4821) ALFIED G JIRKA A0709152 USAF 1ST LT (2110) JOSEPH J KARBIN A0935055 USAF 1ST LT (1055) MERLIN R KEHIVER 0886193 NG 1ST LT (2161) JOHN 0 KESSOCK A06-75434 USAF 1ST LT (4823) HAROLD H KINDER A0868019 USAF 1ST LT (4902) RICHARD H KOLLEN A0798144 USAF 1ST LT (2110) HOLDEN N KUHNS A0822025 USAF 1ST LT (4321) DELOSS L LAFON 40781898 USAA 1ST LT (1051) FRANK LEE A0835320 USAF 1ST LT (1051) WILLARD LEE 401696686 USAF 1ST LT (4821) EDGAR L LOWD n0781907 US/.F 1ST LT (1051) ROBERT S LUCY 4050454 USAF 1ST LT (1051) ROBERT L MASSEY 0767308 NG R E S T R I C T E D Par 104 SO 27 Hq Chanute AF Base & 3345th Tech Tng Wg Chanute AF Base Ill 28 Jan 49 Cont'd 1ST LT (0612) DAVID A MASTERS A0932921 USAF 1ST LT (1067 EUGENE T MAXWELL A0660779 USAF 1ST LT (1051) WOODSON L MAY A0767010 USAF 1ST LT (1054) KEANE B McGEE 0730148 NG 1ST LT (0200 USAF 1ST LT (1091) NOBERT A MITCHELL JR USAF 1ST LT (1055) SAMUEL M 0760430 NG 1ST LT (4823) LOUIS P USAF 1ST LT (2161) CALDWELL N 11 USAF 1ST LT (1055) THOMAS 0 QUINN 0797903 NG 1ST LT (1051) JOHN H RECHER A084745 USAF 1ST LT (1092) DONALD R SCHAFFNER A055821 USAF 1ST LT (1024) LOUIS A SCHOEN A0748258 USAF 1ST LT (4821) L SCOTT A0669379 USAF 1ST LT (4823) RUSSELL C SHERRY A0886394 USAF 1ST LT (4823) FRANK S SICO A0886016 USAF 1ST LT (4823) T SIMS JR A0714826 USAF 1ST LT (1054) ALBERT E SM!ITH A0762044 USAF 1ST LT (1058) PAUL A SMITH A048894 USAF 1ST LT (1059) ROBERT L SOWERS A0830350 USAF 1ST LT (1059) WALTER SZEELEY 40692722 USAF 1ST LT (2120) RICHARD L TEUFEL A02067382 USAF 1ST LT (1051) FRANK J TOME SEK A0696610 USAF 1ST LT (1051) ROBERT G URQUHALT 0686395 NG 1ST LT (4821) GABRIEL F VACCA A0544898 USAF 1ST LT (1051) GARLAND G VIRDEN A0715883 US/.F 1ST LT (4821) MILTON V WILLINGHAM JR A0772628 USAF 1ST LT (1051) HERMAN H WITTEN A0801100 USAF 1ST LT (4823) FLOYD L WRICH A0670703 USAF 1ST LT (1051) RICHARD A YOUNG A0816024 USAF 1ST LT (1051) GEORGE E YUNKER A0841248 USAF 1ST LT (2159) THEODORE ZAHA A02082783 USAF 2ND LT (1054) CHARLES C CALLAHAN 0841432 NG 2ND LT (1054) JOSEPH O COX 0946161 NG 2ND LT (1055) JOHN A GERBER A0716100 NG 2ND LT (1054) JACK L HIXSON 01903330 NG 2ND LT (1055) VICTOR C KELLY 0206 7853 NG 2ND LT (1092) STANLEY R OLEARCZYK A0939629 USAF 2ND LT (1055) JAY R WALLER 0947178 NG WOJG (4823) CARL W CONNELL AW2121640 USAF BY COMMAND OF BRIGADIER GENERAL MOORE: A B TENOLD OFFICIAL Lt Col, USA,F Adjutant A B TENOLD Lt Col, USAF Adjutant E S T R I C T E: D HEADQUARTERS CHANUTE AIR FORCE BASE 3345TH TECHNICAL TRAINING WING Chanuto Field, filinois SPECIAL ORDERS) 15 Docombor 1948 NO. 102) EXTRACT 75. MAJ PEDRO J BARTOLOME 016711 Philippine Arr Force, graduate of Acft Off Course TS TDTRC Chanute AF Chanute Fld Ill 14 48 is 1d fr atchd PL (Stu Pers) Tng Sq Tech Tng Gp Port of Embarkation San Calif o/a 23 Dec 48 in compliance No. 200 AGB6 300.4 Hq National Defense Forces Camp Murphy Quozon City 30 Jan 48, subj: \"\"Orders\". 76. The fol 0 3355th Tng Sq (Advanced Courses) 3345th Toch Tng Gp are granted ordinary lv of absence for number of days shown eff o/a date indicated. Upon exp- iration of lv 0 will ret to proper Base and Orgn. No of Days Date CAPT FLOYD W MOORE JR A040840 USAF 18 Dec 48 CAPT LASMONT V WOODRUFF A048646 USAF 12 23 Dcc 48 1ST lt KRNSST w SPITZER A0693902 USAF 4 25 Dec 48 1ST LT JOC S MONTGOMERY A0749290 USAF 5 27 Dec 48 1ST LT CHARLES E COFFMAN A0413746 USAF 13 22 Dec 48 1ST LT DALE L DARBY A037897 USAF 13 23 Dec 48 1ST LT DON F FAIR A02043125 USAF 13 22 Dec 48 1ST LT FREDERICK J SOMER A0804749 USAF 13 22 Dec 48 1ST LT ALLEN E KILE JR A01704121 USAF 13 22 Dec .48 1ST LT RUSSELL L HENDRICKSON A0677037 USAF 13 22 Doc 48 1ST LT DAVID T JENKINS A0713756 USAF 10 22 Dec 48 1ST LT MILO A RAIM A0749058 USAF 8 23 Dec 48 1ST LT CARL F WRIGHT A0562386 USAF 10 22 Dec 48 77. The fol 0 3350th Tng Sq (AMOT) 3345th Tech Tng Gp are granted ordinary lv of absence for number of days shown eff o/a date indicated. Upon expiration of lv 0 will ret to proper Base and Orgn. No of Date MA.T REN M ADAMS A053295 USAF 21 Dec 48 CAPT E A0807103 USAF 14 21 Dec 48 CAPT HANNIBAL' COX A055882 USAF 14 21 Dec 48 CAPT. A0741246 USAF 14 21 Dec 48 CAPT GEORGE A JACOBI A0738163 USAF 14 21 Dec. 48 CAPT HERBERT E CARTER A047324 USAF 14 21 Dec 48 CAPT WILLIAM M. CUNNINGHAM JR A0724902 USAF 14 21 Dec 48 CAPT FREDERICK L PARKER JR A01166345 USAF 14 22 Dec 48 CAPT CHESTER C ISHMAEL A0678271-USAF 14 21 Dec .48 CAPT ROYAL H GRUBB A054649 USAF 14 21 Dec. 48 CAPT DUDLEY E FRIDAY A0805901 USAF 13 22 Dec 48 CAPT CHESTER M DROPP A0506737 USAF. 14 21 CAPT ALBERT D BYRNE A0747207 USAF 14 21 Dec 48 CAPT T.WILLIAM P BONELLI A0768425 USAR; 14 21 Doc 48 CAPT JANES B RAEBEL 1047235 USA.F 14 21 Dec- 48 CAPT ROBERT H MORRISON JR A0742006 USAF 12 23 Dec 48 CAPT NILLIAM H SHORE A0729914 USAF 14 21 Dec 48 CAPT WILTON E NYCHE A0729401 USAF 14 21 Dec 48 CAPT FRITZ S VILLINES A0704771 USAF 14 21 Dec 48 CAPT GARLAND G JOHNSON A0740205 USAF 9 26 Dec 48 -1- R E S T R I C T Par 77 SO 102 Hq Chanute AF Base & 3345th Tech Tng W- Chanute Fld Ill 15 Dec 48 Cont'd No S Date CAPT DELBERT H ELLIS A0532169 USAF 21 Dec 48 CAPT LESLIE H JOHNSON A0559187 USAF 7 23 Dec 48 1ST LT GEORGE GRUBIC A0706848 USAF 14 21 Dec 48 1ST LT HENRY HOFFS A0787814 USAF 14 21 Dec 48 1ST LT ROBERT L SOMERS A0830350 USAF 10 24 Dec 48 1ST LT GORDON A LiTHROP A0749009 USAAF 14 21 Dec 48 1ST LT FRANK LEE A0835320 USAF 14 21 Dec 48 1ST LT GABRIEL F VACCA A0544898 USAF 14 21 Dec 48 1ST LT GARLAND S VIRDEN A0715883 USAF 14 21 Dec 48 1ST LT JOE C WILLIAMS A054098 USAF 14 21 Dec 48 1ST LT JOHN 0 KESSOCK A0675434 USAF 14 21 Dec 48 1ST LT JOSEPH J KARBIN 4,0935055 USAF 12 22 Dec 48 1ST LT FREDERICK E BENDER A0767975 USAF 7 21 Dec 48 1ST LT BILLY VV HOWELLS A02024581 USAF 14 21 Dec 48 1ST LT FRANK J TOMESEK A0696610 USAF 13 22 Dec 48 1ST LT ROBIN H THEUER A0544905 USAF 14 21 Dec 48 1ST LT LLOYD W McINTIRE A0705735 USAF 12 22 Doc 48 1ST LT EDWIN K KIRSCHNER A0805068 USAF 14 21 Dec 48 1ST LT RUSSELL J ROSSMAN A056357 USAF 13 22 Dec 48 1ST LT JACK ATHERTON A043411 USAF 14 21 Dec 48 1ST LT GEORGE E GIFFIN A0551340 USAF 14 21 Dec 48 1ST LT GEORGE E HEDGE A056418 USAF 14 21 Dec 48 1ST LT WALTER SZEELEY A0692722 USAF 14 21 Dec 48 1ST LT ALBERT E SMITH A0782041 USAF 13 22 Dec 48 1ST LT FRANCIS S MUELLER A0711782 USAF 14 21 Dec 48 1ST LT THEODORE ZAHA JR A02082783 USAF 10 24 Dec 48 1ST LT ALFRED G JIRKA A0709152 USAF 14 21 Dec 48 1ST LT HOLDEN N KUHNS A0822025 USAF 14 21 Dec 48 1ST LT WILLIAM W CLARK JR A0696213 USAF 13 22 Dec 48 1ST LT L FETTY A05555 USAF 14 21 Dec 48 1ST LT FRANK S SICO A0886016 USAF 14 21 Dec 48 1ST LT JOHN E VEST A0715880 USAF 10 22 Dec 48 1ST LT FOSTER F FRAZIER A02009154 USAF 14 21 Dec 48 1ST LT FLOYD L A0670703 USAF 13 21 Dec 48 1ST LT DAVID A MASTERS A0932921 USAF 13 21 Dec 48 1ST LT FRANK W ALLEN A054707 USAF 14 21 1.Dec 48 1ST LT MURRAY W BAKER A0819665 USAF 14 21 Dec 48 1ST LT VIRGIL BRASHEARS JR A01313712 USAF 14 21 Dec 48 1ST LT HERMAN R CAMPBELL A0814041 USAF 14 21 Dec 48 1ST LT IVAN R HENRY A0669721 USAF 14 21 Dec 48. 1ST LT WILLARD LEE A01696686 USAF 14 21 Dec 48 1ST LT ROBERT C MIZE JR A0782592 USAF 14 21 Dec 48 1ST LT DELMAR D McGOWAN A0693804 USAF 13 22 Dec 48 1ST LT RICHARD A YOUNG A0816024 USAF 14 21 Dec 48 1ST LT CHARLES F WRIGHT A054859 USAF 14 21 Dec 48 1ST LT FREDERICK C HASLAM A0821706 USAF 14 21 Dec 48 1ST LT JAMES A HURD A01030158 USAF 13 22 Dec 48 1ST LT CH/RRLES S RATHBUN A0545618 14 21 Dec 48 1ST LT DOMALD R SCHAFFNER A055821 USAF 14 21 Dec 48 1ST LT EUGENE T MAXWELL A0660779 USAF 13 22 Dec 48 1ST LT WOODSON L MAY A0767010 USAF 14 21 Dec 48 1ST LT GEORGE E YUNKER 40841248 USAF 14 21 Dec 48 1ST LT HERMAN H WITTEN A0801100 USA.F 14 21 Dec 48 E S T R I C T E D R E S T R I C T E D Par 77 SO 102 Hq Chanute AF Base & 3345th Tech Tng Wg Chanute Fld Ill 15 Dec Cont'd Date 1ST LT CHARLES E KERR A02092292 USAF 1ST LT KENNETH H L GAFFEY A0792223 USAF 14 21 Dec 48 1ST LT EDMUND B CRANDALL A054556 USAF 13 22 Dec 48 1ST LT JOSEPH D LOEFFLER A0749677 USAF 14 21 Dec 48 1ST LT ROBERT A MITCHELL A0834092 USAF 14 21 Dec 48 2ND LT ARNOLD M ANDERSON A0590173 USA\\F 13 22 Dec A B TENOLD Lt Col, US :F Adjutant A B TENOLD Lt Col, USAF Adjutont DISTRIBUTION, \"B\" R E S T R I C T E D EPARTMENT OF THE ARMY OFFICE OF THE ADJUTANT GENERAL WASHINGTON 25, D. C. AGSO-A 201 15 November 1948 SUBJECT: Appointment as Warrant Officer (junior grade), US Air Force TO: Captain Charles E. Mc Gee, A0-807103 1. You have been selected for appointment to the grade of warrant officer (junior grade), United States Air Force, upon honorable termi- nation of active duty as a commissioned officer. Your date of rank as a warrant officer (junior grade) will be 15 November 1948. 2. This appointment will be made at any time within six months after termination of active duty on written request to the Chief of Staff, United States Air Force, Washington 25, D. C., irrespective of physical disqualification incurred or having its inception while on active duty in line of duty. BY ORDER OF THE SECRETARY OF THE ARMY: FL 481 A 48 20496 and 3345TH TECHNICAL TRAINING WING Chanute Field, Illinois SPECIAL ORDERS) 26 October 1948 NO. 52) EXTRACT 31. The fol Named 0 Sq & Gp indicated are designated Instrument Flt Examiner in add to their other dutys. (Auth: AF Reg 60-4, 25 hug 47.) & 1ST LT WESLEY F WIMBERLY (OIC) 4048670 USAF MILJ LEONARD IF ANDERSON 4053497 USAF CAPT CLARENCE J EDEN 40438481 USAF CAPT RODERICK E EWART 4068768,7 USAF CAPT ARCHIE W GRANT 4037899 USAF CAPT HARRY E HASKETT A049491 USAF CAPT HONARD E NICHOLS 40675937 USAF CAPT CLAPENCE B ODLE 40810934 USAF CAPT DAVID J SCHMERBECK 4055476 USLE CAPT MAX & VAN AUSDAL A0735606 USAF 1ST LT DONALD FRY JR 40714690 USAF 1ST LT HATRY L ROTHMAN A0705052 USLF 1ST Lt PHE ROZDAY 40682902 USAF 1ST LT JACK F SMITH 10750471 USAF 1ST LT J STROFF 40804422 USAF 1ST LT THEODORE 0 !RRIGHT 4047076 USAF*. Tng So (We1) CAPT CURITIS is CLARK 40712377 USAF CAPT WARREN G HIRDING 40663147 USAF 3348th Tng Sq (Tiea, MAJ EARL t. PETIRS 40660799 USAF CAPT THEODORE H BROMAN CAPT HAPOLD L WALKER 40520510 USAF 1ST LT LOUIS K HEGEMAN 402085776 USAF 3349th Tng Sa CAMCT) 40725588 USAF 1ST LI E COFFMAN 40413746 USAF 1ST LT WILLIAM COOPER 40206157 USAF 1ST LT DAVID T JENKINS 40713756 USAF 1ST LT AL, E KILE 401704121 USAF 1ST LT EFNLST W SP ITZER 40692902 USAF 3350th Tng Sa AMOT CATT DUDLEY E FRIDAY 40805901 USAF CAPT CHARIES E McGEE A0807103 USAF 1ST LT JOHN B. 40806609 USAF 13T LT T. ILLIAM CLARK 40696213 USAF 1ST LT WILLIAM L SCOTT AC689379. R E S T R I C T E D Par 31 SO 52 Hq Chanute AF Base & 3345th Tech Tng Wg Chariute Fld Ill 26 Oct 48 Cont'd d) 1ST LT 4 DAVIS 1038444 USAF & & 1ST LT EUGENE M SHADLE Any orders pertaining to: the above are hereby dissolved. 32. VOCG 16 Oct 48 fol named Pers asgd (PP Pers-USAF) Sq ind- icated 3499th Mobile Tng Great Falls AF Base Great Falls Montana thence to Spokane AF Base Wash by mil acft on TDY for period of approx 5 days purpose to transport Pers and Equip F82-1 MTU to Great Falls AF Base Great Falls Montana and transport Mobile Tng Gp Pers to Spokane AF Base and upon compl of required TDY to ret to proper Basc, are hereby confirmed and made a matter of record, the exigencies of the SV having been such as to preclude the issuance of properly written orders in advance: & 1ST LT WILLIAM D JR 4038483 USAF T Sgt Charlos E Robinson Jr AF19208063 1ST LT GEORGE E USAF CIPAP. Provisions of AR 35-4820 will apply for 0. Provisions of AR 35-4810 and AFR 173-5 dtd 1 Jun 48 will apply for EM who tvl by mil acft. (Tvl incident to transportation of F82-1 MT U to Great Falls AF Base Great Falls Montana TBMAA. TDN. 901-229 P 433-02 2190425 S99-999..) Budget & Fiscal 0 this Base certifics that available balance of funds chargeable to accounting classification shown herein is sufficient. Fin 0 making pmt against this order will fwd a copy of the pd you to Budget & Fiscal 0 this Base. Vouchers for reimbursement under this order must be submitted to a Fin 0 within 30 days. (Tvl and Per Diem incident to transportation of Mobile Tng Gp Pers to Spokane AF Base Spokane Wash - TBMAA. TDN. 902-7202 P 432-02 2190425 S 11-068 (BFO 510-3). (Auth: TD Reg 35-22 dtd 30 Jan 47 and 2nd Ind AG (T) 370. 5 Hq TDTRC Scott AF Base Ill 5 Oct 48 to Ltr AGAO-I 370.5 (22 Sep 48) CSGSP-M Depts: of the Army & Air Force Wash DC 27 Sep 48, subj: \"Movement Directive, Air Eche lon, Ship- ment 0551\". BY COMMAND OF BRIGADIER GENERAL UPT EGROVE: RAYMOND CAUSA 1st Lt, USAF OFFICIAL: Asst Adjutant RAYMOND CAUSA lst Lt, USAF Adjutant R S T R I C T E D DISTRIBUTION: \"B\" R E S T R I C T E D Par 10 SO 55 Hc Chanute Base & 3345th Tech Tng Wig Cha  te Fld I11 29 Oct 48 Conth d Tech Hg & Sg 1ST LT ROBERT 0 BROCKMAN A0687671 USAF (B-25) 1ST LT MARSHALL R DUNCAN A038413 USAF (C-47) 3345th CAPT CORTIS A CLARK A0712377 USAF (B-25, C-47) 1ST LT HAMES M BURKHART A0774518 USAF (B-25) MAJ EARL W 40660799 USAF (C- B-25) CAPT RAYMOND 0 DELAHOUSAYE A0670367 USAF (c-47) CAPT Vi, ILLIAM L DOTSON 40663760 USAF (B-25) CAPT ARTHUR C KULLIN 40749006 USAF (B-25) CAPT HAROLD L WALKER 40520510 USAF (C-47) CAPT GEORGE A WRIGHT A0433766 USAF (B-25) 1ST LT COLBY J BOUSFIELD 40818266 USAF B-25) 1ST LT LOUIS K HEGEMAN 402085776 USAF 1ST LT WILLIAM J MOORE A01998964 USAF (B-25) 2ND LT WELTON R KING 40775993 USAF (C-47) 1ST LT WILLIAM L SCOTT A0689379 USAF (B-25) 3349th Tng Sg (AMOT) C.,P! WILLIAM A DAWSON 40725588 USAF (B-25) 1ST 1.0 GUY H ABLE 40680328 USAF ** (B-25) 1ST 1/t CHARLES E COFFMINN 40413746 USAF (B-25) 131 WILI H COOPER 40206157 USAF - B-25) 1St LIF LOKILD F FAIR 402043125 USAF 1ST In .CHONGE D FRENCH 40778113 USAF (B-25, T-6) 1ST L: HOLTZ 40780599 USAF (B-25) lst 1/2 r JENKINS 40713746 USAF (C-47, B-25) 1ST GLE F KILE 407704121 USAF 40749290 USAF (B-25) 1ST DACER G MOORE A0742197 USAF (B-25) 1ST LT FRNKST Will SPITZER 40692902 USAF (C-47, B=25) A0805901 USAF (B-25) 40807103 US.1F (B-25) 40806609 USAF (C-47) ist ji?: W CLARK 60696213 USAF (B=25) 1st THE T HAYES 40795595 USAF (C-47) 1SI W HCWELLS 402024581 USAF (C-47) 1ST 1,T FRANK LEE 40835320 USAF (B=25) 1ST LT WILLARD LEE 401696686 USAF (C-47) 1ST LT L LORD A081907 USAF T-6) 1ST LT WOODSON L MAY A0767010 US&F (B=25) -2- S T R I C. T. E: D HEADQUARTERS CHANUTE AIR FORCE BASE and 3345TH TECHNICAL TRAINING WING Chanute Ficld, Illinois SPECIAL ORDERS) 2 9 Octobor 1948 NO. 55) EXTRACT 10, The fol named 0 Sq & Gp indicated are designated Instructor Pilots (IP in type acft indicated in add to their other dys: Trig Wg MAJ LEONARD U ANDERSON 4053497 USAF CAPT CLARENCE J EDEN A0438481 USAF CAPT RODERICK E EVART A0687687 USAF CAPT RANDALL GILPATRIC A01283584 USAF CAPT ARCHIE W GRANT 40759591 USALF CAPT harry E HASKETT 4049491 USAF CAPT HOWARD E NICHOLS 40675937 USAF CAPT CLARENCE B ODLE 40810934 USAF CAPT DAVID J SCHMERBECK 4055476 USAF CAPT MAX L VAN AUSDAL A0735606 USAF 1ST LT DONALD FRY JR A0714690 USAF 1ST LT FRED J KOREN 40206004 USAF 1ST LT HARRY L ROTHMAN 40705052 USAF 1ST LT PETER ROZD&Y 40682902 USAF 1ST LT JACK F SMITH 40750471 USWF 1ST LT JOHN, S VESTAL A0887131 USAF 1ST LT WESLIYY F WIMBERLY 4048670 USAF 1ST LT THEODORE 0. 604.7076 USAF Air Base Hg & Hq Sg 1ST LT WILLIAM A NUGENT A0803039 USAF 1ST LT ROY LANCASTER A0827850 USAF Sv CAPT GEORGE R BRENDLE A0687288 USAF (C-47, B-25)- tion CAPT SVEN E WALLIN A0738303 USAF 1ST LT EUGENE M SHADLE A0825305 USAF R E S T R I C T E D Par 10 SO 55 Hq Base & 3345th Tech Tng VIg Fld I11 29 Oct 48 h - , Tng Sq LT & DAVIS A038444 USAF 7 n5) 1ST LT JOHN E VEST A0715880 USAF (B-25) CAPT WAYNE E HERMAN 4055404 USAF (B-25) Courses) 1ST LT SIDNEY K RICHARDSON 4054885 USALF (B=25) 3363d 1ST LT EARL W CRAIG 40764244 USAF (B-25) BY COMMAND OF BRIGADIER GENERAL UPTHEGROVE: RAYMOND CAUSA lst Lt, USAF lsst Adjutant OFFICIAL: R E S T R I C T E D CIAANUTE AIR FORCE BASE and 3345TH TECHNICAL TRAINING WING Chanute Field, Illinois SPECIAL ORDERS) 4 October 1948 NO. 32) EXTRACT 47. The fol. named 0 atchd PL (Stu Pers-USAF) 3348th Tng Sq (Wea) 33!15th Tech Tng Gp are reld fr atchd thereto and are reld fr dy as Stu 0 (Dy SSN 2700) and are trfd to atchd PL (Etu Pers-USAF) 3350th Tng Sq (AMOT) 3345th Tech Tng Gp w/dy as Stu 0 (Dy SSN 2700) EDCMR: 4 Oct 48. Present courses of- attendance will remain in effect. 0 listed below are DS this Base fr Bases indicated. MAJ (1:821) THOMAS K DICKINSON A053664 USAF - Orlando AF Base Orlando Fla. CAPT (1051) CHESTER C ISHMAEL A0678271 USAF - Hamilton AF Base Hamilton Fld Calif. 2161 A0807103 USAF - Lockbourne AF Base Columbus Ohio 1ST LT (1051) FRANK W A054707 USAF - Mitchel AF Base Mitchel Fld NY, 48. DP CAPT (3170) LOUIS A ALESSIO 01756029 DC AUS is reld fr asgd (PP Pers-. ARWAF) 3345th Med Sq Sta Hosp 3345th Tech Tng Wg Chanute AF Base Chanute Fld Ill is reld fr AD 5 Oct 48 and reverts to inactive status not by reason of physical dis ability. Home address at time of entry on AD: 1647 South Wisconsin Avenue Berwyn Ill. Home Address: 2104 51st Avenue Cicero Ill. Off is entitled to lump sum pmt for forty-one (41) days accrued lv, WD AGO Form 53-98 is auth. hus apmt vill con- tinue in force during present emerg plus six (6) months unless sooner terminated DP. EDCMR: 5 Oct 48. PCS. TDN. 901-22-222 P 431-02 03 07 2190425 S99-999. (Auth: `AFTRC Ltr 35.-30 and RR 1-.1 as amended Expiration of Category commitment and TWX EF03215 Hq AFTRC Barksdale AF Base Barksdale Fld La dtd 17 May L8.) 49. So much of Par 6l4 SO 29 this Hq cs as reads: \"Pfc (677) James Jones Jr AF16252904\" is amended to read: \"Pvt (677) James Jones Jr AF16252904\" (Re: Pro- motion of EM asgd (PP Pers-USAF) 3345th Base Sv Sq 3345th Air Base Gp to grade of Corporal (Perm). 50, The fol named EM asgd (PP Pers-USaF) Sq indicated 3345th Air Base Gp will be disch the SV eff 5 Oct 48 under provisions of AR 615-360 (ETS). EM auth tvl pay to place of acceptance for. enlmt or home. EM auth pay and alws for number of days accrued lv as indicated. WD AGO Form 55 will be furnished. PCS. TDN. 901-35-235 P 431-02 03 07 2190L155 899-999. Sq-Rank-MOSName-AFSN Home Accrued Lv S J Roberts 603 North 4th Street 41 AF37654696 Oskaloosa I wowa (County Unk) 401 East Hill Street 18 Champaign Illinois (Champaign County) 51. So much of Par 34 SO 30 this Hq, cs. as reads: \"lst Sgt John Meade AF20218494 3345th Sup Sq 3345th Maint & Sup Gp\" is amended to read: \"T Sgt John Meade AF20218494 3345th Sup Sq 3345th Maint & Sup Gp\". (Re: Lsgmt of ars at 55 Glendale Road Chapman Court.) 1 R T R D SO 32 Hq Chanute AF Base & 3345th Tech Tng Wg Chanute Fld Ill 4 Oct 48 Cont'd. 52. Cpl (055) Julia M Tanaka A618794 asgd (PP Pers-ARWAF) 3345th WAF Sq 3345t? Air Base Gp vill be disch the S V eff 5 0ct L.8 under provisions of AR 615-365 (Convn of the Govt). WD AGO From 55 will be furnished. EW auth tvl pay to place of acceptance.If enlmt or home. EW auth pay and alws for twenty-fi (25) days accrued lv. Home Address: 2531 Stout Street Denver (County Unk) Colo. PCS. TDN. 901-23 P 431-02 2190425 S99-999. 53. Having reported this Base 3 0ct 48 in compliance w/Par 20 SO 30 Hq 43d Bomb Wg Davis-Monthan AF Base Tucson Ariz 13 Sep 43, 1ST LT (1081) FREDERICK E BENDER A0767975 USAF is atchd FL (Stu Pers-USAF) 3350th Tng Sq (1MOT) 3345th Toch Tng Gp w/ (SSN 2700) Stu Off for period of approx 40 weeks purpose of pursuing Acft Maint 0 Tng Course No. 48230. 54. Having reported this Base 4 Oct 48 in compliance v://Par 4 SO 14 Hq 2232d AF Res Tng Conter Stevart Fld Newburgh NY 21 Sep 48, 1ST LT (2161) JOHN 0 KESSOCK 406754.34 USAF is atchd PL (Stu Pers-USAF) 3350th Tng Sq (:MMI).) 3345th Tach Thg Gp (SSN 2700) Stu Off for period of approx 40 weeks purpose of pursuing Acft Maint 0 Tng Course No. 48230. 55. Each of the fol named EM Sq indicated is granted ordinary lv of absence unless othervise indicated for number of days shovn eff o/a date indicated. No of Date - Hq & Hq Sq 3345th Air Base Go M Joseph W AF 6249347 4 Oct 48 3345th Instls Sq 3345th Air Base G p  Cpl M 14; Oct 48 3345th Air Police $q 3345th Air Base Gp S Sgt 4 11 Oct 48 Pfc Gerald S Duncan 10-Emorg 4 Oct 48 Hq & Hq. Sq 3345th-Te Tech Tng Gp Oscar AF 7030854 30 11 Oct 48 3355th Tng Sq (Advanced Courses) 3345th Tech Tng Gp Charles Jr AF18291 5 Oct 48 3346th Maint Sq (Fld) 3345th Maint & Sup Gp M 15 Oct 48 3345th Transportation Sq 3345th Maint & Sup Gp Cpl Donald M 4 Oct 48 BY COMMAND OF BRIGADIER GENERAL UPTHEGROVE: OFFICIAL: RAYMOND CAUSA lst Lt, USAF Asst Adjutant. CAUSA 1st Lt, USAF Asst Adjutant. DISTRIBUTION: \"B\" R T R I C T E. D R I C E D HEADQUIRTERS CHANUTE AIR FORCE BASE SPECIAL ORDERS) Chanute Field, Illinois NO. 198 EXTRACT 23 August 1948 43. VOCG 21 Aug 48 authorizing S Sgt Carl J Simila AF36161194 asgd (PP Pers- USAF) Sq B-3 3502d AF Base Unit (TS) to mess separately and reside off Military Reservation, are hereby confirmed and made a matter of record. (Auth: Par 21 AR 210-10.) 44. VOCG 20 Aug 48 authorizing the fol named EM So indicated 3502d AF Base Unit (TS) to mess separately and reside off Military Reservation, are hereby conf- irmed and made a matter of record, (Auth; Par 21 AR 210-10.) , T Sgt James M Hayhoe AF6931366 asgd (PP Pers-USAF) Sq K-2 M Sgt Alexander J Santanni RA6912712 asgd (PP Pers) 3a E Cpl Paul G Baker AF16140222 asgd PL (Filler Pers-USAF) Sq A-3 M Sgt Maurice S Walters AF33505586 atchd PL (Stu Pers-USAF) Sq TQ-1 Pfc Bernard J Nedervelt AF16225676 asgd PL (Stu Pers-USAF) Sq TN-1 45. Having rptd this Base 11 Aug 48 in compliance w/Par 45 SO 126 Hq Dept of The Army 23 Jun 48 CAPT (Unk) TACK M MacGREGOR 4037964 USAF is atchd PL (Stu USAF) Sq TO-1 3502d AF Base Unit (TS) (SSN 2700) Stu Off purpose of pursuing Maint 0 Course #48230. EDCIR: 5 Sept 48. Eff 5 Sept 48 Off will be reld fr atchd PL (Stu Pers-USAF) Sq TO-1 3502d AF Base Unit (TS) and ill be asgd PL (Stu Pers- USAF) Sq TO-1 3502d AF Base Unit (TS). 46. Having rptd this Base 22 Lug 48 in w/Par 48 SO 226 Hq Keesler AF Base Keesler Field Miss 13 Aug 48 1ST LT RICHARD J PARTINGTON 40586315 USAF is atchd PL (Stu Pers-USAF) Sq TO-1 3502d AF Base Unit (TS) w/ (SSN 2700) Stu Off for period of approx 24 weeks purpose of pursuing Wea Survey & Engr 0 Course No. 83053. EDCMR: 24 Aug 48. Eff 24 dug 48 Off will be reld fr atchd PL (Stu Pers USAF) Sq TO-1 3502d AF Base Unit (TS) and will be asgd PL (Stu Pers-USAF) Sq TO-1 3502d AF Base Unit (TS), 47. Having rptd this Base 23 Aug 48 in compliance w/Par 2 SO 146 Hq 332d Fighter Ng Lockbourne AF Base Columbus Ohio 16 Jul 48 CAPT McGEE USAF is atchd PL (Stu Pers-USAF) Sq TO-1 3502d AF Base Unit (TS) 2700) Stu Off for period of approx 40 weeks purpose of pursuing Acft Maint 0 Course No. 48230. 48. CH (CAPT) DANIEL J BORMANN 0505890 ChC asgd (PP Pers) Sq 4-1 3502d AF Base Unit (TS) rptd this Base 20 luug 48. Dy SSN C fr (0006) Off Enroute Line 19bA-] Ineff 20 Aug 48. to dy as Chaplain (SSN 49. Having rptd this Base 23 Aug: in compliance 7 SO 27 Hq 52A Ftr Wg Mitchel &F N 16 Jul 48 1ST LT (1051) 'FRANK W ALLEN 4054707 USAF is atchd PL (Stu TO-1 3502d AF Base Unit (TS) (SSN 2700) Stu Off for period of approx 40 weeks purpose of pursuing Acft Maint 0 Course No. 48230. 50. Change of dy SSN for 1STVLT (D3139) MERTON J KAHNE 01757119 MC asgd (PP Pers) Sq E 3502d AF Base Unit (TS) f. 3139 to 0001 no dy asgmt is directed eff 25 hug 48. T R I C T E D R E S T R I C T E D SO 198 Hq Chanute AF Base Chanute Fld I11 23 Aug 48 Cont'd 51. VOCG 5 Aug 48 directing 1ST LT ROBERT C McCORMICK A0937281 U'SAF asgd (PP-Pers-USAF) Sq K 3718th AF Base Unit (NTU) to procoed fr TDY at Spckano AF Base Spokane Wash to Chanute AF Base Chanute Field Ill by mil acft purpose t D ret fr TDY to proper Base awaiting further asgmt, are hereby confirmed and made a matter of record, the exigencies of the SV having been such as to preclude the is suance of properly written in advance. Provisions of AR 35-4820 will apply. Budget & Fiscal 0 this Base certifies that balance of funds chargeable to accounting classification shown herein sufficient. Fin .0 pmt against this order a copy of the (pd vou to Budget & Fiscal this Base. Vouchers for reimbursement under this order must be submitted to a Fin 0 within 30 days. TBMAA. TDN. 902-7202 P 432-02 2190425 S11-068 (BFO 225-1). (Auth: TD Rog 35--22 dtc 30 Jan 47.) OFFICIAL: RAYMOND CAUSA 1st Lt, USAF Asst Adjutant DISTRIBUTION: \"B\" R E S T R I C T E D HEADQUARTERS 332D AIRDROME GROUP 332D FIGHTER WING Lockbourne Air Force Base Columbus 17, Ohio 21 August 1948 SUBJECT: Commendation TO: Captain Charles E. McGee, AO 7103 Headquarters & Headquarters Squadron 332d Airdrome Group, 332d Fighter Wing Lockbourne Air Force Base Columbus 17, Ohio 1. I am pleased to commend you for outstanding performance of duty in connection with your work as officer in charge of Military Training for this group. The effectiveness of your supervision, the thoroughness of compliance with regulations as brought out in our recent Annual General Inspection, reflects credit upon you and those associated with you in this work. 2. Your initative, attention to duty, and ability to work long hours, until the task is completed, is deeply appreciated. I believe you have demonstrated that this group is indeed fortunate to have you as one of its officers. I sincerely hope that the above example of outstanding devotion to duty will continue to reflect itself in your future work. 3. This correspondence will become a part of your permanent 201 file. W. WEBB ajor, USAF Commanding LAAB Form # 18 HEADQUARTERS 318TH AF NIT (ASSEMBLY PROCESSING AND PARATION) OCKBOURNE AIR FORCE BASE Columbus 17, Ohio Organization) This form will be completed in duplicate, signed by the Officer clearing and presented to the Wing Adjutant, are reminded that an who this certificate without all his or her_accounts at this station will be held for a false official officers will procure SIGNATURES at all places listed in table \"A\", all rated and non-rated officers whose duties involve flying will procure SIGNATURES at all places listed in table \"B\", Squadron Commanders and Supply Officers (Station Organization, and Technical) will procure in table \"C\", Custodians of Unit Funds and similar funds will procure in table \"D\" Flight Surgeon Registrar A3 Medical Supply Ordnance Supply General Supply A/c Supply PIO TABLE \"p\" . RATED AND OTHERS WHO FLY OFFICE BLDG OFFICE Airdrome Operations Personal Equipment TABLE \"C\" COMMANDERS AND BLDG Air Installations T-421 TABLE \"D\" ALL CUSTODIANS F NDS BLDG OFFICE Air Inspector. T- Budget and Fiscal ERTIFICATE R T I F I I hereby certify that I have turned in all property issued to me at this station, that I an not indebted to any agency or department at this station, that I turned over all public funds for which I am responsible, and that I have made arrangements to settle all private indebtednesses incurred during my sta 20 (Date (Upon completion of clearance, certificate must be signed by the Wing Adjutant or Assistant Adjutant and one copy turned in to Officers' Section Bldg T-1) *Only for officers' being separated, The above named R E S T R I C T E D 2260TH AIR BASE SQUADRON LCCKBOURNE AIR FORCE BASE Columbus 17, Ohio 27 July 1919 SPECIAL ORDERS) NUMIBER 22) EXTRACT R * TFN O's USAF this orgn this sta (ConAc)(P/P) are reld fr asgd hereto trfd & asgd TPP on dates indicated to orgns indicated rptg thereat NLT dates in- dicatod, 0's auth delay enroute as indicated, chargeable to accrued lv, plus number of ofl tvl time indicatod. EDCIR as indicatod PCS PCA TPA TO will furn T if requested, TDN 5704500 060-204 P534-02 00 S99-999. (Auth: Ltr De. Subj: Reasgnt of O's, dtd 21 Jul 49) TO: 93rd B crib Ug, Castle if, EDCITR 10 Aug 49 CAPT 9260 CLARENCE C A0783120 (Pilot-ratod, on flying status FSC 16 Ret US 24 Mar 44, Comp USAFR) (SAC emorg regn dtd 10 Jun 49, Page 17, Line 46, 6201) .JP 5 Aug 49. Auth thirty (30) days delay enrouto plus ten (10) days of1 tvl time rptg ILL 14 Sop 49 TO: 3415th Tech Tng AFB, Denver, O, EDCITR 10 Aug 49 1ST LT 1054 LECIARD F TURNER A0807110 (Pilot-ratcd, on flying status FSC 12 Ret US 21 Dec 46, Comp USAFR) Off to perform OJT in MOS 9500 pricr to attonding Air Intelligonce 0's Crse commencing 4 Jan 50. WP 2 Aug 49. Auth ton (10) days de- lay enroute plus five (5) days ofl tvl time rptg NLT 11 Aug 49. PIO CL. TO: 301st Air Refucling Sq, Smoky Hill AFB, Kansas, EDCHR 10 Aug 49 - 2150 `CHLIRLES E GEE 40807103 (Dilot-rated, on flying stauts FSC 11 Ret US 15 Dec 41, Ccmp USAFR) (SAC emerg regn dtd 10 Jun 49, Page 4, Line 32, NOS 4823) WJP 3 Aug 49. Auth thirty (30) days dclay enroute plus three (3) days ofl tvl time rpts NLT 5 Sep 49 TO: 3380th Tng Gp, Keesler AFB, Miss, EDCIR 8 Alg 49 1ST LT 1054 TIRROLD H BRO.TH 10830783 (filct-rutod, cn flying status, FSC 8 Ret US 20 Jun 45, Ccmp USAFR) to attend Electronics 0's Crsc +01410 10 Aug 49. a Aug 49 , auth four (4) days ofl tvl time rptg NLT 8 Aug 49. PIO 61. * * BY ORDER OF COL ONEL DAVIS: SIDIELY L JOHNSON 2nd Lt., USAF Asst Adjutant R S T R I C T E D R E ES S T R I C T E D SO 22 Hq 2260th AB Sq Lockb curne AFB Col's Ohio par 22 dtd 27 Jul 49 cont'd OFFICI.L: C SIDIVEY L JOHISSON 2nd Lt, 2 USAF Asst Acjutint CVS CO Cast].c AFB Colif 00 Apt. Colo CO Snob - AFB Kansas CO AFB liss 5 cys RTO this sta 2 R E S T R I C T E D R E S T R I C T E D 2260TH AIR BASE SQUADRON LOCKB CURNE AIR FORCE BASE Columbus 17, Ohio SEE 19 July 1949 SPECI L ORDERS) 15) 1, (Nct to be published in consolidated form) 2. TFN Officers & Amn this orgn this sta, T.P o/a 21 Jul 49 ch ,Y for approx three (3) days to Olmstcad AFB, Middletown Pa for the purpose of con- voying ntr vch thereto. Upon compl of TDY Officers & Amn will ret to propor orgn this sta tvl will be porformed by govt veh. Officer auth Per dicm. UP AFR 173-5 FD will pay in adv non alws in licu of rats a/r 01.00 for Broakfast, 01.25 for Noon meal and $1.50 for Suppor to twonty-three (23) Amn 0a, for three (3) days. Total nunbor of meals. Three (3) Broakfasts, two (2) Noon meals and three (3) Suppors. TDN 5704400 062-1003 P 442-02 S 33 024. CAPT EUGENE F TYREE 101 576754 1ST LT .ILLIMII A BANKS A0570472 M/Sgt Joseph F Gaines AF33098017 T/Sgt Elbert Broun 1F34090191 S/Sgt John UJ Bogan AF34073786 S/Sgt James Cimpson Jr S/Sgt Paul V Dymond AF31221278 S/Sgt Jay D Linton AF38255543 S/Sgt John Morrisk Jr AF33082319 S/Sgt David L Simpson 1F34245053 S/Sgt Stophon A Roberson AF34416100 S/Sgt Robort T Sims AF34069805 S/Sgt Villic I.1 Richardson AF33204735 S/Sgt L C Wright 1F17052999 Sgt Dolford C Crawford AF34051023 Sgt James 0 Gilbert AF35687321 Sgt Robert L Tabron AF34304782 Sgt Elisha Hunt AF34452882 Sgt Janis A Powcls AF34322398 Sgt Robort J Seairs AF33784604 Sgt Albort T Carter AF32414368 Cpl James C Chorry AF42161692 Sgt Richard Bembry AF16063949 Pfc Nathanicl C Carlis AF57475022 Pfc Goorge IJ Richards n 1F57215173 3. Extracted. (Not to be published in consolidated form) 4. Eff 20 Jul 49 convalcscont lv is granted Pvt Goorge Morgan AF36937898 this orgn this sta for fiftoon (15) days. Upon c cmpl of convalescent lv Amn will be in propor orgn this sta NLT 3 lug 49. Address on lv 93.13 La Salle St Chicago, Ill. (luth: Sec III Par 9 AR 600-115) 5. Pvt 345 John U Berent US35581509 Det of Pnts Valley Forge GH ville Pa (Garrison Prisonor) atchd Dct of Fnts sta hosp this sta, is reld fr atchd heroto WP o/a 19 Jul 49 to atchd Dct of Pnts Percy Jones GH Battle Creek Mich, for further treatment and appropriate disposition Guard.f prisoner will be furn by Trovost Marshal, Ft Hayes Columbus Ohio; tvl to be performed by mil acft. TDIJ (Guar d ) 5704500 060 244 1583-02 S99-999. At completion of TDY Guard d will ret to proper orgn and sta.1 6. Eff this date CAPT ELDRIDGE F WILLIAMS A0567094 this orgn this sta is apr accountable Off for Base Library account (1824L0) vice 1ST LT A ARRINGTON A0713054 reld. Transfer of proporty will be in accordance with AR 35-6630. R E S T R I C T E D R E T R I C T E D SO 15 Hq 2260TH Air Base Sq Lockbourno AFB Columbus 17, Ohio dtd 19 Jul 49 cont'd 7. Eff this date TFN Officers this orgn this sta, are aptd Instrument Fligh Examinors. (luth: AFR 60-4 dtd 1 Nov 48) CAPT CHARLES E McGEE A03 CAPT DUDLEY II THATSON 10008A LT DANIEL JAINES JR A0809244 1ST LT HARCLD H BRCHT A0830733 1ST LT ED.Z J A01692804 1ST LT FELIX J KIRKPATRICK JR 10804555 8. STIOP 5 SO 156 Hq 332d Ftr Ug this sta dtd 26 Jun 49, as reads: (Luth: AR 615-5 Par 14b dtd 10 Doc 47)\" is anended:t read: 11 (luth: Par 15, C3, AR 615- 5 dtd 10 Dec 47). (Re: Reduction:of Sgt Leo Davis 11f13231013) 9. TFN Amn 1st Sq 2102d Air Nea Gp Ohio, atthd this sta for dy por par 63 SO 187 Hq Chanute AFB I11, are further atchd to Sec I, 2260th Alr Basc Sq this sta, for rats, grs and adm. Pfc Ccrinne II Kaline A.18600527 Pfc Gertic IT Wilson 148204200 10. STOOP 5 SO 12 this Hq, cs, is portains to Sct Roy L Smith AF15207979 is revoked. (Re: PCS of Amm to Tyndall AFB Fla) 11. Eff this datc CAPT CHARLES E McGEE A0307103 this orgn this sta, is aptd Officer in charge of Instrument Flying. (Auth: AFR 60-4 dtd 1 Nov 48) 12. Eff this date, UP AR 210-10 S/Sgt Elmor Watkins AF18026558 this orgn this sta, is auth to reside off post, to rat sep fr orgn & auth mon alws in licu of rats. 13. Par 30 SO 5 this Hq, cs, is revoked. (Re: TDY of Officer & Amn to Olmsted AFB New Stanton Pa) 14. VOCO 29 Jun 40 placing TFN Officer & Amn 332d !Itr Vch Sq, J.I & S Gp, this sta on TDY for approx three (3) days to Olmsted AFB New Stanton Pa off o/a 29 Jun 49 for the purpose of delivcring parts for repair of veh and ret this sta, are confirmed and made a matter of record, the exigencies of the SV having procluded the issuance of orders in adv. TDN 902-6203 P 432-02 2190-225 S 33-024 c/c 04120. 1ST LT WILLAD: .1 BANKS A0570472 M/Sgt Joseph F Gaines AF33098017 Pfc Robert B Brown AF14238383 Vou for rcimbursoment under this order must be submitted to FO this sta within five (5) days after compl of TDY. Bud & Fisc 0 this sta cortifics aval bal of funds chargeable tc accounting classification shown hercin is sufficiont` & FO making pmt against this order will fwd cy pd you to Bud & Fisc 0 this sta. 15. So much of par 21 SO 11 cs this Hq as portains to Cpl Harvey Austin Jr is amended to add (Recommended School Asgmt Crsc (Re: PCS of Amn to Lowry AFB Colo) 16. So much of par 21 SO 11 cs this Hg as portains to Sct Clyde D Morgan is amonded to add (Recommendod School Asmat Crse #50501)\". (Re: PCS of Amn to Lackland .1FB -2- R E T R I C T E D R E S T R I C T E D SO 15 Hq 2260th AB Sq Lcckbournc AFB Colunbus 17 Chio dtd 19 Jul 40 cont' 173 1:/Sgt 502 Burun E AF6606673 this orgn this sta (Con.`c)(P/P) is reld fr asgd hereto trfd & asgd TP 2 Aug 49 to 2240th AFRIC Cleveland Municipal Apt Clevoland Ohio, EDCMR 3 49. Amn auth twonty (20) days delay enroute (rocnlmt lv) plus of1-tvl timc. PCS PC.1 TPA TDN 5704500 060-204 P534-02 03 07 S99-999 and 5704500 060-209 P533-02 03 S09-990. UP .1FR 173-5 (AR 35-1810) FD will pay in advince the proscribed mon alws in licu of trans fr this sta to lv address to now sta a/r 52 por milc & mon alws in licu of rats a/r shown in table below'for numbor of meals indicated If tvl performed by rail, RTO will furn nec T, PAC AR 35-4800. RTO will detormine and issue the number of moal tickets as the journcy may require. Lv addross: 1006 E 23th St, Los lingcles, Calif. Amn will rpt to propor orgn & sta NLT 23 Aug 49. Broakfast Noon Supper Rail Tv! $1.25 01.50 $1.75 Other Tvl 01.00 $1.25 $1.50 BY ORDER OF COLONEL DAVIS: JUNIUS R SAVAGE 1st Lt., USAF Asst idjutant OFFICILL: JUNIUS R SAV.IGE 1st Lt, USAF Asst Adjutant DISTIIBUTION \".\" is \"C\" plis 10 cys COPercy Jones GH Battlc Creck Mich 10 cys CO Tyndall AFB Fla 10 CO Olmsted AFB Pa 10 cys CO Lowry AFB Colo 10 CO Lackland AFB Tox 10 CO 2240th AFRTC Cleveland Municial Apt Cleveland 0 cys Bud &: Fiscal this sta 120 this sta R E S T R I C T E D R E S T R I C T E I) 2260TH B MIR FORCE BASE Columbus 17, Chio SPECIAL ORDERS) 2 July 1949 NU .BER 2) I. T/Sct William T HcGrew 1°13025462 2260th Air Base Squadron this sta is grantod a turenty (20) day lv off 5 Jul 49. Amn will rpt to propor orgn NLT 25 Jul 40. Addross while on lv: 814 Nost 13th Stroet San lingelo, Texas. 2. S/Sgt 667 Jeff J Davonport AF34553860 having reenlistod this datc in the USAF in prescnt grade for a indofinite pd is asgd 2260th Air Base Sq this sta 2 Jul 49 i'mn auth fifteon (15) days rconlmt lv eff 7 Jul 40. Upon compl of reonlnt lv Ann will be in proper orgn this sta NLT 22 Jul 40. FD will pay in any 51 por mile for tvl. fr this sta to 383 N 10th strect Pacific Grove, Calif and ret to this sta. TDN 901-226 ] 435-02 2190225 S 09-099. (Auth: AFR 39-0/40) 3. TFW Anin having reonlistod this datc in the USAF in prosont or for a pd of three (3) yrsare asgd 2260th Nir Base Sq this sta 2 Jul 49. Lv deferrco (Auth: AFr 30-0/40) S/Sgt 750-D Boyd Taylor AF34227235 Sgt 321 Ophilo V Spivey AF34532846 4. 3 SO 160 HIq 332d Ftr Jg cs, this sta, as reads the Base is .amonded to read of Salvape Stcck 5. TFN Officers are apt a board of Officers for the purpose of invostigating the loss of `Gasoline Sales Funds on 22 Jun 49 from Warchouse T-536, will convene o/a7 Jul 49 in accordance w/par 29a, .35-6520. CAPT CHLRRES E A0807103 1ST LT UMLTER 11 1ST LT LINSEY J SANFORD A0585781 Bd will be guided by the provisions of AR 120-5 and writton roport will be subnitted to this Hq ILLT 12 Jul 49. 6. SHOP 5 SO 155 Hq 332d Ftr ig, dtd 25 Jun 40 this sta as pertains to Sgt Jamos E tise and Sgt Quither I.cGcwon AF31791342, as follows is amonded. TO DELETE TO. ADD FD will pay in adv the proscribed non alws in licu of trans a/r 32 por milc fr this sta to Tright-Pattorson .FFD Dayton Chio (UP AFR 173-5, .R.R 35-1310 7. UP AR 210-10 S/Sgt Jchn S 2260th Air Base Sq this sta is auth to rat sop fr orgn, auth mon alws in licu of rats and auth to roside off post for duration of asgmt to this sta unless soonor rcld, this datc. R E $ T R I C T E D R E S T R I C T E D 2 2260th Air Base Sq AFB Columbus 17, Ohio dtd: 2 Jul 49 cont'd 8. S/Sgt Stophon A Roborson - 2260th Air Baso Sq this sta is granto a ten (10) days eff 2 Jul 40. Amn will rpt to orgn NLT 12 Jul 40. Addross while on lv: 3135 Shelby Stroet, Cclumbus, Ga. 9. S/Sgt Gordon .1 AF35274419 Det of Pnts, :alter Roed GH, Tash DC atch Dct of Pnts (i//L) this orgn is rold fr atch thereto NJP o/a 5 Jul 49 to Dct of Ints Jalter Reed GH, Wash DC fcr further troatment and appropriate disposition: Upon complition of !Icspitilization Ann will rot to proper orgn. TFN 0 and EN:, this org will accompany Tvl to be porformed by rail TDN 001-23 P432-02 2100425 S 09- 939 ITO will furn ncc T and issue the nunber of meal tickcts the journey may re- quire to one (1) E.?. Upon complotion of TDY C and E will ret to propor orgn this sta: Tvl by mil acrft if aval: INAJ VANCE H NARCHBANKS JR 057377 SFC Melvin P Cheatha: R115039067 BY ORDER OF COL CNEL DAVIS: RUTH 1 LUCAS Capt. USAF Asst 2 DISTRIBUTION \",\" & \"c\" -2- R S T R I C T E D HEADQUARTERS 332D FIGHIEE T:ING LCCKBOURNE AIR FORCE B. Columbus 17, Ohio SPECIAL ORDERS) 29 June 1949 159) X T R A C T 10. The fol named officers US.1F, orgns as indicated, 332d AB Gp this sta, are reld fr asgat thereto and trfd to the 2260th Air Base Sq, this station to Sections as indicated. indicatid Noitvl involved. LEDCMRIL July 49. - 2001. Hq and Hq Sq RANK AFSN COMP MOS DySSN SEC McCREARY THALTER L Capt A0798950 USAFR 1054 6302 I NILLIAMS CHARLES I Capt A015366 1054 2120 I LESTER CLARENCE D JR Capt A055716 USAF 1054 2120 IV JONES HUBERT L Capt A044611 1054 2120 IV JOHNSON SIDNEY L 2d Lt A0590569 2110 2200 IV JOHNSON JOIN J JR 2d Lt A0590399 2110 2200 IV JOHNS ON UESLEY 1st Lt A0583308 USAFR 6302 4320 I NILLIAMS EDVARD J 1st Lt A01692804 USAFR 2161 2161 IV thard ARTHUR L lst Lt 4000 4000 I SCHELL TYRAIN T 1st Lt A02023036 USAFR 1054 4823 II LEHIAN PAUL D lst Lt THATSON DUDLEY I.I Capt 2161 2161 IV WILLIMMS ELDRIDGE F Capt A0567094 5521 5000 IV SHEPPARD harry A Capt USAFR 1054 0001 IV SUGGS JOHN J Capt 4024645 USAF 5004 0001 IV ARRINGTON TAALTER A lst Lt A0713054 2510 0001 IV 1st Lt 10713061 USAFR 1034 0001 IV KIRKPATRICK FELIX J JR 1st Lt 40804555 2520 0001 HUBERT UILLIS J 1st Lt 10650896 6402 0001 IV TJOODS JOHN E 2d Lt 10590479 USAFR 0001 IV SANFCRD LINSEY J 1st Lt A0585781 USAFR 0001 IV -1- R E S T R I C T E D R RESTRIC E S T R I C SO 159 Ho 332d Ftr Lockbourne AFB Columbus 17, Ohio par 10 dtd 29 Jun 49 cont'd COMP MOS DySSIV SEC TAYLOR LLOYD R V 1st Lt 1048707 USAF 2110 0001 IcGEE ELBERT H JR 2d Lt 10590597 2110 0001 JACKSON MELVIN T Capt A054465 1054 0001 IV MIGGEE CHARLES E Capt 40807103 2159 0001 IV SAMUELS FREDRICK H 2d Lt A0590641 2200 0001 IV BURTON I!cDAntSON Capt A01573753 2136 0001 IV CLARK THCMLSS I. Capt A047065 2260 2260 I CROCKETT WOODRO.: T Capt A04-8660 USAF 1054 0001 IV DOUNING ALVIN Capt A025185 5000. 0001 IV lst Lt USAFR 2548 0001 332d Comm Sq Ftr (SE) 1st Lt A01637050 USAFR 0200 0001 IV KING ROBERT L 1st Lt 401641468 0200 0200 IV 1st Lt A0589889 USAFT 0500 0001 IV GREGORY S 1st Lt A0590250 0200 0141 IV STROMAN CHRISTOPHER F 1st Lt 1055940 US.AF 0500 0001 IV 332d hir Police Sq Ftr (SE) KELLEY . .ILLIAM A JR 1st Lt 10866221 USAFR 0100 9100 IV !TATKINS R JR lst Lt 10584730 usafr 8503 0001 IV ROBINSON ROBERT J JR 1st Lt 01116415 7025 0001 IV BURTON GEORGE E Capt A0577036 2202 0001 IV ILARRIS CLARENCE TJ 2d Lt 10590551 4000 0001 IV Maj AC901787 USAFR 7025 7025 IV THOMIS CILLRRIE J 2110 0001 IV R E S T R I C T E D R RESTRICTED E S T R I C T E D SO 159 Hq 332d Ftr Lockbourne CoJumbus 17, Chic par 10 dtd B Jun 49 cont'd 332d Food Sv Sq Ftr (SE) .FFSN COMP SEC HUBBARD GEORGE I.I 1st Lt US .F 4400 4110 IV HILL LOUIS D Capt 101589900 US .FR 4114 4114 IV THIT `KER OTIS P.I 2d Lt 401848849 0600 0001 IV TOLER LEONSO C lst Lt 1056577 US. F 1034 0001 IV .RRNOLD HCLLIS T .W.T 2119215 2200 0001 IV 332d Finance Dis Unit TEAVER SHELDON R 1st Lt 020 70588 USAFR 6201 6201 BY ORDER OF COLONEL D.IVIS: JUNIUS R l st Lt., US..F Asst idjutar JUNIUS R lst Lt., US.'F Asst `ddutant 3 R E S T R I C T E D R I C E D HE. ERS 332D FIGHTER WING LOCKBOUTNE AIR FORCE BASE Columbus 17, Ohio SEE PAR 29 June 1949 SPECIAL ORDERS) NUMBER 159) 20. Cpl Hanson Johnsor AF33867820 USAF 332d Sup Sq \"tr(SE) 332d Maint & Sup Gp this sta U7P o/a 23 Jun 49 to AFB Dayton Ohio on TDY for an indef pd of time for the purpose of coordinating laundry mattors pertaining to this command. Upon compl of such TDY Amn will ret to proper orgn this sta. Tvl vill bc porformed by Covt T. 21. UP AR 35-320 3a atd 5 Feb 4.5 as changed, 1ST LT HENRY P NILES A01642385 USAF 449th Sig Avn Hv Cons Bn this sta is detailed as Class \"A\" Finance 0 to COL J C CARTER, FD !rright-Patterson .FFB Dayton Chio for the purpose of making regular and supplemental payments to the enlistod personnel of 449th Sig Avn Hv Cons Bn this sta for the month of June 1949. 22. Par 2 SO 153 this Hq, cs, is revcked. (Ro: Amendent to par 2 SO 140 this Hq portaining to CAPT CHLIRLES E McGED JR (00807103) 23 VOCO 16 Jul 48 doloting*\"Pei diom auth only while traveling\" are con- firm and made a m::tter of record the exigoncies of the scry having procluded the issuance of orders in advance. (Re: TDY of. CAPT CTT :LES E McGEE JR AO 807103) * SNOP 2 SO 146 this Hq as roads 24. Eff this datc, UP AR 210-10 s/Sgt John S Riley if35487407 332d Instal Sqd ftr (SE) 332d AB Gp this sta is auth to rat SOD fr orgn, auth mon alws in licu of rats and auth to reside off post for duration of asgmt to this sta un- less sooner rold. 25. SMOP 9 SO 157 this Hq, cs, as pertains to PIO Clearance on PCS of 0 to Keesler AFB, \"iss is revoked. 26. VOCO 20 Pay 49 amonding par 12 SO 123 this Hq,Cs, to add: PIO Clearan< are confirmed and made a matter of record. (Re: PCS of C to Koosler AFB, Niss 27. SHOP 3 SO 155 this Hq, cs, as reads: !Ton alws in lieu of rats a/r $1. por meal for twolvc(12 moals to six( Amn is amended to read: alws in liou of rats a/r 01.00 per meal for five(5 meals to six(6) Amn. Trf of Armin to Eglin `FFB 28. SNOP 4 SO 155 this Hqs, cs, as reads: Mon alws in licu of rats a/r $1.00 per meal for twolvc(12) meals to four(4) .imn ca is to read: Non alws in licu of rats a/r $1.00 pcr meal for five (5) mocls to four(4) am ca. Trf of imn to AFB Fla SO 59 Hq 332d Ftr Wg Lockbourne AFB Columbus 17, Ohio dtd 29 Jun 49 cont'd 29%. SHOP 5 SO 155 this Hq, cs, as reads: FD will pay in advance 3d pcr mi for tvl fr this sta to Kelly AFB Tex & $1.00 per meal for ninc(9 mcals to e(1) i'nn if tvl porformad by TPA if performed by rail $1.25 pcr meal for nine (9) incals is amondod to read: pay in tvl fr this 30 - STOP 5 30 155 this as portains to T/Sgt James Davis Jr iF34424 971 to add the TPL 173.5 licu of in licu mi, SHOP 2 SO this Hq.Cs, as portains to 1ST LI F TURNER AF 807. .Re: Trf of C to 9 F pul! sta (luth: THX OF PP.O 0964 ctd 28 Jun 49) 32. THS 30 49., lv of abs is grantod Pfc Lowery M Johnson USAF, lig A So sta, for tor (10) days. Upon compl of lv imn is to be in and sta NLT 10 Jul 19 ddress on lv: 1109 Pasco Blvd Kansas Cith No, AR 600-115) 33. Eff \":his dats Pfc Wylic Jones R.14:090362 449th Sig Avn Hv Cons En this sta is reduced to the grads of RECRUIT for misconduct. AR615-5 & par 15a) 346 UP AR 210--10 ITN 'mn and E orgns indicatod this sta are auth to rat sep fr orgn, auth mon alws in licu of rats and auth to roside off post for dura- tion of acgnt 20 this sida unless socno: reld cff this.d .datc. S/Sgt Benjamin F Davis 1734229004 S/Sgt June th Thomas 301st Ftr Sq(SE) 332.c. Ftr Gp 99th ftr Sq(SE) 332d Ftr Gp Cpl William C Harrcll R132071468 332d Sta Gp 35, TFN imn having reenlistod this date in US: .F in present gradcs for of three(3 yrs are asgd orgn3 indicated this sta VJ/ EDCIR 29 Jun 40. auth recnlmt !v for number deys indicated off datss indicatod. FD will pay in adv 54 per mi for tv : this ;-ta to lv address indicated and ret to this sta. TDN 90 226 P 435-02 2190-255 899-999 MFR 39-9/49) M/Sg* Charles C Moorc AF13002800 Hq&Hq Sq 1331 Alv `uth 15 days cff 1 Jul 43 rpt Berkcley Calif 99th Ftr 3g(33) 10938 Strathmoro Dr Auth 15 days cff *I Jul 49 rpt 332d Ftr Gp Los A les C.llif NLT 16 Jul 49. * 750.BB S/Sgt 750-B Bonjamin I Davis 301st Ftr Sq(3E) 1012 IE James St (Waivcr) 332d ftr Gp Seattle Wash luth 20 days off 6 Jul 49 rpt NLT 26 Jul 49 T R I C SO 1- HIq 332d !Tg Co. 7 dtd 29 Jun 49 par 16 cont' Sgt 166 Richard Bembry 1F16068946 332drlItr 332d Vch Sq(Sz) 1126 Thauway St 332d N&S Gp a mada Calif .uuth 15 days off 1 Jul 49 rpt NLT 16 Jul 49 36. TFM i.nn having roonlistod this datc in US.`F in present grados for an indefinite pd are asgd orgns indicated this sta w/EDCIR 29 Jun 49 1 imn auth roonlmt lv for numbor days indicatod off dates indicatod. FD will pay in adv 5f per mi for tvl fr this sta to lv addrossos indicated and ret to this sta, TDN 901-226 P 435-02 2190425 S99-999 (.uth: AFR 30-9/49) S/Sgt 238 Raymond R Reed 1F35593070 332d Inst Sq(SE) 1827 E 1.22d St 30 days off 1 Jul 49 rpt 332d `B Gp Los .ngclos Coli: NLT 31 Jul 49 S/Sgt 055 Loroy :cloor 1f31073410 332d itr Veh Sq(SE) 1516 Carlton 3t 20 days off 1 Jul 49 rpt 332d N&S Gn Borkloy Calif 21 Jul 49 (Taiver) S/Sgt 677 Bruce Paris Jr 1538043345 332d Air Police Sq(SE) Lv deferred 332d B Gp T/Sgt 673 Maxic L Robinson `FF33806022 having reenlisted this date in the US.FF in presont grade for a pd of three(3) years is asgd Air Filler Det Hq C Hq Sq 332d .B.B Gp this sta W/EDC'R 29 Jun 49. LJ deferred (Juth: AFR39-9 49) 37 Sgt 238 indrow Mitcholl R138163551 having rconlisted this date in presont gr in the U.S for a pd three(3-) yrs is asgd 149th Sig .ivn Hvy Cons Bn this sta w/EDC!R 29 Jun' 19. auth fiftoon(15 days recnlmt lv cff 7 Jul Upch compl of reenlmt lv EN will be in propor orgn this sta ILT 22 Jul 49. FD wil] pay in adv 5d por mi for tyl fr t`is sta to 244 TJ Sant: Clara St Ventura Calif and ret to this sta. TDI 901-26 P 435-02 2190425 S99-999 38.Eff this dntc, UP .1R 210-10 TFN Sinn orgns indicated this sta tre auth to rat sep fr orgn, auth mon alws in licu of rats and anth to reside off post fcr duration of asgmt to this sta unless sooncr rcld Sgt Richard Bombry AF16068946 M/Sgt Charles C Mooro f13002800 332d MItr Voh Sq (SE) Hg & Ho Sq 332d Ftr 332d IZS Gp 39, SHOP 9 SO 154 this Hq,Cs, as reads: No delay enroute WP o/a 10 Jul 49 is rmended to rand: 0 suth five(5) days dolay enrouto TP o/a 5 Jul 49 (Re: PCS of 1ST LT ` HIILERY 10817602 Hamilton Fld Calif -3- R T R I C E D R E S T R I C T E D SO 159 Hq 332d Ftr Wg AFB Columbus 17 Ohio dtd 29 Jun 49 cont'd BY ORDER OF COLCITEL JUNIUS R 1st Lt Lisst Adjutant DISTRISUTION & \"C\" 332D BASE GROUP AJR BASE Columbas 17 Ohio SPECIAL ORDERS 20 June 1.949 NULEER 123 1, EfS 21 June 49, lv of abs is granted Sgt Arthur J liann AF ].6 043 264 USAF 766th USAI Band this Gp, for fiftson (15) days, Upon completion of lv 2.111 is to report LC his proper orgh this st a NLT 6 Jul 49, Address while on lu: 166 I.xexington Sc, Columbus, Chilo (futh AR 600~115) Ef? this dt, the P--103 ot CAPTAIN CHARLES E LICGEE A08077.03 USAF Hq & Hq Sq this Gp, is changed from 2161 io 2159. (Auth par 708.1 AFLI 35-1) 3, 4, and 5 extractod. (Not to be published in consolidatod form) 63 Eff this at, the P.LIOS of Ffc lictters C Fullbright Jr AF 19 329 707 USIF 332J Food Sv Sq ltr (SE) this Gp, is changed from L:05 S/Sk to 405 SK. (huth ADII 35.-1) 7. Eff this date, the fol Aun USAF are reld fr asgn and trfd to 3323 Dase Service Sq Ftr (SE) this Gp, given dy with Billeting Office, Dy SSN 590, Pfc 521 Wade 332d Instl Sq Ftr (GE) E Peyton AF 14 325 980 Pfc 521 Clyde Happor AF 57 307 1.54 332d Air Police Sq Ftr (SE) 8. VOCO 16 Jun 49, appointing 1ST LT PAUL D LEHMAN A056429 USAF Hq & Hq Sq this Cp, Post Exchange Officer (Dv SSN 4210) vice CAPTAIN JOHIJ J SUGGS A044645 USI.F Hq & Hq Sq this Gp, reld andfurther appointing CAPT%IN JOHN J SUGGS 1044645 USAF Hq & Hq Sq this Gp, Asst Post Exchange Officer (Dy SSN 4210), are confirmed and made a matter of record. 9, Eff this dt, the Primary Duty of 2D LT JOHN J JOHNSON JR A0590399 Ho & Hr, SG this Gp, is changed from 2200 to 2110, Asst Adjutant, dy with Al: Fillor Lot 10. this dt. the P-HOS of S/Sgt Alphonso L Brooks AF 33 120 195 332d Foor ce Sq Ntr (SE) this Gp, is changed fr 824 to 821 SK. (Juth AFT 11. E\": **is c's the P-LIOS of H/Sgt Cecil P licCray AF 34 099 036 USAF 332d Base Sen Ftr (SE) this Gp, is changed fr 502 to 059 SK, and 502 be deleted fr (Auth AFM 35.-.1) 12. Eff this dt, the additional 100 502 of 11/Sg+ Calvin Unight `F 33 851 USAF Hq & Hq -Sq this Gp, is deloted. (Auth AFM 35-1) RESTRICT R E S T R I C T E D SO 332d ABGP Ftr Lockbourne AFB* Cols 17 Ohio dtd 20 Jun 49 13. Eff this dt, T/Sgt Earlbo Derson Ap 32 078 722 USAF Ha & Hq Sq this Gp, is asgn dy with Budget and Fiscal Liv ASN 502. THO : CLICK DISTRIEUTIO HEADCUARTERS 332D AIR BASE GROUP 332D FIGHTER VING LOCKBOURNE AIR FORCE EASE Columbus 17, Ohio OFDERS 17 June 19 .9 NUIBER 122 '1. Par 4 SO 121, cs, this Gp, appointing CAPTAIN CHARLES E MIGGEE A0807103 USAF, Hq and Hq Sq this Gp, Asst Operations Officer (Dy SSN 2161), is revoked. 2, Eff 18 Jun 49 lv of abs is granted S/Sgt Kersict T Conner AF 38 080 632 USAF 332d Air Police Sq Ftr (SE) this Gp, for fifteen (15) days. Upon completion of lv amn is to report to his and sta NLT Jul 49. 'ddress while on lv: General Delivery, Itasca, Texas, (luth AR 600-115) 3, 4, 5, 6, 7, 8, 9, 10, 11 extracted. (Not to be published in consolidated form) 12. Eff 20 Jun 49, lv of abs is granted Cpl Virgil R Swope IF 19 294 199 USAF 2221st Sp Sv Ut this Gp, for thirty (30) days. U-oon completion of lv amn is to report to his proper orgn and sta NLT 20 Jul 49. Address whilc on lv: 1018 S Ollive St, San Antonio, Texas. (6uth AR 600-115) 13. So nuch of par 2 SO 1.07 dated 26 May 49, CS this Gp, as portains to lv of abs granted 1ST LT UILLIS J HUBERT A0650896 USAF Hq & Hq Sq this Gp, as reads of abs is for and report NLT 1 Jul 49\" is anended to read \"lv of labs is granted for fiftcen (15) days and report NLT 16 Jun 49\". 14. Eff 19 Jun 49, lv of abs is granted 1ST LT FELIX J KIRKPATRICK JR A0804555 USAF Hr & Hc; 3q this Gp, for thirtcon (13) days. Upon completion of lv Off is to report to proper orgn and sta NLT 3 Jul 49. Address whilc on lv: 447 S Honroe St, Columbus, Ohio. (huth AR 600-115) Requirenents of AFR 60-2 complied with. 15, Eff 20 Jun 49, lv of abs is granted Sgt John H Hughes AF 17 002 551 USAF 332d Communication Sq Ftr (SE) this Gp, for fifteen (15) days. Upon completion of lv amn is to report to proper orgn and sta NLT 6 Jul 49. Address while on lv: 3618 St NE, Washington D.C. Auth AR 600-115) 16. So much of par 4 SO 86 dated 28 Apr 49, cs this Gp, as pertains to 1ST LT J USAF Hq & Hq Sq this Gp, as reads \"lv of abs for five (25) and NLT 31 49\" is amonded to read of labs is granted for ten and report NLT 1.5 49\". 17. VOCO*16 Jun 49, appointing CAPT.\\IN CHARLES E McG A0807103 USAF Hq & Ho Sq this Gp, Asst .ircraft llaintenance Officer (Dy SSN 4823), is confirned and Thade a matter of record, -1- RESTRI C T E D SO 122 332 AB 332d Ftr I Lockbourne Cols 17 dt 17 Jun Cont' BY ORDER OF ..ILSON: THOMIS I.I CLARK Capt. USIF OFFICI.L: THOMLS I.5 CLARK Capt. USAF Asst Adjutant DISTRIBUTION: C -2- T R I C T E D 332D AIR BLSE GROUP 332D FIGHTEN WING LOCKBOURNE AIR FORCE BASE Columbus 17, Ohio ORDERS 16 June 1949 121 1 Eff 1.7 Jun 49, lv of abs is granted CAPTAIN CHARLES E Mc GEE A0807103 USAF, He & Hq Sq this Gp, for fourteen (14) days. Upon completion of lv Off is to report to his proper orgn and sta NLT 1 Jul 49. Address while on lv: 350 S. Wayne live, Columbus 4, Ohio. (luth .RR 600-115) 2. Eff 17 Jun 49 lv of abs is granted Sgt :Tarner 11 Tatkins AF 34 009 391 766th USAF Dand this Gp, for fifteen (15) days. Upon completion of lv Amn is to report to his proper orgn and sta NIT 2 Jul 49. Address while on lv: 880 E. Long St, Columbus, Ohio. (Auth AR 600-115) 3. Eff this dt, the P-: OS of S/Sgt Elner Watking /F 18 036 558 USAF Ha & Hq Sq this Gp, is changed fr 747-C to 684 SK. (luth AFM 35-1) 4. Eff this dt, CAPTAIN E A0807103 Ha & Hq Sq this Gp, is appointed Asst Operations Officer (Dy SSN 2161). 5, 6, 7, 8, and 9 extracted. (Not to be published in consolidated form.) 11. So nuch of par 12 SO 120, cs, this Cp, as pertains to lv of abs granted Sgt Herman Bulter Jr AF 1.5 226 665 USAF 332d Communications Sc Ftr (SE) this Cp as reads Date 27 Jun 49 1 is arnended to read Date 24 Jun 49\". 12. Eff 17 Jun 49, lv of abs is granted CAPTAIN OLETA L CRAIN AL705066 2222nc SSV Ut this Gp, for twentyfour (24) days. Upon completion of lv Off is to report to her proper orgn and sta NLT 11 Jul 49. Address while on lv: WAF Officers Quarters, Lockbourne hir Force Base, Columbus 17, Ohio. (Auth AR 600-115) 13: Eff 17 Jun 49, CAPT/LIN LILLIJN IT DUNCIN AL80229 USAF 4413th THE Sq, is aptd CO (ildd Dy) of the 2222nd Ev UH this Gp, during the temp abs of CAPTAIN DLETA L CRAIN AL705066 US.P 2222nd SSU Ut this Gp. 14. Energency lv of abs is granted Sgt Leola L Uheat AA402221 USAF 4413th WAF So this Gn, for ten (10) days. completion of lv jmn is to report to her proper orgn and sta JT 27 Jun 49, Eff dt 17 Jun 49. (Auth AR 600-115) by OIDER OF ILAJOR OFFICI:L: 11 CLARK Eapt:, US. F lisst, Adjutant THOLLIS i.i CLARK Capt:, USAF Asst, Adjutant DISTRIBUTION: R I T C R E S T R I C T E D 332D AIRDRON GROUT 332D FIGHTED TTING LOCK BOURNE: AIR FORCE BASI; Columbus 17, Ohio SEE P/R 1. Par 5 SO 167 this Gp, cs, is revoked. (Re: lv of abs granted EW, as.:d Sq THT this Gn.) 2. U? AR 600-115 lv of abs is r;ranted Pfc Mitche-l] Witherspoon af12292037 USAF (N) Hc and Hq Sq this Gp for twelve (12) days eff 20 48. EM will rpt 1!LT!l Sept 48. Address 011 lv: 124 Madis-on St, Buffalo, New 3. S;;t 622 Richard F Purdue Af32941069 USAF TN) Hq and Hq Sq this Gp, Enl 26 June 46 for three (3) yrs, is reld fr &smyt and dy thereto, to Sq F this Gjp, ~iven dy/u! Base Chancl. DySSN 405. EDCHR 23 lu,; 48. Par 6 SO 164 this Gp, cs, is revoked. (Rc: lv of abs granted Officcr, Hq and Hq Sq-this Gp.) 5. Pfc 945 Judith S Randolph 11.209721 hus VILC (N) Sq TJ this Gp, Enl 5 June 47 for 0216 (1) yr. TPP to her hone 294 Grove St, Pasadona, Calif., and is atchd 318th (issy, Proc & Sen) this sta f r processing; or SE:) UP AR 615-365 and RR l--]. CO Separatic: Point, Lockbournc AFB this sta, will issue necussary ordcrs for subaration: INT will to CO AF Seperation: Puint at 0700 hours OT hu 48. is ontitlcd to Cortificat of Dischari;e WJT) AGO For:l 55.) 6. Pfc 677 Richard D Crawford i.f15238243 USILF (N) Sq B this Gp, Lnl 4 Junc .16 for throc (3) yrs, is rcld fr ashrt dy thoroto, cand to Sq F this Gp, DySSI! 590. EDCIIR 23 hus 48. 7. So much of par 15 SO 165 this Gp,cs, as portains to Cpl 081 Robort Hudson AF18152917 US/LF (N) Sec III A is smondcd to road: Sec IV D/, Cir 39 dtd 1947. (Rc: En asrd Sq E atchd 318th leFBU.) 8. The fol EM USAF (IT) 318th AFBU (Assy, Proc & Sep) (P/P) this sta having been asgd. this Gp per par 2 SO 172 Ho 332d Ftr WS this sta dtd 18 Aug 48, are to as indicated this EDCHR 23 hug 13 . . QOS Asgd to: Pfc 677 James R Raines Af12115127 DySS!T 677 3 yrs-28 Jan 46 No Sq B Cpl 677 Golden T Moortian lif33666326 DySSN 677 3 yrs-31 Oct 45 No Sq B Pfc 766 Richard E Bolden Af13241528 DySSN 766 3 yrs-24 Jul 47 Yes Sq A Pfc 822 John J IIcDanicl AF14122680 DySSN 822 3 yrs-23 Nov 45 No Sq C 9. So liuch of par 18 SO 165 this Gp,cs, as pertains to Sc;t 623 Donald E West AF35362951 (N) Sec III AR 615-365 is amended to read: Sec IV DA Cir 39 dtc (Ko: ENI asi;d Sq F atchd 318th l.FBU.). -l- RESTRICTED R R I E R L S T R j. C T TJ D SO 168 Hq 332d Gp Lockbourne `FF Colunbus 17, Chio dtd 19 hus 48 cont'd 10. So huch 0. par 2 SO 167 this Gp, CS, a pertains to Ffc 514 Harvey Bivens Jr 4f34017645 is arhended to read: Pv': 514 Hervey Bivens Jr R434017645. (Re: EN Sq Is atchd to 318th 11. UP AR 600-115 lv of abs is crantcd Sg;t Herman D Davis Af42022011 USAF (N) Sq E this Gp for ten (10) days eff 20 Aur; 48. E!{ will rpt NLT 31 Aug 48. Liddress 0.1 lv: 1064 Baymiller St, Cincinnati, Ohio. 12. So nuch of par 3 SO 165 this Gp,cs, as pertains to Pfc Thomas is Morrison is amended to road: Pvt Thomas A Morrison. (Re: EM. ass:d A this G po) BY ORDER OF HEBB: VIRRRIN D DER 1st Lt., Adjutant lst Lt., USILF Adjutant C -2- R REST L S T R I C T E D 3321 GROUP 332D FIGHT WING LOCKD LIR FUREC Columbus 17, chio 164) 1. UP iR 600-116 of abs apo grantod the fol nawod The USA'F (N) 766th is Jand this Gp, for of days as indicatod, off 11 48 will Tiillian 11 Jonos 12 29 Lug 40 167 maysido Drivc AF1023418 18 1 Scp 40 AP6468199 Havre Do Graco Nid :/Sgt Vcrnon E Proctor 18 2 Sop se 29 Laural 8t 4F33096771 ''/sgt Cornolius N Walkor Roxbury, ? a 18 1 Sop -10 2515 Snydcr VO AP39159679 Chcyonnc nyo Honry E Hitcholl 18 1 Sop 43 1073 Fai Awc Columbus Chio Donald E Officor 15 1 8op 48 847 Campron Avo Tinston Salon, NC Sg: 'ffrod Kinda 7 9023 Clevcland LIVE C o 1a thio invronce c Black Jr 15 95 17th Co um Chio 15 1 Scp 40 166 Loxington ive Colunbus chio Porry 15 1 Sop -88 1218 the Linooln St ckla the Roborts 16 1 Scp 40 o/oGon Dcl Iota, La 15 1 Sep 43 223 Putnam Ave AP32186669 Brooklyn, N.Y Philip G !/ilmot 15 1 Sep 48 139 Fr.yette St A Pertha-bbyy, N.J. Alcxander 18 1 Scp 48 2201: Last 70th St Clevoland, chio Lannence H Boles 15 1 Sep 48 1024 Gibbard Ave AF36455255 Columbus, Ohio Honry it Forrcster 7 24 hug 48 739 Halnut St Momphis, Tonn 10 27 hug 48 521 North fish Finc Bluff, Ark 15 1 Scp 48 1309 South Napa St Philadolphic, Fa Louis R MoLwing; 4726 Scuth tabash AF46036769 Chicago, Ill Robort L Platt 13 30 hug 40 24 Addison St Charloston, S Carolina R c S T R I C T L D p 43 11 t Poto 8 St Crloans, La p 43 5627 Pararic Avc Chi I Harold I! r p 48 9 Co hor York ?fc Robort J c Jr 1 p 48 Chio St Dctroit 21 Mi higan Pro Larl Glas 1 48 last Lindon AP12274 74 onnctto Squarc Pa i's Willion St ton cxas ``fe Raviond V Lancos 1s 10 Orcgon St Ro ostcr N ?fe L liorritt, 15 1311 14 St Morth Chicago, I 1 the Charlus L Hichols 15 1123 Libcrty St S. E. Canton, Chio fo Thcodore Stophens 15 1 tp 43 05 11th Av Dolmar, Ncw Jcrscy Ifo Clarone Thoons 16 1 Sc? -33 2 3 St Andro Nuw Orlcans, La 15 1 p 16 66 rch St 16251402 Dc roit, Hcodson 15 1 80 40 Rowley S Joncs 15 731 San cnci co, Co 8/Sst Ishmol FT Risbards 15 1220 Last Joffcrson r cnix, frizona n/5 Willic 15 ac 1 1c, F orida 15 C Goodwir 2. 80 ruch of 3 SO 162 this Gp.cs, a pcrtains to 1ST LT LURCY GILUMO 60715060 UBAY (i:) Sq F t'is Gr, cs reads: 5: S cff 1-1 4ug 40 and will pot NLT 19 hug 40. is enncndcd to rend 5 days c 1 Lug 48 and will lopt NLT 26 hut -13. ( Re 0 USW (N) Sq 7 this Gp, grontcd lv of abs.) 3. UP AR 600-115 1v of abs is of nted Cpl Nar y :Y. P sryman J (N) He and Nig 8 this Gp, for ten (10) B eff 17 A 48, Will r NLT 27 Aug 48. Address on lv: 551 E 43 St, Chiecgo, I1 . 600-115 Lv of abs is granted 196 USAF (N) 8q 4 this Gp, for (20) days off 16 g wi dy NLT 5 Sept 48. Addruss while on lvs 290 Burt St., Columbus 3, ) Sq R E S T R I C T E D 17, Ohio dtd (3)) Hq & Hq this Gp, for 21 hus \" Address on 2 7. UP is 0 co q F this reduced to the or of PRIVATE for r 15a Sec IV 8. VOCO 3 Aug. 48 063 Charlie 0 nning AF3821822 US/L (N) 318th (Assy, Proc & Sep) this sta, having been a gd thi 157 Hq 332d Re R: this sta, is asgd to Sq c this G or of record. Dy 83N 359-B 9, Par ? 80 163 this Gp. cs is revok d. ( e (N) Sq this Gp given Dy/w Vase Operations. 10. .590 Sounders AP4301367 U 'F (N). Enl 20 c 45 for 3 yrs, Sq c this Gp, is reld for asgat and dy thereto, asgd to Hq and Hq q this Gp, DyB& 345. EDC.RR 17 Aug 48. 11. UP AR 600-115 Lv of abs is granted Pfc Joseph Ro 8 AF34993008 US/LF (N) 3q B this Gp, for twolvo (12) days off 15 hug 48. EH will rpt or dy NLT 26 hug 48. Address on lv 8 723 3 15th St . B1 ingham, Alabama HARREN D LIEX DER 1 t Lt., USALF Adjutant c 8 T R I c T E D R E S T R I C T E D HEA ADQUARTERS 332D FIGHTER WING LOCKB OURNE AIR FORCE BASE Columbus 17, Ohio SEE SAR 21 July 1948 SPECIAL ORDERS) NUMBER 150) 1. A SCM Board is hereby aptd to meet at the call of the president thereof for the trial of such persons as may be brought before it. DETAIL FOR THE COURT MAJ. GEORGE L KNOX USAF MAJ ARMOUR G McDANIEL USAF CAPT CHARLES R STANTON 1007050 USAF CAPT JOHN E LAKE USAF CAPT THOMAS M CLARK A047965 USAF 1ST LT RICHARD B CARTER A049744 USAF 1ST LT ALFRED J COIGNET 02049510 MSC 2d LT JOHN E WOODS A0590479 USIFF CAIT JAMES W REDDEN A0339059 USAF TJA 1ST LT CHARLES R HALL A01289415 JSAF Asst TJA CAFT DUDLEY WJ STEVENSON AO46385 USI.F 2D LT FRANK A TITUS A0589904 USAF Asst 21 unarraigned cases in the hands of the Trial Judge 'dvocate aptd per par 10 SO 22 this Hq dtd 30 Jan 48 are withdrawn from that court and. are re- ferred for trial to the Trial Judge Advocate of SCM Herein aptd. 2. 1ST LT CHARLES R HALL, A01289415 USAF Hq and Hq Sq 332d Airdrome Gp this sta is given and add dy as Claims 0 vice CAPT FRED L ALLEN, A0303893 USAF reld eff 1 Aug 48. 3. Eff this date, S/Sgt Edward E Johnson, AF42045481 USAF Air Sq 332d Maint and Supply Gp this sta is auth to reside off post, to rat sep fr orgn and auth non alws in lieu of rats 8 S prescribed in Sec IV DA Cir 74/47. Fmts will be continued while EM remains in this status and is chergerble to 907A16 2 411-07 2190502 's 99-999. 4. Pfc 055 Lee G Hawkins, AF33785484 USAF (N) having botn asgd this sta fr Sq F AF Assy Sta 3505th AFBU per per 13 SO 199 Hq Scott AFB Belloville, . Ill dtd 17 Jul 48 is asid 318th AFBU Proc cs Sep) (P/P) this sta for dy. EDCMR 23 Jul 48. Dy SSN 010. Enl 6 Feb 46 for 3 yrs. EM not COS. 5. S/Sgt 750-G Devid H Hinton, AF32241894 USAF (N) heving been asgd this sta fr Sq Q:107th AFBU, AFAS, (f/L) per par 8 LO 132 Hq AF Processing Sta 107th AFBU 'Ft Slocum, NY dtd 13 Jul 48 is asgd 318th AFBU (hssy, Proc's Sep) (p/1) this sta for dy. LDCMR 1 Aug 48. enl 4 Jun 48 for 3 yrs. Dy SSN 010. EM QOS. R E S T R L L R E S T R I C T E 1) SO Hq Ftr \"ig Lockbourne AFB 17 Ohio dtd 21 Jul 48 cont'd 6. Pfc 835 Luther i Brooks, AF43018675 USAF (H) having been asgd, this sta fr Sq D 4112th AFBU (Area Comd) (P/L) per par 4 SO 138 Hq Middletown Air Materiel Irea Olmsted AFB, Middletown`, Pa dtd 16 Jul 48 is asgd 318th AFBU (Assy, Proc & Sep) (1//)) this sta for dy. EDCMR 26 Jul 48. Dy SSN 010. Enl 2 Feb 46 for 3 yrs. EM not QOS. 7. Par 13 SO 145 this Hq, cs, is amended to add: \"TDN 902-7206 IP 432-02 A 2190425 S 33-024.\" (Re: COL BENJAMIN 0 DAVIS JR, A020146 USAF TDY Wash 25 8. VOCO dates indicated directing the fol named EM USAF orgns indicated this sta to proceed on TDY for approx one (i) day to Wright-Patterson AFB Dayton Ohio for the purpose of delivering and receiving laundry thereat and directing EM upon compl of TDY to ret to proper orgns this sta is confirmed and made.a matter of re- cord, the exigencies of the SV having precluded the issuance of orders in advance. ORGNS Eff dates Sgt James R Stewart, AF38742577 Sq E Gp 8, and Fvt Elwood A 1erce,Pal3161887 332d Sta Med Gp 15 Jul 48. TBGAA. UP 35-4520 FD will pay the prescribed mon alws in-lieu of rats a/r $2.25 per day for three -(3) days to two (2) EM ea. TD:J 907A16 I 411-07 2190- 502 S 99-999. 9. VOCO 19 Jul 48 directing the fol namod ENI orgns indicated this sta to proceed on TDY for approx one (1) day to Wright-Petterson AFB Dayton Ohio for the purpose of delivering and receiving laundry thereat and directing EM upon compl of TDY to ret to proper orinn this sta is confirmed and made a matter of record, the exigencies of the SV having precluded the issuance of orders in advaice. ORGNS Pfc Jack Mayle, AF45023571 Sq E 332d hirdrome Gp Pvt Elwood A Pierce, RA13161887 332d Sta Med Gp TBGAA. U1` AR 35-4520 FD will pay the prescribed mon alws in lieu of rats a/r $2.25 per day for one (1) day to two (2) EMV ea . TDN 907A16 P 411-07 2190502 S 99-999. 10. Par 1 SO 149 this Hq, cs, is as follows: (Re: 0's trfd fr 318th AFBU (Assy, Proc & Sep) this ste.) 2D LT IVAN WARE, A01848709 2D LT IVAN 401848706 2D LT JOSEPH M POWELL, 401848708 2D LT JOSEPH M POWELL, 401848707 11. LD COL BLAIR M SORENSEN, A045777 USAF Johd Hq and Hq Sq 332d Airdrome Gp this sta for flying dy is reld fr atchd thereto eff this date. 1 E MCGEE, A.0807103 USAF Hq and Hq Sq 332d Airdrome Gp this sta is aptd as Instructor Pilot of the C-47 Type acft eff this date. -2- TRICTED I D S T R I C T E D SO 150 Hq 332d Ftr Wg AF olumb S 17 Chio Jul 48 cont'd 13. Cpl Frederick Williams Jr, AF13226310 USAF Hq and Hq Sq 332d Ftr Wg this sta is granted lv of abs for thirty (30) ays off 27 Jul 48. Address while on lv: 817 Monticello Ave, Norfolk, Va. Rpt: date: 26 Aug 48. 14. Sgt 055 Joseph E Randall, AF33566731 USAF (.J.) 318th AFBU (Assy, Proc & Sep) (r/P) this sta is reld fr asgmt and dy thereto trfd 332d Ftr Gp (r/P) this sta for dy. EDCMR 1 Aug 48. Enl 26 Jul 46 for 3 yrs. EN not QCS. 15. The fol named EM USAF orgns this sta o/a 24 Jul 48 on TDY for approx twelve (12) wks to 3502d AFBU Chanute Ill for the purpose of pur- suing Crse #68500, Ap Electrical Mech, rptg upon to Commandant of school thereat NLT 0800 26 Jul 48 for classes beginning 28 Jul 48. Upon compl of TDY EM will ret to proper orgns this sta. c/c 04120. (Auth: Ltr Hq 9th AF Greenville SC subj: Almt of Quotas for Tech Crses dtd 28 Jun 48 and Ltr Hq TAC Langley AFB Va subj: Tng of Asga Pers dtd 22 Jun 48.) Dy SSN 685 Maint 332d Supply Gp Sgt Carroll E McDaniel, AF15040099 Cpl Norman R Bradshaw, AF15333557 Cpl Arnold R Tyler, AF13161556 Cpl Theodore D W Mecks, AF35757029 Pfc Robert R Jones, AF16208814 99th Ftr Sq (Se) 332d Ftr Gp Sgt Willie L McNair, AF36119254 Pfc Rayford Johnson, AF12288140 Tvl will be performed by mil acft, rail and/or bus fr. this sta to TDY sta, and ret. There nec NTO will furn nec T. PAC AR 30-2215 the RTO will dstermine and issue the rumber of meal tickets as the journcy may require. TDN 902-7206 IP 432-02 A 2190425 S 33-024. The'Budget and Fiscal 0 this sta certifies that available balance of funds chargeable to the accounting classification shown herein is sufficient and Finance 0 making payment against this order will fwd a copy of the paid voucher to the Budget and Fiscal 0 this sts. 16. The fol named EM USAF orgns indicated this sta WP o/a 24 Jul 48 on TDY for epprox (16) wk-s to 3502d AFBU Chanute AFB Ill for the purpose of pur- suing Crse ^p Instrument Mech, rptg upon crrival to. Commandant of school thereat NLT 0800 26 Jul 48 for classes beginning 28 Jul 48. Upon compl of TDY EM will ret to proper orghs this sta. .c/c.04120. Tuth: Ltr Hy 9th AF Greenville SC subj: Almt of Quotas for Tech Crses dtd 28 Jun 48 and Ltr Hq TAC Lengley AFB Va subj: Tng of Asga Pers dtd 22 Jun 48.) Dy SSN 686 ORGNS Cpl Plexander Gardner, AF18245930 Maint Sq Maint and Supply Gp Ffc Ihillip H Fletcher Jr, AF17226193 100th Ftr Sq 332d Ftr Gp Tvl will be performed by mil acft, rail and/or bus fr this sta to TDY sta, and ret. where nec RTO will furn nec T. PAC AR 30-2215 the RTO will determine and issue the number of meal tickets as the journey may require. TDN 902-7206 P 432-02 A 2190425 S 33-024. The Budget and Fiscal 0 this sta certifies that availsble balance of funds chargepble to the accounting; classification shown herein, is sufficent and Finance 0 making payment ag,ainst this order will fwd a copy of the paid voucher to the Budget and Fiscal 0 this sta. E D h E S T R I C T E D SO 150 Hq 332d Ftr Wg Lockbourne AFB Columbus 17 Ohio dtd 21 Jul 48 cont'd 17. Far 20 SO 148 this Hq`, cs, is revoked. (Re: 1ST LT COY CLEMONS JR, A01575865 USAF aptd Investigating 0.) 18. The fol named EM USAF (N) 318th AFBU (fssy, Proc & Sep) (P/F) this sta .are reld fr as .mt and dy, thereto trfd orgns indicated (r/P) this sta for dy. EDCMR 1 Aug 48. 332d Ftr Gp Fd and Date of Enlmt ifc 055 Alexander Munoz, AF12294804 3 yrs 29 Oct 47 Yes 332d firdrome Gp Cpl 822 Samuel Boynes, AF16206197 3 yrs 28 Jun 46 332d Maint and Supply Gp Pfc 405 Calvin Lindo, AF13207990 3 yrs 30 Jan 46 No 19. VOCO 19 Jul 48 directing the fol named EM USAF orgns indicated this sta to proceed on TDY for approx one (1) day to \\right-Patterson (FF Dayton Ohio for the purpose of delivering and receiving laundry thereat and directing EM upon comp of TDY to ret to proper orgns this sta is confirmed and made a matter of record, the exigencies of the S U having precluded the issuance of orders in advance Sgt James 0 Gilbert, AF35678321 Sq E 332d Airdrome Gp Pfc Richard Gross, AF13207159 Nir Supply Sq 332d Maint and Supply Gp TBGAA. UP AR 35--4520 FD will ppay the ir ecribed mo:1 alws in:lieu of rats a/r $2.25 per day for one (1) day to two (2) EM ea. TDM 907A16 P 411-07 2190502 S 99-999. BY ORDER OF COLONEL DAVIS: THOMAS J MONEY Major, USAF Asst Adjutant OFFICIAL: THOMKS J Major, USAF Asst DISTRIBUTION \"C\" R E 57. T R I C T E D R S T R I C T E D HEADQUARTERS 332D FIGHTER WING LOCKBOURNE AIR FORCE BASE Columbus 17, Ohio SEE PAR 16 July 1948 SPECIAL ORDERS) 1. So much of par 3 SO 144 this Hq, cs, as reads: Cpl Willie McCrae, AF43027787 USAF is amended to read: \"Cpl willie McCrae, RA43027787 ARWAF.' (Re: EMVI trf 3.32d Airdrome Gp this sta.) CHARLES E Hq and Hq Sq 332d Airdrome Gp this sta WP on DY O/ 21 Aug 48 for approx forty (40) wks to 3702a AFBU Chanute AFB Rantoul Ill rpts thereat NLT 23 Aug 48 for the purpose of attending Acft Maint Off Crse No. 48230 beginning 25 Aug 48. Upon compl of TDY Off. f.will ret to proper orgn this sta. C/C 04120. Dy SSN 2700. Tvl will be performed by mil acft or TPA. (Auth: TI 9AFAIG 311 Hq 9th AF Greenville SC dtd 9 Jul 48 and TT PER-B 331 Hq TAC Langley AFB Va dtd 8 Jul 48.) PIO-C1. Per diem auth only while traveling. TDN 902A7206 P 432-02 2190425 S 33-024. Govt grs will be used when avsilab,le and the provisions of TAC Reg 30-2 Hq TAC Langley AFB Va dtd 11 Feb 48 will be complied with. \"Voucher fcr reimbursement under this order must be submitted to Finance 0 within tnirty (30) days efter compl of TDY. The Budget and Fiscal 0 this sta certifies that evailwble bebence of funds chargeable to the accounting clessifica- tion shown herein is sufficient end Fimance 0 making poyment against this order will fwd F copy of the paid voucher to the Budget n d Fiscel 0 this sts. 3. VOCO 3 May 48 appointing MMJ .ARMOUR G MCDANIELS, 4033592 USAF Nq 332d Ftr Gp this sta actg Top Secret Control 0 in the tamp. abs of MAJ WILLIAM T MATTISON, 1044072 USAF is confirmed and made &. motier of record. 4. The fol named EM USAF (N) 318th AFBU (Assy, Proc & Sep) (P/P) this sta are reld fr ssgmt and dy thereto trfd orgns indicated (P/P) this sta. EDCMR 21 Jul 332d hirdrome Gp Pd and Date of Enlmt QOS Cpl 014 Lawrence H Danisls, AF15223706 3 yrs 19 Feb 46 No Pfc 345 Clifford H Mitchell, AF18197311 3 yrs 28 Feb 46 No 33%d Ftr Gp Pvt 747-B Fronk Jr, 3 yrs: 11 Feb 48. Yes 332d Maint.'81 Supply Gp S/Sgt 750-G Joseph P Williems, AF33325784 3 yrs 5 Mer 46 E S R I C T E D R E E D SO 146 Hq 332d Ftr Ws Lockbourne AFB Columbus 17 Ohio dtd 16 Jul 48 cont'd 4. 1ST LT WILLIAM R WATKINS, JR, A0584739 USAF' Sq B 332d Airdrome Gp this sta is auth to proceed on DS o/a 18 Jul 48 for approx four (4) days to Warrant Officer Screening Ctr, Post-226M, Bldg .287, Lrea A, AFB Dayton Ohio rpti NLT 0800 hours 19 Jul 48 for the purpose of processing application for Apmt as Warrant Off in the Regular Sv. NEG. (huth: TT TSWMT-7-6 Hq Wright-Pat- terson AFB Dayton Ohio dtd 14 Jul-48.) 5. The fol named EM USAF Sq C 332a hirdrome Gp this sta WP on TDY o/a 16 Jul 48 sixteen (16) wks to Ft Francis E Warren, Cheyenne, wyo for the pur- pose of attending Welding & 8lacksmith Tech Crse +-25601 rptg NLT 0800 19 Jul 48 to Commandant of school therest. Upon compl of TDY will ret to proper orgn this sta. C/C 04120. Dy SSN 256. (huth: Ltr Hq 9th AF Greanville SC Almt of Quotas for Tech Crses dtd 9 Jun 48 and ltr Hq TAC Langley AFB, Ve subject same as rbote dtd 3 Jun 48.) sta by mil acft, rail and /or bus to Wright-Patterson /FB Dayton Ohio: MAT fr wright-Patterson AFB Dayton Ohio to Hill AFB Ogden Utah. Rail fr \"Ogden Utah to Cheyenne, Wyo. For ret, tvl over same route as directed above. Pfc Ezra M Hill, AF13161161 Cpl James H Johnson, AF35373465 RTO will furn nec T. PAC AR 30-2215 the RTO will determine and issue the number of meal tickets as the journey may require. The Buaget and Fiscal 0 this sta certifies that available balance of funds chargeable to the accounting class- ification shown herein is sufficiont and Finance 0 making payment ogainst this order will fwd a copy of the paid voucher to the Budget and Fiscal J this sta. 6. Pfc 521 Lonnie E McMillon, AF18310370 USAF (N) (non-flying. Enl 27 lug 47 for 3 yrs. No 0/s Sv. Dato of Birth: 3 0ct 29. EM QOS.) 99th Ftr Sq (SE) 332d Ftr Gp this sta (P/P) is reld fr asgmt and dy thereto trfd in gr WP c/a 20 Jul'48 to 384th-f.1 Banu, Ft Eustis, Va (P/P) rpts upon arrival to CO thereat for asgmt and dy. EDCMR 28 Jul 48. Rptg date: 31 Jul 48. PCS. 'EM will. apply against Requisition E-1 dtd 20 hay 48, Chief of Transportation,Wa DC. EM de- partmental st: tus is changed Oil date of transfer fr USAF to US irmy. Individual records and morning reports will show proper entry as specified in par 4, JAAFAR 1-1-2 dtd 22 Dec 47. TDN 901A16 P 431-02 03 2190425 S 99-999. (huth: 7th Ind; AGO Dept of the krmy, Wash 25 DC dta 30 Jun 48.) Eivi auth ten (10) days delay enroute plus one (1) day tvl time not to in- terfere with rptg date. In accordance w/ir 35-4810 FD will pay in advance mon elws in lieu of trensportetion a/r 32 per mile fr this sts to Ft Eustis, Va and will pay ; lieu of subs c/r $1.25 per meal for three (3) meals t one (1) EM. 7. VOCO 15 Jul 48 directing the fol named Eiri USAF Meint Sq 332d Maint and Supply Gp this sta to proceed on TDY for approx three (3) apys to Shaw AFB Sumter SC for the purpose of performing required maintenance on F-47N Acft and directing EM upon compl of TDY to ret to proper orgn this sta is confirmed and made a matter of record, the exigencies of the SV having precluded the issuance of orders in ad- veace. Tvl will be performed by mil acft. -2- R R D R S T R I C T L $0 146 Hq 332d Wg Lockbourne 1.FB Columbus 17 Ohio par 7 dtd 16 Jul 48 cont'd T/Sgt Walter S Beard, nF14003674 S/Sgt Frank Pollard, AF34097593 Set ^ndrew Amos, AF38728622 8. The fol named EM USAF (:) ) 318th AFBU (fssy, Proc & Sep) (P/P) this sta are reld fr asgmt and dy thereto trfd 332d Maint and Supply Gp (P/P) this sta for dy. EDCMR 21 Jul 48. EM QOS. Pd and Date of Enlmt Pvt 756-V William T Evais, AF14258387 3 yrs 24 Jul 47 Pvt 756-V James Harris Jr, AF14258363 3 yrs 23 Jul 47 9. The fol named EM USAF orens indicated this sta WP o/a dates indicated on TDY for approx one (1) day to [right-Patterson `FB Dayton Ohio for the purpose of delivering and receiving loundry thereat. Upon compl of TDY EM will ret to proper orgns this sta. LM will proceed o la. 16, 20 and 2-2 Jul 48. ORG:JS Sgt James O,Gilbert, 1F35678321 Sq E 3332 irdrome Gp Pfc Richs rd Gross, AF13207139 Air Supply Sq 332d Maint &: Supply Gp TBGAM. UP AR 35-4520 FD will pay the prescribed mon alws in lieu of rats 8/r $2.25 per day for three (3) days to two (2) Li.1 62.. TD:J 2190502 907A16 P 411-07 S 99-999. 10. The fol named EM USAF (N) having been asgd this sta fr Sq F 10th Airdrome Gp (P/L) per par 12 SO 142 Hq 10th firdrome Gp Pope AFB, Ft Bragg NC dtd 13 Jul 48 are asidd 318th AFBU (hssy, Proc & Sep) (P/P) this sts for dy. EDCMR 20 Jul 48. Dy, SSN 010. EM euth-eight (,) ) days delay enroute plus official tvl time. * EM auth no delay enroutc. Pd and Date of Enlmt QOS F/Sgt 502 Raphael D Showell, AF33333732 3 yrs 24 Jan 46 (TPA) No S/Sgt 502 Maceo Ward, F34865625 3 yrs 16 Jan 46 (TP No Sgit 242 Jemes R Herntion, AF38448246 3 yrs 14 Fab 46 No Col 017 Paul J Ervin, AF35866727 3 yrs 26 Jan 47 Yes Pfc 144 Jimmie Gilbert Jr, ^F14215405 3 yrs 2 Mar 46 No 11. Pfc 747-G Willie F NcElrath, AF14211737 USAF (N) having been-cisgd this sta fr 3202d Maint Rep &: Util Sq (P/L) per par 3 SO 1 Hq 3202d Air sallations Gp Lglin AFB Fla dtd 9 Jul 48 is asgd 318th AFBU (fssy, Proc &: Sep) (P/P) this sta for dy. EDCMR 21 Jul 48. Dy SSN 010. Pd and Date of Lnlmt Unk. 12. Pfc 657 Andrews, .F34559256 US/.F (N) having been ssid this sta fr 3202d Mnint Rep & Util Sq (P/L) per par 3 SO 1 Hq 320d ir instrllations Gp Eglin AFB Fla dtd 9 Jul 48 is asgd 332d Sta Med Gp (P/P) this sts for dy. EDCMR 21 Jul 48. Ly SSN 010. Pd and Date of Enlmt Unk. 13. Pvt 566 rtory Brown, 1F6932617 USAF (N) levine been this sta fr Hq and Hq Sq 301st Airurome Gp (P/L) per par 2 SO 141 Hig; 301st Bombardment Wg, VH, Cmoky Hill AFB Salina, Kensas dtd 14 Jul 48 is assd 318th `FBU (.!.ssy, Proc & Sep) (P/P.) this sta for dy. EDCMR 22 Jul 48. Dy SSN 010. Pd and Date of Enlmt Unk. -3- RES T'R I C T E D SO 146 Hq 332d W. Lockbourne AFB Columbus 17 Ohio dtd 16 Jul 48 cont'd 14. The fol named iM USAF (.) having bean asgu this sta fr Sq F 313th Air- drome Gp (P/P) per par 12 SO 133 Hq 313th irdrome up Bergstrom AFB Austin, Tex dtd 12 Jul 48 are esgd 318th AFB (Assy, Proc & Sep) (P/P) this sta for dy. EDCMR 20 Jul 48. Dy SSN 010. Pd and Datc of Enlmt Unk. Sgt 677 Theodore Grant, AF34654523 Sgt 677 Lee Christmas, 4F34992222 405 George N Peeples, AF14199667 Pfc 405 Calvin Lindo, AF13207990 Pfc 677 Robert M Coleman, AF11170755 677 John H Petway Jr, AF12268283 Thomes Glover, AF44090953 Pfc 677 Hurl L Beechum, AF17220224 Pfc Abney, AF14127925 Pfc 677 Andrew Folson, 4F16239184 Pfc 555 John D Petty, AF16179745 EM auth thirty (30) days delay rptc NLT 17 fug 48. Pfc 620 Harvey W Rolan, AF12291359 ET. lauth ten (10) days delay rpts NLT 28 Jul 48. T/Sgt 502 Junias C Cochren, AF38383365 EM auth seven (7) days delay rptg NJLT 25 Jul 48. Pfc 405 Richard N Ponce, AF12251596 EM futh fifteen (1a) uays delay rptg NLT 2 fug 48. Cpl 405 willie L Jordan, AF14235920 EM auth seven (7) day delay rptg NLT 25 Jul 48. Pfc 055 Charles J Be vrotte, F18300834 EM auth seven (7) days delay rptg NLT 25 Jul 48. Pfc 405 Woodrow, Cartor, AF15262339 Elvi auth seven (7) days delay rptg NLT 25 Jul 48. Cpl 677 Coleman Lane, AF34954214 EM auth ten (10) days delay rptg NLT 28 Jul 48. Pfc 055 Booker T Ware Jr, AF13215283 EM auth fifteen (15) days delay rptg NLT 2 fug 48%. Pfc 677 John Lloyd, AF16239225 EM auth ten (10) days delay rptg NLT 28 Jul 48. Pfc 677 Roger Johnson, AF18325161 EM auth seven (7) days delay rptg NLT 25 Jul 48. Pfc 055 John H Burden, AF35964924 EM auth twenty (20) days delay rptg NLT 7 Aug4 Pfc 677 Claud J Powell, AF18292343 auth ten (10) days delay rptg NLT 28 Jul 48. Pfc 05.5 Jimnie C Dovane, AF13254900 Livi auth seven (7) days delay rpt NLT 25 Jul 48. 15. Cpl 822 Samuel E Boynes, AF16206197 USAF (.1) having been asgd this sta fr Sq F-1 3502d AFBU (TS) (R/L) per par 32 SO 164 Hq Chanute AFB Rantoul Ill dta 14 Jul 48 is asgd 318th ^FBU (Assy, Proc & Sep) (P/P) this sta for dy. EDCMR 20 Jul 48. Dy SNN-010. Enl 28.Jun 46 for 3.yrs. EM not QOS. 16. The fol named EM USAF (N) havin boen asgd this sta fr Sq F 316th-h drome Gp (P/P) per par 2 SO 134 Hq 316th firdrome Gp Greenville ^FB Groenville SC dtd 13 Jul 48 are s gidd 318th AFBU (Assy, Proc c: (P/P) this sta for dy. EDCMR 24 Jul 48. Dy SSN 010. nuth twenty (20) days .delay enroute. and Date of Exlmt QOS Pfc 055 Norman Corbett, AF15230900 18 Ju.1 Yes Pfc -055 Willie Gay, AF16251040 yrs 6 Yes Pfc 522 Lewis Daniels, /F34938553 yrs 30 Dec Yes 835 .Samuel Foster, 1.F44161754 yrs Dec 47 Yes Pvt 242 Shadrick hitcholl, AF38056844 yrs 9 Yes T R T L D $0.146 Hq 332d Ftr Vig Lockbourne 'FB Columbus 17 Ohio dtd 16 Jul 48 cont'a 17. The fol named EM USAF (N) having been asgd this sta fr Sq F 363d Airdrome Gp (P/P) por par 1 0.141 Hq 363d Airdrome Gp Langley AFB Vs dtd 14 Jul 48 are asgd 318th AFBU (Assy, Proc & Sep) (P/P) this st for dy. EDCMR 24 Jul 48. Dy SSN 010. Pd End Date of enlmt T/Sgt 822 James Davis Jr, AF34424971 3 yrs 17 Jan 46 T/Sgt 965 James H Peterson, AF33089524 3 yrs 7 Jul 47 Yes (EM On TDY 316th Troop Carrier Wg, Greenville SC for approx 45 days eff 28 Jun 48) Sgt 911 Joseph- R Sellers, AF16029948 3 yrs 24 Jun 47 Yes (JMM auth twelve (12) days delay enroute rptg NLT 31 Jul 48.) Sgt 815 William J Williams, AF14211967 3 yrs 5 Mar 46 No Cpl 348 Douglas D Hopper, AF12185893 3 yrs 22 Aug 47 (EM auth four (4) days delay enroute rptg NLT 24 Jul 48.) Cpl 050 Thomas L Browne, AF34027074 3 yrs 10 Sep 47 Yes (eM-auth five (5) days delay enroute rptg NLT 25 Jul 48.) Pfc 442 Henry P Buchanan, AF42177650 3 yrs 30 Jun 46 No (EM auth ton (10) days delay enroute rptg NLT 29 Jul 48. Cpl 275 Frank W Washington Jr, AF13207557 3 yrs 4 Mar 46 No Pfc 859 Hoses Bolar, AF44146615 3 yrs 4 May 46 No (EM auth twelve (12) dpys delay enroute rptg NLT 31 Jul 48.) Ffc 239 Walter D Terry, AF14247304 3 yrs 8 May 47 Yes (EM suth twelve (12) dPys deley enroute rptg MLT 31 Jul 48.) Pfc 239 Robert A Cartor, 3 yrs 6 May 47 Yes (EM auth twelve (12) drys aclay enroute rptg NLT 31 Jul 48.) 18. Eff this date, the fol named EM USAF hir Supply Sq 332d Maint and Supply Gp this sta are auth to reside off post, to rat sep fr orgn and auth mon alws in lieu of rats E S prescribed in Sec IV DA Cir 74/47. Ints will be continued while EM remain in this status and are chargeable to 907/16 1 411-07 2190502 S 99-999. T/Sgt Nothaniel 0 Browne, AF36164082 Pfc James W Whitney, AF15225699 19. Pvt 345 Clarence King, AF17195559 USAF (N) (non-flying Enl 25 May 46 for 3 yrs. Bight (8) mos 0/s Date of ret fr O/S 6 May 47. EM not QOS. Date of Birth: 7 May 29. Sq C 332d firdrome Gp (P/T) this sta is reld fr asgmt and dy thereto trfd in gr WP o/a 21 Jul 48 to The Ground Gen Sch Ctr, Ft Riley, Kansas (P/P) rptg upon srrival to CO therent for asgitt and. dy. EDCMR 24 Jul 48. Rpt date: 23 Jul 48. jCS. EM departmental status is changed on date of transfer fr USAF to US Army. Individual records and morning reports will show proper entry as specified in par 4, JAAFAR 1-1-2 dtd 22 Dec 47. RTO will furn nec T. PAC AR 30-2215 the RTO will determine and issue the number of meal tickets as he-:journey may require. TDN 901A16 ? 431-02 03 2190425 S 99-999. (Auth: 9th Ind, AGO, Dopt of the Army, Wash 25 DC dtd 25 Jun 48.-) 20. The P-SSN of Pfc James T Stroman, AF16239212 USAF Hq and Hq Sq 332d Ftr Vg.atchd Sq r 318th /FFU (Assy, iroc &; Sep) this sta is chrnned fr 405 (s/Sk) to 405. (Sk) eff this date. (Juth: AF Manual 35-0-1.) -5- R E R I C T E D R X S T R I C T E D SO 146 Hq 332d Ftr Wg Lockbourne AFB Columbus 17 Ohio dtd 16 Jul 48 cont'd 21. CAPT PAULUS C TAYLOR, A049234 USAF Hq and Hq Sq 332d Ftr Wg this sta is given an add dy as Wg Postal 0 eff this dnte. 22. CAPT PRULUS C TAYLOR , 4.049234 US/ F Hq and Hq Sq 332d Ftr THo this sta is aptd Wg Penalty Control 0 vice MAJ THOMLS J MCNEY, A0563862 USIF reld eff this date. (add dy) BY OR DER OF COLONEL DAVIS: PHULUS C TAYLOR Capt, USIFF Adjutant OFFICIAL: DISTRIBUTICII \"C\" -6- R E S T R I C. . C T L C"}